podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/****************************************************************************************************//**
 * @file     $(targetDevice).h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for MK61F15WS.
 *           Equivalent: 
 *
 * @version  V1.6
 * @date     2016/02
 *
 *******************************************************************************************************/

#ifndef MCU_MK61F15WS
#define MCU_MK61F15WS

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/**
* @addtogroup Interrupt_vector_numbers_GROUP Interrupt vector numbers
* @brief Vector numbers required for NVIC functions
* @{
*/
/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
 * Interrupt vector numbers
 */
typedef enum {
/* ------------------------  Processor Exceptions Numbers  ------------------------- */
  Reset_IRQn                    = -15,   /**<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /**<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /**<   3 Hard Fault, all classes of Fault                                                 */
  MemoryManagement_IRQn         = -12,   /**<   4 Memory Management, MPU mismatch, including Access Violation and No Match         */
  BusFault_IRQn                 = -11,   /**<   5 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault   */
  UsageFault_IRQn               = -10,   /**<   6 Usage Fault, i.e. Undef Instruction, Illegal State Transition                    */
  SVCall_IRQn                   =  -5,   /**<  11 System Service Call via SVC instruction                                          */
  DebugMonitor_IRQn             =  -4,   /**<  12 Debug Monitor                                                                    */
  PendSV_IRQn                   =  -2,   /**<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /**<  15 System Tick Timer                                                                */
/* ----------------------   MK61F15WS VectorTable                    ---------------------- */
  DMA0_DMA16_IRQn               =   0,   /**<  16 Direct memory access controller                                                  */
  DMA1_DMA17_IRQn               =   1,   /**<  17 Direct memory access controller                                                  */
  DMA2_DMA18_IRQn               =   2,   /**<  18 Direct memory access controller                                                  */
  DMA3_DMA19_IRQn               =   3,   /**<  19 Direct memory access controller                                                  */
  DMA4_DMA20_IRQn               =   4,   /**<  20 Direct memory access controller                                                  */
  DMA5_DMA21_IRQn               =   5,   /**<  21 Direct memory access controller                                                  */
  DMA6_DMA22_IRQn               =   6,   /**<  22 Direct memory access controller                                                  */
  DMA7_DMA23_IRQn               =   7,   /**<  23 Direct memory access controller                                                  */
  DMA8_DMA24_IRQn               =   8,   /**<  24 Direct memory access controller                                                  */
  DMA9_DMA25_IRQn               =   9,   /**<  25 Direct memory access controller                                                  */
  DMA10_DMA26_IRQn              =  10,   /**<  26 Direct memory access controller                                                  */
  DMA11_DMA27_IRQn              =  11,   /**<  27 Direct memory access controller                                                  */
  DMA12_DMA28_IRQn              =  12,   /**<  28 Direct memory access controller                                                  */
  DMA13_DMA29_IRQn              =  13,   /**<  29 Direct memory access controller                                                  */
  DMA14_DMA30_IRQn              =  14,   /**<  30 Direct memory access controller                                                  */
  DMA15_DMA31_IRQn              =  15,   /**<  31 Direct memory access controller                                                  */
  DMA_Error_IRQn                =  16,   /**<  32 DMA error interrupt all channels                                                 */
  FTF_Command_IRQn              =  18,   /**<  34 Flash Memory Interface                                                           */
  FTF_ReadCollision_IRQn        =  19,   /**<  35 Flash Memory Interface                                                           */
  PMC_IRQn                      =  20,   /**<  36 Power Management Controller                                                      */
  LLWU_IRQn                     =  21,   /**<  37 Low Leakage Wakeup                                                               */
  WDOG_IRQn                     =  22,   /**<  38 External Watchdog Monitor                                                        */
  RNG_IRQn                      =  23,   /**<  39 Random Number Generator                                                          */
  I2C0_IRQn                     =  24,   /**<  40 Inter-Integrated Circuit                                                         */
  I2C1_IRQn                     =  25,   /**<  41 Inter-Integrated Circuit                                                         */
  SPI0_IRQn                     =  26,   /**<  42 Serial Peripheral Interface                                                      */
  SPI1_IRQn                     =  27,   /**<  43 Serial Peripheral Interface                                                      */
  SPI2_IRQn                     =  28,   /**<  44 Serial Peripheral Interface                                                      */
  CAN0_Message_IRQn             =  29,   /**<  45 Flex Controller Area Network module                                              */
  CAN0_BusOff_IRQn              =  30,   /**<  46 Flex Controller Area Network module                                              */
  CAN0_Error_IRQn               =  31,   /**<  47 Flex Controller Area Network module                                              */
  CAN0_Tx_IRQn                  =  32,   /**<  48 Flex Controller Area Network module                                              */
  CAN0_Rx_IRQn                  =  33,   /**<  49 Flex Controller Area Network module                                              */
  CAN0_WakeUp_IRQn              =  34,   /**<  50 Flex Controller Area Network module                                              */
  I2S0_Tx_IRQn                  =  35,   /**<  51 Synchronous Serial Interface                                                     */
  I2S0_Rx_IRQn                  =  36,   /**<  52 Synchronous Serial Interface                                                     */
  CAN1_Message_IRQn             =  37,   /**<  53 Flex Controller Area Network module                                              */
  CAN1_BusOff_IRQn              =  38,   /**<  54 Flex Controller Area Network module                                              */
  CAN1_Error_IRQn               =  39,   /**<  55 Flex Controller Area Network module                                              */
  CAN1_Tx_IRQn                  =  40,   /**<  56 Flex Controller Area Network module                                              */
  CAN1_Rx_IRQn                  =  41,   /**<  57 Flex Controller Area Network module                                              */
  CAN1_WakeUp_IRQn              =  42,   /**<  58 Flex Controller Area Network module                                              */
  UART0_LON_IRQn                =  44,   /**<  60 Serial Communication Interface                                                   */
  UART0_RX_TX_IRQn              =  45,   /**<  61 Serial Communication Interface                                                   */
  UART0_ERR_IRQn                =  46,   /**<  62 Serial Communication Interface                                                   */
  UART1_RX_TX_IRQn              =  47,   /**<  63 Serial Communication Interface                                                   */
  UART1_ERR_IRQn                =  48,   /**<  64 Serial Communication Interface                                                   */
  UART2_RX_TX_IRQn              =  49,   /**<  65 Serial Communication Interface                                                   */
  UART2_ERR_IRQn                =  50,   /**<  66 Serial Communication Interface                                                   */
  UART3_RX_TX_IRQn              =  51,   /**<  67 Serial Communication Interface                                                   */
  UART3_ERR_IRQn                =  52,   /**<  68 Serial Communication Interface                                                   */
  UART4_RX_TX_IRQn              =  53,   /**<  69 Serial Communication Interface                                                   */
  UART4_ERR_IRQn                =  54,   /**<  70 Serial Communication Interface                                                   */
  UART5_RX_TX_IRQn              =  55,   /**<  71 Serial Communication Interface                                                   */
  UART5_ERR_IRQn                =  56,   /**<  72 Serial Communication Interface                                                   */
  ADC0_IRQn                     =  57,   /**<  73 Analogue to Digital Converter                                                    */
  ADC1_IRQn                     =  58,   /**<  74 Analogue to Digital Converter                                                    */
  CMP0_IRQn                     =  59,   /**<  75 High-Speed Comparator                                                            */
  CMP1_IRQn                     =  60,   /**<  76 High-Speed Comparator                                                            */
  CMP2_IRQn                     =  61,   /**<  77 High-Speed Comparator                                                            */
  FTM0_IRQn                     =  62,   /**<  78 FlexTimer Module                                                                 */
  FTM1_IRQn                     =  63,   /**<  79 FlexTimer Module                                                                 */
  FTM2_IRQn                     =  64,   /**<  80 FlexTimer Module                                                                 */
  CMT_IRQn                      =  65,   /**<  81 Carrier Modulator Transmitter                                                    */
  RTC_Alarm_IRQn                =  66,   /**<  82 Real Time Clock                                                                  */
  RTC_Seconds_IRQn              =  67,   /**<  83 Real Time Clock                                                                  */
  PIT0_IRQn                     =  68,   /**<  84 Periodic Interrupt Timer                                                         */
  PIT1_IRQn                     =  69,   /**<  85 Periodic Interrupt Timer                                                         */
  PIT2_IRQn                     =  70,   /**<  86 Periodic Interrupt Timer                                                         */
  PIT3_IRQn                     =  71,   /**<  87 Periodic Interrupt Timer                                                         */
  PDB0_IRQn                     =  72,   /**<  88 Programmable Delay Block                                                         */
  USB0_IRQn                     =  73,   /**<  89 Universal Serial Bus                                                             */
  USBDCD_IRQn                   =  74,   /**<  90 USB Device Charger Detection                                                     */
  ENET_1588Timeout_IRQn         =  75,   /**<  91 Ethernet MAC-NET Core                                                            */
  ENET_Transmit_IRQn            =  76,   /**<  92 Ethernet MAC-NET Core                                                            */
  ENET_Receive_IRQn             =  77,   /**<  93 Ethernet MAC-NET Core                                                            */
  ENET_Error_IRQn               =  78,   /**<  94 Ethernet MAC-NET Core                                                            */
  SDHC_IRQn                     =  80,   /**<  96 Secured Digital Host Controller                                                  */
  DAC0_IRQn                     =  81,   /**<  97 Digital to Analogue Converter                                                    */
  DAC1_IRQn                     =  82,   /**<  98 Digital to Analogue Converter                                                    */
  TSI0_IRQn                     =  83,   /**<  99 Touch Sense Interface                                                            */
  LPTMR0_IRQn                   =  85,   /**< 101 Low Power Timer                                                                  */
  PORTA_IRQn                    =  87,   /**< 103 General Purpose Input/Output                                                     */
  PORTB_IRQn                    =  88,   /**< 104 General Purpose Input/Output                                                     */
  PORTC_IRQn                    =  89,   /**< 105 General Purpose Input/Output                                                     */
  PORTD_IRQn                    =  90,   /**< 106 General Purpose Input/Output                                                     */
  PORTE_IRQn                    =  91,   /**< 107 General Purpose Input/Output                                                     */
  PORTF_IRQn                    =  92,   /**< 108 General Purpose Input/Output                                                     */
  DDR_IRQn                      =  93,   /**< 109 DRAM Controller                                                                  */
  NFC_IRQn                      =  95,   /**< 111 NAND flash controller                                                            */
  USBHS_IRQn                    =  96,   /**< 112 USB High Speed Interrupt                                                         */
  CMP3_IRQn                     =  98,   /**< 114 High-Speed Comparator                                                            */
  Tamper_IRQn                   =  99,   /**< 115 Tamper Detect and Secure Key Storage                                             */
  FTM3_IRQn                     = 101,   /**< 117 FlexTimer Module                                                                 */
  ADC2_IRQn                     = 102,   /**< 118 Analogue to Digital Converter                                                    */
  ADC3_IRQn                     = 103,   /**< 119 Analogue to Digital Converter                                                    */
  I2S1_Tx_IRQn                  = 104,   /**< 120 Synchronous Serial Interface                                                     */
  I2S1_Rx_IRQn                  = 105,   /**< 121 Synchronous Serial Interface                                                     */
} IRQn_Type;

