podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/* CAN0 - Peripheral instance base addresses */
#define CAN0_BasePtr                   0x40024000UL //!< Peripheral base address
#define CAN0                           ((CAN_Type *) CAN0_BasePtr) //!< Freescale base pointer
#define CAN0_BASE_PTR                  (CAN0) //!< Freescale style base pointer
/**
 * @} */ /* End group CAN_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CAN_Peripheral_access_layer_GROUP CAN Peripheral Access Layer
* @brief C Struct for CAN
* @{
*/

/* ================================================================================ */
/* ================           CAN1 (derived from CAN0)             ================ */
/* ================================================================================ */

/**
 * @brief Flex Controller Area Network module
 */

/* CAN1 - Peripheral instance base addresses */
#define CAN1_BasePtr                   0x400A4000UL //!< Peripheral base address
#define CAN1                           ((CAN_Type *) CAN1_BasePtr) //!< Freescale base pointer
#define CAN1_BASE_PTR                  (CAN1) //!< Freescale style base pointer
/**
 * @} */ /* End group CAN_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CAU_Peripheral_access_layer_GROUP CAU Peripheral Access Layer
* @brief C Struct for CAU
* @{
*/

/* ================================================================================ */
/* ================           CAU (file:CAU_0)                     ================ */
/* ================================================================================ */

/**
 * @brief Memory Mapped Cryptographic Acceleration Unit
 */
/**
* @addtogroup CAU_structs_GROUP CAU struct
* @brief Struct for CAU
* @{
*/
typedef struct {                                /*       CAU Structure                                                */
   __O  uint32_t  DIRECT[16];                   /**< 0000: Direct access register                                       */
   __I  uint32_t  RESERVED0[512];              
   __O  uint32_t  LDR_CASR;                     /**< 0840: Status register - Load Register command                      */
   __O  uint32_t  LDR_CAA;                      /**< 0844: Accumulator register - Load Register command                 */
   __O  uint32_t  LDR_CA[9];                    /**< 0848: General Purpose Register  - Load Register command            */
   __I  uint32_t  RESERVED1[5];                
   __I  uint32_t  STR_CASR;                     /**< 0880: Status register  - Store Register command                    */
   __I  uint32_t  STR_CAA;                      /**< 0884: Accumulator register - Store Register command                */
   __I  uint32_t  STR_CA[9];                    /**< 0888: General Purpose Register  - Store Register command           */
   __I  uint32_t  RESERVED2[5];                
   __O  uint32_t  ADR_CASR;                     /**< 08C0: Status register  - Add Register command                      */
   __O  uint32_t  ADR_CAA;                      /**< 08C4: Accumulator register - Add to register command               */
   __O  uint32_t  ADR_CA[9];                    /**< 08C8: General Purpose Register  - Add to register command          */
   __I  uint32_t  RESERVED3[5];                
   __O  uint32_t  RADR_CASR;                    /**< 0900: Status register  - Reverse and Add to Register command       */
   __O  uint32_t  RADR_CAA;                     /**< 0904: Accumulator register - Reverse and Add to Register command   */
   __O  uint32_t  RADR_CA[9];                   /**< 0908: General Purpose Register  - Reverse and Add to Register command */
   __I  uint32_t  RESERVED4[21];               
   __O  uint32_t  XOR_CASR;                     /**< 0980: Status register  - Exclusive Or command                      */
   __O  uint32_t  XOR_CAA;                      /**< 0984: Accumulator register - Exclusive Or command                  */
   __O  uint32_t  XOR_CA[9];                    /**< 0988: General Purpose Register  - Exclusive Or command             */
   __I  uint32_t  RESERVED5[5];                
   __O  uint32_t  ROTL_CASR;                    /**< 09C0: Status register  - Rotate Left command                       */
   __O  uint32_t  ROTL_CAA;                     /**< 09C4: Accumulator register - Rotate Left command                   */
   __O  uint32_t  ROTL_CA[9];                   /**< 09C8: General Purpose Register  - Rotate Left command              */
   __I  uint32_t  RESERVED6[69];               
   __O  uint32_t  AESC_CASR;                    /**< 0B00: Status register  - AES Column Operation command              */
   __O  uint32_t  AESC_CAA;                     /**< 0B04: Accumulator register - AES Column Operation command          */
   __O  uint32_t  AESC_CA[9];                   /**< 0B08: General Purpose Register  - AES Column Operation command     */
   __I  uint32_t  RESERVED7[5];                
   __O  uint32_t  AESIC_CASR;                   /**< 0B40: Status register  - AES Inverse Column Operation command      */
   __O  uint32_t  AESIC_CAA;                    /**< 0B44: Accumulator register - AES Inverse Column Operation command  */
   __O  uint32_t  AESIC_CA[9];                  /**< 0B48: General Purpose Register  - AES Inverse Column Operation command */
} CAU_Type;

/**
 * @} */ /* End group CAU_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'CAU' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup CAU_Register_Masks_GROUP CAU Register Masks
* @brief Register Masks for CAU
* @{
*/
/* ------- DIRECT Bit Fields                        ------ */
/* ------- LDR_CASR Bit Fields                      ------ */
#define CAU_LDR_CASR_IC_MASK                     (0x01UL << CAU_LDR_CASR_IC_SHIFT)                   /*!< CAU_LDR_CASR: IC Mask                   */
#define CAU_LDR_CASR_IC_SHIFT                    0                                                   /*!< CAU_LDR_CASR: IC Position               */
#define CAU_LDR_CASR_DPE_MASK                    (0x01UL << CAU_LDR_CASR_DPE_SHIFT)                  /*!< CAU_LDR_CASR: DPE Mask                  */
#define CAU_LDR_CASR_DPE_SHIFT                   1                                                   /*!< CAU_LDR_CASR: DPE Position              */
#define CAU_LDR_CASR_VER_MASK                    (0x0FUL << CAU_LDR_CASR_VER_SHIFT)                  /*!< CAU_LDR_CASR: VER Mask                  */
#define CAU_LDR_CASR_VER_SHIFT                   28                                                  /*!< CAU_LDR_CASR: VER Position              */
#define CAU_LDR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_LDR_CASR_VER_SHIFT))&CAU_LDR_CASR_VER_MASK) /*!< CAU_LDR_CASR                            */
/* ------- LDR_CAA Bit Fields                       ------ */
/* ------- LDR_CA Bit Fields                        ------ */
/* ------- STR_CASR Bit Fields                      ------ */
#define CAU_STR_CASR_IC_MASK                     (0x01UL << CAU_STR_CASR_IC_SHIFT)                   /*!< CAU_STR_CASR: IC Mask                   */
#define CAU_STR_CASR_IC_SHIFT                    0                                                   /*!< CAU_STR_CASR: IC Position               */
#define CAU_STR_CASR_DPE_MASK                    (0x01UL << CAU_STR_CASR_DPE_SHIFT)                  /*!< CAU_STR_CASR: DPE Mask                  */
#define CAU_STR_CASR_DPE_SHIFT                   1                                                   /*!< CAU_STR_CASR: DPE Position              */
#define CAU_STR_CASR_VER_MASK                    (0x0FUL << CAU_STR_CASR_VER_SHIFT)                  /*!< CAU_STR_CASR: VER Mask                  */
#define CAU_STR_CASR_VER_SHIFT                   28                                                  /*!< CAU_STR_CASR: VER Position              */
#define CAU_STR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_STR_CASR_VER_SHIFT))&CAU_STR_CASR_VER_MASK) /*!< CAU_STR_CASR                            */
/* ------- STR_CAA Bit Fields                       ------ */
/* ------- STR_CA Bit Fields                        ------ */
/* ------- ADR_CASR Bit Fields                      ------ */
#define CAU_ADR_CASR_IC_MASK                     (0x01UL << CAU_ADR_CASR_IC_SHIFT)                   /*!< CAU_ADR_CASR: IC Mask                   */
#define CAU_ADR_CASR_IC_SHIFT                    0                                                   /*!< CAU_ADR_CASR: IC Position               */
#define CAU_ADR_CASR_DPE_MASK                    (0x01UL << CAU_ADR_CASR_DPE_SHIFT)                  /*!< CAU_ADR_CASR: DPE Mask                  */
#define CAU_ADR_CASR_DPE_SHIFT                   1                                                   /*!< CAU_ADR_CASR: DPE Position              */
#define CAU_ADR_CASR_VER_MASK                    (0x0FUL << CAU_ADR_CASR_VER_SHIFT)                  /*!< CAU_ADR_CASR: VER Mask                  */
#define CAU_ADR_CASR_VER_SHIFT                   28                                                  /*!< CAU_ADR_CASR: VER Position              */
#define CAU_ADR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_ADR_CASR_VER_SHIFT))&CAU_ADR_CASR_VER_MASK) /*!< CAU_ADR_CASR                            */
/* ------- ADR_CAA Bit Fields                       ------ */
/* ------- ADR_CA Bit Fields                        ------ */
/* ------- RADR_CASR Bit Fields                     ------ */
#define CAU_RADR_CASR_IC_MASK                    (0x01UL << CAU_RADR_CASR_IC_SHIFT)                  /*!< CAU_RADR_CASR: IC Mask                  */
#define CAU_RADR_CASR_IC_SHIFT                   0                                                   /*!< CAU_RADR_CASR: IC Position              */
#define CAU_RADR_CASR_DPE_MASK                   (0x01UL << CAU_RADR_CASR_DPE_SHIFT)                 /*!< CAU_RADR_CASR: DPE Mask                 */
#define CAU_RADR_CASR_DPE_SHIFT                  1                                                   /*!< CAU_RADR_CASR: DPE Position             */
#define CAU_RADR_CASR_VER_MASK                   (0x0FUL << CAU_RADR_CASR_VER_SHIFT)                 /*!< CAU_RADR_CASR: VER Mask                 */
#define CAU_RADR_CASR_VER_SHIFT                  28                                                  /*!< CAU_RADR_CASR: VER Position             */
#define CAU_RADR_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_RADR_CASR_VER_SHIFT))&CAU_RADR_CASR_VER_MASK) /*!< CAU_RADR_CASR                           */
/* ------- RADR_CAA Bit Fields                      ------ */
/* ------- RADR_CA Bit Fields                       ------ */
/* ------- XOR_CASR Bit Fields                      ------ */
#define CAU_XOR_CASR_IC_MASK                     (0x01UL << CAU_XOR_CASR_IC_SHIFT)                   /*!< CAU_XOR_CASR: IC Mask                   */
#define CAU_XOR_CASR_IC_SHIFT                    0                                                   /*!< CAU_XOR_CASR: IC Position               */
#define CAU_XOR_CASR_DPE_MASK                    (0x01UL << CAU_XOR_CASR_DPE_SHIFT)                  /*!< CAU_XOR_CASR: DPE Mask                  */
#define CAU_XOR_CASR_DPE_SHIFT                   1                                                   /*!< CAU_XOR_CASR: DPE Position              */
#define CAU_XOR_CASR_VER_MASK                    (0x0FUL << CAU_XOR_CASR_VER_SHIFT)                  /*!< CAU_XOR_CASR: VER Mask                  */
#define CAU_XOR_CASR_VER_SHIFT                   28                                                  /*!< CAU_XOR_CASR: VER Position              */
#define CAU_XOR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_XOR_CASR_VER_SHIFT))&CAU_XOR_CASR_VER_MASK) /*!< CAU_XOR_CASR                            */
/* ------- XOR_CAA Bit Fields                       ------ */
/* ------- XOR_CA Bit Fields                        ------ */
/* ------- ROTL_CASR Bit Fields                     ------ */
#define CAU_ROTL_CASR_IC_MASK                    (0x01UL << CAU_ROTL_CASR_IC_SHIFT)                  /*!< CAU_ROTL_CASR: IC Mask                  */
#define CAU_ROTL_CASR_IC_SHIFT                   0                                                   /*!< CAU_ROTL_CASR: IC Position              */
#define CAU_ROTL_CASR_DPE_MASK                   (0x01UL << CAU_ROTL_CASR_DPE_SHIFT)                 /*!< CAU_ROTL_CASR: DPE Mask                 */
#define CAU_ROTL_CASR_DPE_SHIFT                  1                                                   /*!< CAU_ROTL_CASR: DPE Position             */
#define CAU_ROTL_CASR_VER_MASK                   (0x0FUL << CAU_ROTL_CASR_VER_SHIFT)                 /*!< CAU_ROTL_CASR: VER Mask                 */
#define CAU_ROTL_CASR_VER_SHIFT                  28                                                  /*!< CAU_ROTL_CASR: VER Position             */
#define CAU_ROTL_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_ROTL_CASR_VER_SHIFT))&CAU_ROTL_CASR_VER_MASK) /*!< CAU_ROTL_CASR                           */
/* ------- ROTL_CAA Bit Fields                      ------ */
/* ------- ROTL_CA Bit Fields                       ------ */
/* ------- AESC_CASR Bit Fields                     ------ */
#define CAU_AESC_CASR_IC_MASK                    (0x01UL << CAU_AESC_CASR_IC_SHIFT)                  /*!< CAU_AESC_CASR: IC Mask                  */
#define CAU_AESC_CASR_IC_SHIFT                   0                                                   /*!< CAU_AESC_CASR: IC Position              */
#define CAU_AESC_CASR_DPE_MASK                   (0x01UL << CAU_AESC_CASR_DPE_SHIFT)                 /*!< CAU_AESC_CASR: DPE Mask                 */
#define CAU_AESC_CASR_DPE_SHIFT                  1                                                   /*!< CAU_AESC_CASR: DPE Position             */
#define CAU_AESC_CASR_VER_MASK                   (0x0FUL << CAU_AESC_CASR_VER_SHIFT)                 /*!< CAU_AESC_CASR: VER Mask                 */
#define CAU_AESC_CASR_VER_SHIFT                  28                                                  /*!< CAU_AESC_CASR: VER Position             */
#define CAU_AESC_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_AESC_CASR_VER_SHIFT))&CAU_AESC_CASR_VER_MASK) /*!< CAU_AESC_CASR                           */
/* ------- AESC_CAA Bit Fields                      ------ */
/* ------- AESC_CA Bit Fields                       ------ */
/* ------- AESIC_CASR Bit Fields                    ------ */
#define CAU_AESIC_CASR_IC_MASK                   (0x01UL << CAU_AESIC_CASR_IC_SHIFT)                 /*!< CAU_AESIC_CASR: IC Mask                 */
#define CAU_AESIC_CASR_IC_SHIFT                  0                                                   /*!< CAU_AESIC_CASR: IC Position             */
#define CAU_AESIC_CASR_DPE_MASK                  (0x01UL << CAU_AESIC_CASR_DPE_SHIFT)                /*!< CAU_AESIC_CASR: DPE Mask                */
#define CAU_AESIC_CASR_DPE_SHIFT                 1                                                   /*!< CAU_AESIC_CASR: DPE Position            */
#define CAU_AESIC_CASR_VER_MASK                  (0x0FUL << CAU_AESIC_CASR_VER_SHIFT)                /*!< CAU_AESIC_CASR: VER Mask                */
#define CAU_AESIC_CASR_VER_SHIFT                 28                                                  /*!< CAU_AESIC_CASR: VER Position            */
#define CAU_AESIC_CASR_VER(x)                    (((uint32_t)(((uint32_t)(x))<<CAU_AESIC_CASR_VER_SHIFT))&CAU_AESIC_CASR_VER_MASK) /*!< CAU_AESIC_CASR                          */
/* ------- AESIC_CAA Bit Fields                     ------ */
/* ------- AESIC_CA Bit Fields                      ------ */
/**
 * @} */ /* End group CAU_Register_Masks_GROUP 
 */

