podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/* DAC0 - Peripheral instance base addresses */
#define DAC0_BasePtr                   0x400CC000UL //!< Peripheral base address
#define DAC0                           ((DAC_Type *) DAC0_BasePtr) //!< Freescale base pointer
#define DAC0_BASE_PTR                  (DAC0) //!< Freescale style base pointer
/**
 * @} */ /* End group DAC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup DAC_Peripheral_access_layer_GROUP DAC Peripheral Access Layer
* @brief C Struct for DAC
* @{
*/

/* ================================================================================ */
/* ================           DAC1 (derived from DAC0)             ================ */
/* ================================================================================ */

/**
 * @brief 12-Bit Digital-to-Analog Converter
 */

/* DAC1 - Peripheral instance base addresses */
#define DAC1_BasePtr                   0x400CD000UL //!< Peripheral base address
#define DAC1                           ((DAC_Type *) DAC1_BasePtr) //!< Freescale base pointer
#define DAC1_BASE_PTR                  (DAC1) //!< Freescale style base pointer
/**
 * @} */ /* End group DAC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup DDR_Peripheral_access_layer_GROUP DDR Peripheral Access Layer
* @brief C Struct for DDR
* @{
*/

/* ================================================================================ */
/* ================           DDR (file:DDR_0)                     ================ */
/* ================================================================================ */

/**
 * @brief DRAM Controller
 */
/**
* @addtogroup DDR_structs_GROUP DDR struct
* @brief Struct for DDR
* @{
*/
typedef struct {                                /*       DDR Structure                                                */
   __IO uint32_t  CR00;                         /**< 0000: DDR Control Register 0                                       */
   __I  uint32_t  CR01;                         /**< 0004: DDR Control Register 1                                       */
   __IO uint32_t  CR02;                         /**< 0008: DDR Control Register 2                                       */
   __IO uint32_t  CR03;                         /**< 000C: DDR Control Register 3                                       */
   __IO uint32_t  CR04;                         /**< 0010: DDR Control Register 4                                       */
   __IO uint32_t  CR05;                         /**< 0014: DDR Control Register 5                                       */
   __IO uint32_t  CR06;                         /**< 0018: DDR Control Register 6                                       */
   __IO uint32_t  CR07;                         /**< 001C: DDR Control Register 7                                       */
   __IO uint32_t  CR08;                         /**< 0020: DDR Control Register 8                                       */
   __IO uint32_t  CR09;                         /**< 0024: DDR Control Register 9                                       */
   __IO uint32_t  CR10;                         /**< 0028: DDR Control Register 10                                      */
   __IO uint32_t  CR11;                         /**< 002C: DDR Control Register 11                                      */
   __IO uint32_t  CR12;                         /**< 0030: DDR Control Register 12                                      */
   __IO uint32_t  CR13;                         /**< 0034: DDR Control Register 13                                      */
   __IO uint32_t  CR14;                         /**< 0038: DDR Control Register 14                                      */
   __IO uint32_t  CR15;                         /**< 003C: DDR Control Register 15                                      */
   __IO uint32_t  CR16;                         /**< 0040: DDR Control Register 16                                      */
   __IO uint32_t  CR17;                         /**< 0044: DDR Control Register 17                                      */
   __IO uint32_t  CR18;                         /**< 0048: DDR Control Register 18                                      */
   __IO uint32_t  CR19;                         /**< 004C: DDR Control Register 19                                      */
   __IO uint32_t  CR20;                         /**< 0050: DDR Control Register 20                                      */
   __IO uint32_t  CR21;                         /**< 0054: DDR Control Register 21                                      */
   __IO uint32_t  CR22;                         /**< 0058: DDR Control Register 22                                      */
   __I  uint32_t  CR23;                         /**< 005C: DDR Control Register 23                                      */
   __I  uint32_t  CR24;                         /**< 0060: DDR Control Register 24                                      */
   __IO uint32_t  CR25;                         /**< 0064: DDR Control Register 25                                      */
   __IO uint32_t  CR26;                         /**< 0068: DDR Control Register 26                                      */
   __IO uint32_t  CR27;                         /**< 006C: DDR Control Register 27                                      */
   __IO uint32_t  CR28;                         /**< 0070: DDR Control Register 28                                      */
   __IO uint32_t  CR29;                         /**< 0074: DDR Control Register 29                                      */
   __IO uint32_t  CR30;                         /**< 0078: DDR Control Register 30                                      */
   __IO uint32_t  CR31;                         /**< 007C: DDR Control Register 31                                      */
   __I  uint32_t  CR32;                         /**< 0080: DDR Control Register 32                                      */
   __I  uint32_t  CR33;                         /**< 0084: DDR Control Register 33                                      */
   __IO uint32_t  CR34;                         /**< 0088: DDR Control Register 34                                      */
   __I  uint32_t  CR35;                         /**< 008C: DDR Control Register 35                                      */
   __I  uint32_t  CR36;                         /**< 0090: DDR Control Register 36                                      */
   __IO uint32_t  CR37;                         /**< 0094: DDR Control Register 37                                      */
   __IO uint32_t  CR38;                         /**< 0098: DDR Control Register 38                                      */
   __IO uint32_t  CR39;                         /**< 009C: DDR Control Register 39                                      */
   __IO uint32_t  CR40;                         /**< 00A0: DDR Control Register 40                                      */
   __IO uint32_t  CR41;                         /**< 00A4: DDR Control Register 41                                      */
   __IO uint32_t  CR42;                         /**< 00A8: DDR Control Register 42                                      */
   __IO uint32_t  CR43;                         /**< 00AC: DDR Control Register 43                                      */
   __IO uint32_t  CR44;                         /**< 00B0: DDR Control Register 44                                      */
   __IO uint32_t  CR45;                         /**< 00B4: DDR Control Register 45                                      */
   __IO uint32_t  CR46;                         /**< 00B8: DDR Control Register 46                                      */
   __IO uint32_t  CR47;                         /**< 00BC: DDR Control Register 47                                      */
   __IO uint32_t  CR48;                         /**< 00C0: DDR Control Register 48                                      */
   __IO uint32_t  CR49;                         /**< 00C4: DDR Control Register 49                                      */
   __IO uint32_t  CR50;                         /**< 00C8: DDR Control Register 50                                      */
   __IO uint32_t  CR51;                         /**< 00CC: DDR Control Register 51                                      */
   __IO uint32_t  CR52;                         /**< 00D0: DDR Control Register 52                                      */
   __IO uint32_t  CR53;                         /**< 00D4: DDR Control Register 53                                      */
   __IO uint32_t  CR54;                         /**< 00D8: DDR Control Register 54                                      */
   __IO uint32_t  CR55;                         /**< 00DC: DDR Control Register 55                                      */
   __IO uint32_t  CR56;                         /**< 00E0: DDR Control Register 56                                      */
   __IO uint32_t  CR57;                         /**< 00E4: DDR Control Register 57                                      */
   __I  uint32_t  CR58;                         /**< 00E8: DDR Control Register 58                                      */
   __I  uint32_t  CR59;                         /**< 00EC: DDR Control Register 58                                      */
   __I  uint32_t  CR6[4];                       /**< 00F0: DDR Control Register 60                                      */
   __I  uint32_t  RESERVED0[32];               
   __O  uint32_t  RCR;                          /**< 0180: RCR Control Register                                         */
   __I  uint32_t  RESERVED1[10];               
   __IO uint32_t  PAD_CTRL;                     /**< 01AC: I/O Pad Control Register                                     */
} DDR_Type;

/**
 * @} */ /* End group DDR_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'DDR' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

