podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup DDR_Register_Masks_GROUP DDR Register Masks
* @brief Register Masks for DDR
* @{
*/
/* ------- CR00 Bit Fields                          ------ */
#define DDR_CR00_START_MASK                      (0x01UL << DDR_CR00_START_SHIFT)                    /*!< DDR_CR00: START Mask                    */
#define DDR_CR00_START_SHIFT                     0                                                   /*!< DDR_CR00: START Position                */
#define DDR_CR00_DDRCLS_MASK                     (0x0FUL << DDR_CR00_DDRCLS_SHIFT)                   /*!< DDR_CR00: DDRCLS Mask                   */
#define DDR_CR00_DDRCLS_SHIFT                    8                                                   /*!< DDR_CR00: DDRCLS Position               */
#define DDR_CR00_DDRCLS(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR00_DDRCLS_SHIFT))&DDR_CR00_DDRCLS_MASK) /*!< DDR_CR00                                */
#define DDR_CR00_VERSION_MASK                    (0xFFFFUL << DDR_CR00_VERSION_SHIFT)                /*!< DDR_CR00: VERSION Mask                  */
#define DDR_CR00_VERSION_SHIFT                   16                                                  /*!< DDR_CR00: VERSION Position              */
#define DDR_CR00_VERSION(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR00_VERSION_SHIFT))&DDR_CR00_VERSION_MASK) /*!< DDR_CR00                                */
/* ------- CR01 Bit Fields                          ------ */
#define DDR_CR01_MAXROW_MASK                     (0x1FUL << DDR_CR01_MAXROW_SHIFT)                   /*!< DDR_CR01: MAXROW Mask                   */
#define DDR_CR01_MAXROW_SHIFT                    0                                                   /*!< DDR_CR01: MAXROW Position               */
#define DDR_CR01_MAXROW(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR01_MAXROW_SHIFT))&DDR_CR01_MAXROW_MASK) /*!< DDR_CR01                                */
#define DDR_CR01_MAXCOL_MASK                     (0x0FUL << DDR_CR01_MAXCOL_SHIFT)                   /*!< DDR_CR01: MAXCOL Mask                   */
#define DDR_CR01_MAXCOL_SHIFT                    8                                                   /*!< DDR_CR01: MAXCOL Position               */
#define DDR_CR01_MAXCOL(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR01_MAXCOL_SHIFT))&DDR_CR01_MAXCOL_MASK) /*!< DDR_CR01                                */
#define DDR_CR01_CSMAX_MASK                      (0x03UL << DDR_CR01_CSMAX_SHIFT)                    /*!< DDR_CR01: CSMAX Mask                    */
#define DDR_CR01_CSMAX_SHIFT                     16                                                  /*!< DDR_CR01: CSMAX Position                */
#define DDR_CR01_CSMAX(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR01_CSMAX_SHIFT))&DDR_CR01_CSMAX_MASK) /*!< DDR_CR01                                */
/* ------- CR02 Bit Fields                          ------ */
#define DDR_CR02_TINIT_MASK                      (0xFFFFFFUL << DDR_CR02_TINIT_SHIFT)                /*!< DDR_CR02: TINIT Mask                    */
#define DDR_CR02_TINIT_SHIFT                     0                                                   /*!< DDR_CR02: TINIT Position                */
#define DDR_CR02_TINIT(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR02_TINIT_SHIFT))&DDR_CR02_TINIT_MASK) /*!< DDR_CR02                                */
#define DDR_CR02_INITAREF_MASK                   (0x0FUL << DDR_CR02_INITAREF_SHIFT)                 /*!< DDR_CR02: INITAREF Mask                 */
#define DDR_CR02_INITAREF_SHIFT                  24                                                  /*!< DDR_CR02: INITAREF Position             */
#define DDR_CR02_INITAREF(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR02_INITAREF_SHIFT))&DDR_CR02_INITAREF_MASK) /*!< DDR_CR02                                */
/* ------- CR03 Bit Fields                          ------ */
#define DDR_CR03_LATLIN_MASK                     (0x0FUL << DDR_CR03_LATLIN_SHIFT)                   /*!< DDR_CR03: LATLIN Mask                   */
#define DDR_CR03_LATLIN_SHIFT                    0                                                   /*!< DDR_CR03: LATLIN Position               */
#define DDR_CR03_LATLIN(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR03_LATLIN_SHIFT))&DDR_CR03_LATLIN_MASK) /*!< DDR_CR03                                */
#define DDR_CR03_LATGATE_MASK                    (0x0FUL << DDR_CR03_LATGATE_SHIFT)                  /*!< DDR_CR03: LATGATE Mask                  */
#define DDR_CR03_LATGATE_SHIFT                   8                                                   /*!< DDR_CR03: LATGATE Position              */
#define DDR_CR03_LATGATE(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR03_LATGATE_SHIFT))&DDR_CR03_LATGATE_MASK) /*!< DDR_CR03                                */
#define DDR_CR03_WRLAT_MASK                      (0x0FUL << DDR_CR03_WRLAT_SHIFT)                    /*!< DDR_CR03: WRLAT Mask                    */
#define DDR_CR03_WRLAT_SHIFT                     16                                                  /*!< DDR_CR03: WRLAT Position                */
#define DDR_CR03_WRLAT(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR03_WRLAT_SHIFT))&DDR_CR03_WRLAT_MASK) /*!< DDR_CR03                                */
#define DDR_CR03_TCCD_MASK                       (0x1FUL << DDR_CR03_TCCD_SHIFT)                     /*!< DDR_CR03: TCCD Mask                     */
#define DDR_CR03_TCCD_SHIFT                      24                                                  /*!< DDR_CR03: TCCD Position                 */
#define DDR_CR03_TCCD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR03_TCCD_SHIFT))&DDR_CR03_TCCD_MASK) /*!< DDR_CR03                                */
/* ------- CR04 Bit Fields                          ------ */
#define DDR_CR04_TBINT_MASK                      (0x07UL << DDR_CR04_TBINT_SHIFT)                    /*!< DDR_CR04: TBINT Mask                    */
#define DDR_CR04_TBINT_SHIFT                     0                                                   /*!< DDR_CR04: TBINT Position                */
#define DDR_CR04_TBINT(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR04_TBINT_SHIFT))&DDR_CR04_TBINT_MASK) /*!< DDR_CR04                                */
#define DDR_CR04_TRRD_MASK                       (0x07UL << DDR_CR04_TRRD_SHIFT)                     /*!< DDR_CR04: TRRD Mask                     */
#define DDR_CR04_TRRD_SHIFT                      8                                                   /*!< DDR_CR04: TRRD Position                 */
#define DDR_CR04_TRRD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR04_TRRD_SHIFT))&DDR_CR04_TRRD_MASK) /*!< DDR_CR04                                */
#define DDR_CR04_TRC_MASK                        (0x3FUL << DDR_CR04_TRC_SHIFT)                      /*!< DDR_CR04: TRC Mask                      */
#define DDR_CR04_TRC_SHIFT                       16                                                  /*!< DDR_CR04: TRC Position                  */
#define DDR_CR04_TRC(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR04_TRC_SHIFT))&DDR_CR04_TRC_MASK) /*!< DDR_CR04                                */
#define DDR_CR04_TRASMIN_MASK                    (0xFFUL << DDR_CR04_TRASMIN_SHIFT)                  /*!< DDR_CR04: TRASMIN Mask                  */
#define DDR_CR04_TRASMIN_SHIFT                   24                                                  /*!< DDR_CR04: TRASMIN Position              */
#define DDR_CR04_TRASMIN(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR04_TRASMIN_SHIFT))&DDR_CR04_TRASMIN_MASK) /*!< DDR_CR04                                */
/* ------- CR05 Bit Fields                          ------ */
#define DDR_CR05_TWTR_MASK                       (0x0FUL << DDR_CR05_TWTR_SHIFT)                     /*!< DDR_CR05: TWTR Mask                     */
#define DDR_CR05_TWTR_SHIFT                      0                                                   /*!< DDR_CR05: TWTR Position                 */
#define DDR_CR05_TWTR(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR05_TWTR_SHIFT))&DDR_CR05_TWTR_MASK) /*!< DDR_CR05                                */
#define DDR_CR05_TRP_MASK                        (0x0FUL << DDR_CR05_TRP_SHIFT)                      /*!< DDR_CR05: TRP Mask                      */
#define DDR_CR05_TRP_SHIFT                       8                                                   /*!< DDR_CR05: TRP Position                  */
#define DDR_CR05_TRP(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR05_TRP_SHIFT))&DDR_CR05_TRP_MASK) /*!< DDR_CR05                                */
#define DDR_CR05_TRTP_MASK                       (0x07UL << DDR_CR05_TRTP_SHIFT)                     /*!< DDR_CR05: TRTP Mask                     */
#define DDR_CR05_TRTP_SHIFT                      16                                                  /*!< DDR_CR05: TRTP Position                 */
#define DDR_CR05_TRTP(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR05_TRTP_SHIFT))&DDR_CR05_TRTP_MASK) /*!< DDR_CR05                                */
#define DDR_CR05_TMRD_MASK                       (0x1FUL << DDR_CR05_TMRD_SHIFT)                     /*!< DDR_CR05: TMRD Mask                     */
#define DDR_CR05_TMRD_SHIFT                      24                                                  /*!< DDR_CR05: TMRD Position                 */
#define DDR_CR05_TMRD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR05_TMRD_SHIFT))&DDR_CR05_TMRD_MASK) /*!< DDR_CR05                                */
/* ------- CR06 Bit Fields                          ------ */
#define DDR_CR06_TMOD_MASK                       (0xFFUL << DDR_CR06_TMOD_SHIFT)                     /*!< DDR_CR06: TMOD Mask                     */
#define DDR_CR06_TMOD_SHIFT                      0                                                   /*!< DDR_CR06: TMOD Position                 */
#define DDR_CR06_TMOD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR06_TMOD_SHIFT))&DDR_CR06_TMOD_MASK) /*!< DDR_CR06                                */
#define DDR_CR06_TRASMAX_MASK                    (0xFFFFUL << DDR_CR06_TRASMAX_SHIFT)                /*!< DDR_CR06: TRASMAX Mask                  */
#define DDR_CR06_TRASMAX_SHIFT                   8                                                   /*!< DDR_CR06: TRASMAX Position              */
#define DDR_CR06_TRASMAX(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR06_TRASMAX_SHIFT))&DDR_CR06_TRASMAX_MASK) /*!< DDR_CR06                                */
#define DDR_CR06_INTWBR_MASK                     (0x01UL << DDR_CR06_INTWBR_SHIFT)                   /*!< DDR_CR06: INTWBR Mask                   */
#define DDR_CR06_INTWBR_SHIFT                    24                                                  /*!< DDR_CR06: INTWBR Position               */
/* ------- CR07 Bit Fields                          ------ */
#define DDR_CR07_CLKPW_MASK                      (0x07UL << DDR_CR07_CLKPW_SHIFT)                    /*!< DDR_CR07: CLKPW Mask                    */
#define DDR_CR07_CLKPW_SHIFT                     0                                                   /*!< DDR_CR07: CLKPW Position                */
#define DDR_CR07_CLKPW(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR07_CLKPW_SHIFT))&DDR_CR07_CLKPW_MASK) /*!< DDR_CR07                                */
#define DDR_CR07_TCKESR_MASK                     (0x1FUL << DDR_CR07_TCKESR_SHIFT)                   /*!< DDR_CR07: TCKESR Mask                   */
#define DDR_CR07_TCKESR_SHIFT                    8                                                   /*!< DDR_CR07: TCKESR Position               */
#define DDR_CR07_TCKESR(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR07_TCKESR_SHIFT))&DDR_CR07_TCKESR_MASK) /*!< DDR_CR07                                */
#define DDR_CR07_AP_MASK                         (0x01UL << DDR_CR07_AP_SHIFT)                       /*!< DDR_CR07: AP Mask                       */
#define DDR_CR07_AP_SHIFT                        16                                                  /*!< DDR_CR07: AP Position                   */
#define DDR_CR07_CCAPEN_MASK                     (0x01UL << DDR_CR07_CCAPEN_SHIFT)                   /*!< DDR_CR07: CCAPEN Mask                   */
#define DDR_CR07_CCAPEN_SHIFT                    24                                                  /*!< DDR_CR07: CCAPEN Position               */
/* ------- CR08 Bit Fields                          ------ */
#define DDR_CR08_TRAS_MASK                       (0x01UL << DDR_CR08_TRAS_SHIFT)                     /*!< DDR_CR08: TRAS Mask                     */
#define DDR_CR08_TRAS_SHIFT                      0                                                   /*!< DDR_CR08: TRAS Position                 */
#define DDR_CR08_TRASDI_MASK                     (0xFFUL << DDR_CR08_TRASDI_SHIFT)                   /*!< DDR_CR08: TRASDI Mask                   */
#define DDR_CR08_TRASDI_SHIFT                    8                                                   /*!< DDR_CR08: TRASDI Position               */
#define DDR_CR08_TRASDI(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR08_TRASDI_SHIFT))&DDR_CR08_TRASDI_MASK) /*!< DDR_CR08                                */
#define DDR_CR08_TWR_MASK                        (0x1FUL << DDR_CR08_TWR_SHIFT)                      /*!< DDR_CR08: TWR Mask                      */
#define DDR_CR08_TWR_SHIFT                       16                                                  /*!< DDR_CR08: TWR Position                  */
#define DDR_CR08_TWR(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR08_TWR_SHIFT))&DDR_CR08_TWR_MASK) /*!< DDR_CR08                                */
#define DDR_CR08_TDAL_MASK                       (0x1FUL << DDR_CR08_TDAL_SHIFT)                     /*!< DDR_CR08: TDAL Mask                     */
#define DDR_CR08_TDAL_SHIFT                      24                                                  /*!< DDR_CR08: TDAL Position                 */
#define DDR_CR08_TDAL(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR08_TDAL_SHIFT))&DDR_CR08_TDAL_MASK) /*!< DDR_CR08                                */
/* ------- CR09 Bit Fields                          ------ */
#define DDR_CR09_TDLL_MASK                       (0xFFFFUL << DDR_CR09_TDLL_SHIFT)                   /*!< DDR_CR09: TDLL Mask                     */
#define DDR_CR09_TDLL_SHIFT                      0                                                   /*!< DDR_CR09: TDLL Position                 */
#define DDR_CR09_TDLL(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR09_TDLL_SHIFT))&DDR_CR09_TDLL_MASK) /*!< DDR_CR09                                */
#define DDR_CR09_NOCMD_MASK                      (0x01UL << DDR_CR09_NOCMD_SHIFT)                    /*!< DDR_CR09: NOCMD Mask                    */
#define DDR_CR09_NOCMD_SHIFT                     16                                                  /*!< DDR_CR09: NOCMD Position                */
#define DDR_CR09_BSTLEN_MASK                     (0x07UL << DDR_CR09_BSTLEN_SHIFT)                   /*!< DDR_CR09: BSTLEN Mask                   */
#define DDR_CR09_BSTLEN_SHIFT                    24                                                  /*!< DDR_CR09: BSTLEN Position               */
#define DDR_CR09_BSTLEN(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR09_BSTLEN_SHIFT))&DDR_CR09_BSTLEN_MASK) /*!< DDR_CR09                                */
/* ------- CR10 Bit Fields                          ------ */
#define DDR_CR10_TFAW_MASK                       (0x3FUL << DDR_CR10_TFAW_SHIFT)                     /*!< DDR_CR10: TFAW Mask                     */
#define DDR_CR10_TFAW_SHIFT                      0                                                   /*!< DDR_CR10: TFAW Position                 */
#define DDR_CR10_TFAW(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR10_TFAW_SHIFT))&DDR_CR10_TFAW_MASK) /*!< DDR_CR10                                */
#define DDR_CR10_TCPD_MASK                       (0xFFFFUL << DDR_CR10_TCPD_SHIFT)                   /*!< DDR_CR10: TCPD Mask                     */
#define DDR_CR10_TCPD_SHIFT                      8                                                   /*!< DDR_CR10: TCPD Position                 */
#define DDR_CR10_TCPD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR10_TCPD_SHIFT))&DDR_CR10_TCPD_MASK) /*!< DDR_CR10                                */
#define DDR_CR10_TRPAB_MASK                      (0x0FUL << DDR_CR10_TRPAB_SHIFT)                    /*!< DDR_CR10: TRPAB Mask                    */
#define DDR_CR10_TRPAB_SHIFT                     24                                                  /*!< DDR_CR10: TRPAB Position                */
#define DDR_CR10_TRPAB(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR10_TRPAB_SHIFT))&DDR_CR10_TRPAB_MASK) /*!< DDR_CR10                                */
/* ------- CR11 Bit Fields                          ------ */
#define DDR_CR11_REGDIMM_MASK                    (0x01UL << DDR_CR11_REGDIMM_SHIFT)                  /*!< DDR_CR11: REGDIMM Mask                  */
#define DDR_CR11_REGDIMM_SHIFT                   0                                                   /*!< DDR_CR11: REGDIMM Position              */
#define DDR_CR11_AREF_MASK                       (0x01UL << DDR_CR11_AREF_SHIFT)                     /*!< DDR_CR11: AREF Mask                     */
#define DDR_CR11_AREF_SHIFT                      8                                                   /*!< DDR_CR11: AREF Position                 */
#define DDR_CR11_AREFMODE_MASK                   (0x01UL << DDR_CR11_AREFMODE_SHIFT)                 /*!< DDR_CR11: AREFMODE Mask                 */
#define DDR_CR11_AREFMODE_SHIFT                  16                                                  /*!< DDR_CR11: AREFMODE Position             */
#define DDR_CR11_TREFEN_MASK                     (0x01UL << DDR_CR11_TREFEN_SHIFT)                   /*!< DDR_CR11: TREFEN Mask                   */
#define DDR_CR11_TREFEN_SHIFT                    24                                                  /*!< DDR_CR11: TREFEN Position               */
/* ------- CR12 Bit Fields                          ------ */
#define DDR_CR12_TRFC_MASK                       (0x3FFUL << DDR_CR12_TRFC_SHIFT)                    /*!< DDR_CR12: TRFC Mask                     */
#define DDR_CR12_TRFC_SHIFT                      0                                                   /*!< DDR_CR12: TRFC Position                 */
#define DDR_CR12_TRFC(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR12_TRFC_SHIFT))&DDR_CR12_TRFC_MASK) /*!< DDR_CR12                                */
#define DDR_CR12_TREF_MASK                       (0x3FFFUL << DDR_CR12_TREF_SHIFT)                   /*!< DDR_CR12: TREF Mask                     */
#define DDR_CR12_TREF_SHIFT                      16                                                  /*!< DDR_CR12: TREF Position                 */
#define DDR_CR12_TREF(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR12_TREF_SHIFT))&DDR_CR12_TREF_MASK) /*!< DDR_CR12                                */
/* ------- CR13 Bit Fields                          ------ */
#define DDR_CR13_TREFINT_MASK                    (0x3FFFUL << DDR_CR13_TREFINT_SHIFT)                /*!< DDR_CR13: TREFINT Mask                  */
#define DDR_CR13_TREFINT_SHIFT                   0                                                   /*!< DDR_CR13: TREFINT Position              */
#define DDR_CR13_TREFINT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR13_TREFINT_SHIFT))&DDR_CR13_TREFINT_MASK) /*!< DDR_CR13                                */
#define DDR_CR13_PD_MASK                         (0x01UL << DDR_CR13_PD_SHIFT)                       /*!< DDR_CR13: PD Mask                       */
#define DDR_CR13_PD_SHIFT                        16                                                  /*!< DDR_CR13: PD Position                   */
/* ------- CR14 Bit Fields                          ------ */
#define DDR_CR14_TPDEX_MASK                      (0xFFFFUL << DDR_CR14_TPDEX_SHIFT)                  /*!< DDR_CR14: TPDEX Mask                    */
#define DDR_CR14_TPDEX_SHIFT                     0                                                   /*!< DDR_CR14: TPDEX Position                */
#define DDR_CR14_TPDEX(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR14_TPDEX_SHIFT))&DDR_CR14_TPDEX_MASK) /*!< DDR_CR14                                */
#define DDR_CR14_TXSR_MASK                       (0xFFFFUL << DDR_CR14_TXSR_SHIFT)                   /*!< DDR_CR14: TXSR Mask                     */
#define DDR_CR14_TXSR_SHIFT                      16                                                  /*!< DDR_CR14: TXSR Position                 */
#define DDR_CR14_TXSR(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR14_TXSR_SHIFT))&DDR_CR14_TXSR_MASK) /*!< DDR_CR14                                */
/* ------- CR15 Bit Fields                          ------ */
#define DDR_CR15_TXSNR_MASK                      (0xFFFFUL << DDR_CR15_TXSNR_SHIFT)                  /*!< DDR_CR15: TXSNR Mask                    */
#define DDR_CR15_TXSNR_SHIFT                     0                                                   /*!< DDR_CR15: TXSNR Position                */
#define DDR_CR15_TXSNR(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR15_TXSNR_SHIFT))&DDR_CR15_TXSNR_MASK) /*!< DDR_CR15                                */
#define DDR_CR15_SREF_MASK                       (0x01UL << DDR_CR15_SREF_SHIFT)                     /*!< DDR_CR15: SREF Mask                     */
#define DDR_CR15_SREF_SHIFT                      16                                                  /*!< DDR_CR15: SREF Position                 */
#define DDR_CR15_PUREF_MASK                      (0x01UL << DDR_CR15_PUREF_SHIFT)                    /*!< DDR_CR15: PUREF Mask                    */
#define DDR_CR15_PUREF_SHIFT                     24                                                  /*!< DDR_CR15: PUREF Position                */
/* ------- CR16 Bit Fields                          ------ */
#define DDR_CR16_QKREF_MASK                      (0x01UL << DDR_CR16_QKREF_SHIFT)                    /*!< DDR_CR16: QKREF Mask                    */
#define DDR_CR16_QKREF_SHIFT                     0                                                   /*!< DDR_CR16: QKREF Position                */
#define DDR_CR16_CLKDLY_MASK                     (0x07UL << DDR_CR16_CLKDLY_SHIFT)                   /*!< DDR_CR16: CLKDLY Mask                   */
#define DDR_CR16_CLKDLY_SHIFT                    8                                                   /*!< DDR_CR16: CLKDLY Position               */
#define DDR_CR16_CLKDLY(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR16_CLKDLY_SHIFT))&DDR_CR16_CLKDLY_MASK) /*!< DDR_CR16                                */
#define DDR_CR16_LPCTRL_MASK                     (0x1FUL << DDR_CR16_LPCTRL_SHIFT)                   /*!< DDR_CR16: LPCTRL Mask                   */
#define DDR_CR16_LPCTRL_SHIFT                    16                                                  /*!< DDR_CR16: LPCTRL Position               */
#define DDR_CR16_LPCTRL(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR16_LPCTRL_SHIFT))&DDR_CR16_LPCTRL_MASK) /*!< DDR_CR16                                */
/* ------- CR17 Bit Fields                          ------ */
#define DDR_CR17_LPPDCNT_MASK                    (0xFFFFUL << DDR_CR17_LPPDCNT_SHIFT)                /*!< DDR_CR17: LPPDCNT Mask                  */
#define DDR_CR17_LPPDCNT_SHIFT                   0                                                   /*!< DDR_CR17: LPPDCNT Position              */
