podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define DDR_CR17_LPPDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR17_LPPDCNT_SHIFT))&DDR_CR17_LPPDCNT_MASK) /*!< DDR_CR17                                */
#define DDR_CR17_LPRFCNT_MASK                    (0xFFFFUL << DDR_CR17_LPRFCNT_SHIFT)                /*!< DDR_CR17: LPRFCNT Mask                  */
#define DDR_CR17_LPRFCNT_SHIFT                   16                                                  /*!< DDR_CR17: LPRFCNT Position              */
#define DDR_CR17_LPRFCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR17_LPRFCNT_SHIFT))&DDR_CR17_LPRFCNT_MASK) /*!< DDR_CR17                                */
/* ------- CR18 Bit Fields                          ------ */
#define DDR_CR18_LPEXTCNT_MASK                   (0xFFFFUL << DDR_CR18_LPEXTCNT_SHIFT)               /*!< DDR_CR18: LPEXTCNT Mask                 */
#define DDR_CR18_LPEXTCNT_SHIFT                  0                                                   /*!< DDR_CR18: LPEXTCNT Position             */
#define DDR_CR18_LPEXTCNT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR18_LPEXTCNT_SHIFT))&DDR_CR18_LPEXTCNT_MASK) /*!< DDR_CR18                                */
#define DDR_CR18_LPAUTO_MASK                     (0x1FUL << DDR_CR18_LPAUTO_SHIFT)                   /*!< DDR_CR18: LPAUTO Mask                   */
#define DDR_CR18_LPAUTO_SHIFT                    16                                                  /*!< DDR_CR18: LPAUTO Position               */
#define DDR_CR18_LPAUTO(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR18_LPAUTO_SHIFT))&DDR_CR18_LPAUTO_MASK) /*!< DDR_CR18                                */
/* ------- CR19 Bit Fields                          ------ */
#define DDR_CR19_LPINTCNT_MASK                   (0xFFFFUL << DDR_CR19_LPINTCNT_SHIFT)               /*!< DDR_CR19: LPINTCNT Mask                 */
#define DDR_CR19_LPINTCNT_SHIFT                  0                                                   /*!< DDR_CR19: LPINTCNT Position             */
#define DDR_CR19_LPINTCNT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR19_LPINTCNT_SHIFT))&DDR_CR19_LPINTCNT_MASK) /*!< DDR_CR19                                */
#define DDR_CR19_LPRFHOLD_MASK                   (0xFFFFUL << DDR_CR19_LPRFHOLD_SHIFT)               /*!< DDR_CR19: LPRFHOLD Mask                 */
#define DDR_CR19_LPRFHOLD_SHIFT                  16                                                  /*!< DDR_CR19: LPRFHOLD Position             */
#define DDR_CR19_LPRFHOLD(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR19_LPRFHOLD_SHIFT))&DDR_CR19_LPRFHOLD_MASK) /*!< DDR_CR19                                */
/* ------- CR20 Bit Fields                          ------ */
#define DDR_CR20_LPRE_MASK                       (0x03UL << DDR_CR20_LPRE_SHIFT)                     /*!< DDR_CR20: LPRE Mask                     */
#define DDR_CR20_LPRE_SHIFT                      0                                                   /*!< DDR_CR20: LPRE Position                 */
#define DDR_CR20_LPRE(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR20_LPRE_SHIFT))&DDR_CR20_LPRE_MASK) /*!< DDR_CR20                                */
#define DDR_CR20_CKSRE_MASK                      (0x0FUL << DDR_CR20_CKSRE_SHIFT)                    /*!< DDR_CR20: CKSRE Mask                    */
#define DDR_CR20_CKSRE_SHIFT                     8                                                   /*!< DDR_CR20: CKSRE Position                */
#define DDR_CR20_CKSRE(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR20_CKSRE_SHIFT))&DDR_CR20_CKSRE_MASK) /*!< DDR_CR20                                */
#define DDR_CR20_CKSRX_MASK                      (0x0FUL << DDR_CR20_CKSRX_SHIFT)                    /*!< DDR_CR20: CKSRX Mask                    */
#define DDR_CR20_CKSRX_SHIFT                     16                                                  /*!< DDR_CR20: CKSRX Position                */
#define DDR_CR20_CKSRX(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR20_CKSRX_SHIFT))&DDR_CR20_CKSRX_MASK) /*!< DDR_CR20                                */
#define DDR_CR20_WRMD_MASK                       (0x01UL << DDR_CR20_WRMD_SHIFT)                     /*!< DDR_CR20: WRMD Mask                     */
#define DDR_CR20_WRMD_SHIFT                      24                                                  /*!< DDR_CR20: WRMD Position                 */
/* ------- CR21 Bit Fields                          ------ */
#define DDR_CR21_MR0DAT0_MASK                    (0xFFFFUL << DDR_CR21_MR0DAT0_SHIFT)                /*!< DDR_CR21: MR0DAT0 Mask                  */
#define DDR_CR21_MR0DAT0_SHIFT                   0                                                   /*!< DDR_CR21: MR0DAT0 Position              */
#define DDR_CR21_MR0DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR21_MR0DAT0_SHIFT))&DDR_CR21_MR0DAT0_MASK) /*!< DDR_CR21                                */
#define DDR_CR21_MR1DAT0_MASK                    (0xFFFFUL << DDR_CR21_MR1DAT0_SHIFT)                /*!< DDR_CR21: MR1DAT0 Mask                  */
#define DDR_CR21_MR1DAT0_SHIFT                   16                                                  /*!< DDR_CR21: MR1DAT0 Position              */
#define DDR_CR21_MR1DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR21_MR1DAT0_SHIFT))&DDR_CR21_MR1DAT0_MASK) /*!< DDR_CR21                                */
/* ------- CR22 Bit Fields                          ------ */
#define DDR_CR22_MR2DATA0_MASK                   (0xFFFFUL << DDR_CR22_MR2DATA0_SHIFT)               /*!< DDR_CR22: MR2DATA0 Mask                 */
#define DDR_CR22_MR2DATA0_SHIFT                  0                                                   /*!< DDR_CR22: MR2DATA0 Position             */
#define DDR_CR22_MR2DATA0(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR22_MR2DATA0_SHIFT))&DDR_CR22_MR2DATA0_MASK) /*!< DDR_CR22                                */
#define DDR_CR22_MR3DAT0_MASK                    (0xFFFFUL << DDR_CR22_MR3DAT0_SHIFT)                /*!< DDR_CR22: MR3DAT0 Mask                  */
#define DDR_CR22_MR3DAT0_SHIFT                   16                                                  /*!< DDR_CR22: MR3DAT0 Position              */
#define DDR_CR22_MR3DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR22_MR3DAT0_SHIFT))&DDR_CR22_MR3DAT0_MASK) /*!< DDR_CR22                                */
/* ------- CR23 Bit Fields                          ------ */
#define DDR_CR23_Not_Used_MASK                   (0xFFFFUL << DDR_CR23_Not_Used_SHIFT)               /*!< DDR_CR23: Not_Used Mask                 */
#define DDR_CR23_Not_Used_SHIFT                  0                                                   /*!< DDR_CR23: Not_Used Position             */
#define DDR_CR23_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR23_Not_Used_SHIFT))&DDR_CR23_Not_Used_MASK) /*!< DDR_CR23                                */
#define DDR_CR23_NOT_USED_MASK                   (0xFFFFUL << DDR_CR23_NOT_USED_SHIFT)               /*!< DDR_CR23: NOT_USED Mask                 */
#define DDR_CR23_NOT_USED_SHIFT                  16                                                  /*!< DDR_CR23: NOT_USED Position             */
#define DDR_CR23_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR23_NOT_USED_SHIFT))&DDR_CR23_NOT_USED_MASK) /*!< DDR_CR23                                */
/* ------- CR24 Bit Fields                          ------ */
/* ------- CR25 Bit Fields                          ------ */
#define DDR_CR25_BNK8_MASK                       (0x01UL << DDR_CR25_BNK8_SHIFT)                     /*!< DDR_CR25: BNK8 Mask                     */
#define DDR_CR25_BNK8_SHIFT                      0                                                   /*!< DDR_CR25: BNK8 Position                 */
#define DDR_CR25_ADDPINS_MASK                    (0x07UL << DDR_CR25_ADDPINS_SHIFT)                  /*!< DDR_CR25: ADDPINS Mask                  */
#define DDR_CR25_ADDPINS_SHIFT                   8                                                   /*!< DDR_CR25: ADDPINS Position              */
#define DDR_CR25_ADDPINS(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR25_ADDPINS_SHIFT))&DDR_CR25_ADDPINS_MASK) /*!< DDR_CR25                                */
#define DDR_CR25_COLSIZ_MASK                     (0x07UL << DDR_CR25_COLSIZ_SHIFT)                   /*!< DDR_CR25: COLSIZ Mask                   */
#define DDR_CR25_COLSIZ_SHIFT                    16                                                  /*!< DDR_CR25: COLSIZ Position               */
#define DDR_CR25_COLSIZ(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR25_COLSIZ_SHIFT))&DDR_CR25_COLSIZ_MASK) /*!< DDR_CR25                                */
#define DDR_CR25_APREBIT_MASK                    (0x0FUL << DDR_CR25_APREBIT_SHIFT)                  /*!< DDR_CR25: APREBIT Mask                  */
#define DDR_CR25_APREBIT_SHIFT                   24                                                  /*!< DDR_CR25: APREBIT Position              */
#define DDR_CR25_APREBIT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR25_APREBIT_SHIFT))&DDR_CR25_APREBIT_MASK) /*!< DDR_CR25                                */
/* ------- CR26 Bit Fields                          ------ */
#define DDR_CR26_AGECNT_MASK                     (0xFFUL << DDR_CR26_AGECNT_SHIFT)                   /*!< DDR_CR26: AGECNT Mask                   */
#define DDR_CR26_AGECNT_SHIFT                    0                                                   /*!< DDR_CR26: AGECNT Position               */
#define DDR_CR26_AGECNT(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR26_AGECNT_SHIFT))&DDR_CR26_AGECNT_MASK) /*!< DDR_CR26                                */
#define DDR_CR26_CMDAGE_MASK                     (0xFFUL << DDR_CR26_CMDAGE_SHIFT)                   /*!< DDR_CR26: CMDAGE Mask                   */
#define DDR_CR26_CMDAGE_SHIFT                    8                                                   /*!< DDR_CR26: CMDAGE Position               */
#define DDR_CR26_CMDAGE(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR26_CMDAGE_SHIFT))&DDR_CR26_CMDAGE_MASK) /*!< DDR_CR26                                */
#define DDR_CR26_ADDCOL_MASK                     (0x01UL << DDR_CR26_ADDCOL_SHIFT)                   /*!< DDR_CR26: ADDCOL Mask                   */
#define DDR_CR26_ADDCOL_SHIFT                    16                                                  /*!< DDR_CR26: ADDCOL Position               */
#define DDR_CR26_BNKSPT_MASK                     (0x01UL << DDR_CR26_BNKSPT_SHIFT)                   /*!< DDR_CR26: BNKSPT Mask                   */
#define DDR_CR26_BNKSPT_SHIFT                    24                                                  /*!< DDR_CR26: BNKSPT Position               */
/* ------- CR27 Bit Fields                          ------ */
#define DDR_CR27_PLEN_MASK                       (0x01UL << DDR_CR27_PLEN_SHIFT)                     /*!< DDR_CR27: PLEN Mask                     */
#define DDR_CR27_PLEN_SHIFT                      0                                                   /*!< DDR_CR27: PLEN Position                 */
#define DDR_CR27_PRIEN_MASK                      (0x01UL << DDR_CR27_PRIEN_SHIFT)                    /*!< DDR_CR27: PRIEN Mask                    */
#define DDR_CR27_PRIEN_SHIFT                     8                                                   /*!< DDR_CR27: PRIEN Position                */
#define DDR_CR27_RWEN_MASK                       (0x01UL << DDR_CR27_RWEN_SHIFT)                     /*!< DDR_CR27: RWEN Mask                     */
#define DDR_CR27_RWEN_SHIFT                      16                                                  /*!< DDR_CR27: RWEN Position                 */
#define DDR_CR27_SWPEN_MASK                      (0x01UL << DDR_CR27_SWPEN_SHIFT)                    /*!< DDR_CR27: SWPEN Mask                    */
#define DDR_CR27_SWPEN_SHIFT                     24                                                  /*!< DDR_CR27: SWPEN Position                */
/* ------- CR28 Bit Fields                          ------ */
#define DDR_CR28_CSMAP_MASK                      (0x01UL << DDR_CR28_CSMAP_SHIFT)                    /*!< DDR_CR28: CSMAP Mask                    */
#define DDR_CR28_CSMAP_SHIFT                     0                                                   /*!< DDR_CR28: CSMAP Position                */
#define DDR_CR28_REDUC_MASK                      (0x01UL << DDR_CR28_REDUC_SHIFT)                    /*!< DDR_CR28: REDUC Mask                    */
#define DDR_CR28_REDUC_SHIFT                     8                                                   /*!< DDR_CR28: REDUC Position                */
#define DDR_CR28_BIGEND_MASK                     (0x01UL << DDR_CR28_BIGEND_SHIFT)                   /*!< DDR_CR28: BIGEND Mask                   */
#define DDR_CR28_BIGEND_SHIFT                    16                                                  /*!< DDR_CR28: BIGEND Position               */
#define DDR_CR28_CMDLATR_MASK                    (0x01UL << DDR_CR28_CMDLATR_SHIFT)                  /*!< DDR_CR28: CMDLATR Mask                  */
#define DDR_CR28_CMDLATR_SHIFT                   24                                                  /*!< DDR_CR28: CMDLATR Position              */
/* ------- CR29 Bit Fields                          ------ */
#define DDR_CR29_WRLATR_MASK                     (0x01UL << DDR_CR29_WRLATR_SHIFT)                   /*!< DDR_CR29: WRLATR Mask                   */
#define DDR_CR29_WRLATR_SHIFT                    0                                                   /*!< DDR_CR29: WRLATR Position               */
#define DDR_CR29_FSTWR_MASK                      (0x01UL << DDR_CR29_FSTWR_SHIFT)                    /*!< DDR_CR29: FSTWR Mask                    */
#define DDR_CR29_FSTWR_SHIFT                     8                                                   /*!< DDR_CR29: FSTWR Position                */
#define DDR_CR29_QFULL_MASK                      (0x03UL << DDR_CR29_QFULL_SHIFT)                    /*!< DDR_CR29: QFULL Mask                    */
#define DDR_CR29_QFULL_SHIFT                     16                                                  /*!< DDR_CR29: QFULL Position                */
#define DDR_CR29_QFULL(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR29_QFULL_SHIFT))&DDR_CR29_QFULL_MASK) /*!< DDR_CR29                                */
#define DDR_CR29_RESYNC_MASK                     (0x01UL << DDR_CR29_RESYNC_SHIFT)                   /*!< DDR_CR29: RESYNC Mask                   */
#define DDR_CR29_RESYNC_SHIFT                    24                                                  /*!< DDR_CR29: RESYNC Position               */
/* ------- CR30 Bit Fields                          ------ */
#define DDR_CR30_RSYNCRF_MASK                    (0x01UL << DDR_CR30_RSYNCRF_SHIFT)                  /*!< DDR_CR30: RSYNCRF Mask                  */
#define DDR_CR30_RSYNCRF_SHIFT                   0                                                   /*!< DDR_CR30: RSYNCRF Position              */
#define DDR_CR30_INTSTAT_MASK                    (0x1FFUL << DDR_CR30_INTSTAT_SHIFT)                 /*!< DDR_CR30: INTSTAT Mask                  */
#define DDR_CR30_INTSTAT_SHIFT                   8                                                   /*!< DDR_CR30: INTSTAT Position              */
#define DDR_CR30_INTSTAT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR30_INTSTAT_SHIFT))&DDR_CR30_INTSTAT_MASK) /*!< DDR_CR30                                */
#define DDR_CR30_INTACK_MASK                     (0xFFUL << DDR_CR30_INTACK_SHIFT)                   /*!< DDR_CR30: INTACK Mask                   */
#define DDR_CR30_INTACK_SHIFT                    24                                                  /*!< DDR_CR30: INTACK Position               */
#define DDR_CR30_INTACK(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR30_INTACK_SHIFT))&DDR_CR30_INTACK_MASK) /*!< DDR_CR30                                */
/* ------- CR31 Bit Fields                          ------ */
#define DDR_CR31_INTMASK_MASK                    (0x1FFUL << DDR_CR31_INTMASK_SHIFT)                 /*!< DDR_CR31: INTMASK Mask                  */
#define DDR_CR31_INTMASK_SHIFT                   0                                                   /*!< DDR_CR31: INTMASK Position              */
#define DDR_CR31_INTMASK(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR31_INTMASK_SHIFT))&DDR_CR31_INTMASK_MASK) /*!< DDR_CR31                                */
/* ------- CR32 Bit Fields                          ------ */
#define DDR_CR32_OORAD_MASK                      (0xFFFFFFFFUL << DDR_CR32_OORAD_SHIFT)              /*!< DDR_CR32: OORAD Mask                    */
#define DDR_CR32_OORAD_SHIFT                     0                                                   /*!< DDR_CR32: OORAD Position                */
#define DDR_CR32_OORAD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR32_OORAD_SHIFT))&DDR_CR32_OORAD_MASK) /*!< DDR_CR32                                */
/* ------- CR33 Bit Fields                          ------ */
#define DDR_CR33_OORLEN_MASK                     (0x3FFUL << DDR_CR33_OORLEN_SHIFT)                  /*!< DDR_CR33: OORLEN Mask                   */
#define DDR_CR33_OORLEN_SHIFT                    0                                                   /*!< DDR_CR33: OORLEN Position               */
#define DDR_CR33_OORLEN(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR33_OORLEN_SHIFT))&DDR_CR33_OORLEN_MASK) /*!< DDR_CR33                                */
#define DDR_CR33_OORTYP_MASK                     (0x3FUL << DDR_CR33_OORTYP_SHIFT)                   /*!< DDR_CR33: OORTYP Mask                   */
#define DDR_CR33_OORTYP_SHIFT                    16                                                  /*!< DDR_CR33: OORTYP Position               */
#define DDR_CR33_OORTYP(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR33_OORTYP_SHIFT))&DDR_CR33_OORTYP_MASK) /*!< DDR_CR33                                */
#define DDR_CR33_OORID_MASK                      (0x03UL << DDR_CR33_OORID_SHIFT)                    /*!< DDR_CR33: OORID Mask                    */
#define DDR_CR33_OORID_SHIFT                     24                                                  /*!< DDR_CR33: OORID Position                */
#define DDR_CR33_OORID(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR33_OORID_SHIFT))&DDR_CR33_OORID_MASK) /*!< DDR_CR33                                */
/* ------- CR34 Bit Fields                          ------ */
#define DDR_CR34_ODTRDC_MASK                     (0x01UL << DDR_CR34_ODTRDC_SHIFT)                   /*!< DDR_CR34: ODTRDC Mask                   */
#define DDR_CR34_ODTRDC_SHIFT                    0                                                   /*!< DDR_CR34: ODTRDC Position               */
#define DDR_CR34_ODTWRCS_MASK                    (0x01UL << DDR_CR34_ODTWRCS_SHIFT)                  /*!< DDR_CR34: ODTWRCS Mask                  */
#define DDR_CR34_ODTWRCS_SHIFT                   8                                                   /*!< DDR_CR34: ODTWRCS Position              */
/* ------- CR35 Bit Fields                          ------ */
#define DDR_CR35_R2WSMCS_MASK                    (0x0FUL << DDR_CR35_R2WSMCS_SHIFT)                  /*!< DDR_CR35: R2WSMCS Mask                  */
#define DDR_CR35_R2WSMCS_SHIFT                   0                                                   /*!< DDR_CR35: R2WSMCS Position              */
#define DDR_CR35_R2WSMCS(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR35_R2WSMCS_SHIFT))&DDR_CR35_R2WSMCS_MASK) /*!< DDR_CR35                                */
#define DDR_CR35_W2RSMCS_MASK                    (0x0FUL << DDR_CR35_W2RSMCS_SHIFT)                  /*!< DDR_CR35: W2RSMCS Mask                  */
#define DDR_CR35_W2RSMCS_SHIFT                   8                                                   /*!< DDR_CR35: W2RSMCS Position              */
#define DDR_CR35_W2RSMCS(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR35_W2RSMCS_SHIFT))&DDR_CR35_W2RSMCS_MASK) /*!< DDR_CR35                                */
/* ------- CR36 Bit Fields                          ------ */
#define DDR_CR36_Not_Used_MASK                   (0xFFFFUL << DDR_CR36_Not_Used_SHIFT)               /*!< DDR_CR36: Not_Used Mask                 */
#define DDR_CR36_Not_Used_SHIFT                  0                                                   /*!< DDR_CR36: Not_Used Position             */
#define DDR_CR36_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR36_Not_Used_SHIFT))&DDR_CR36_Not_Used_MASK) /*!< DDR_CR36                                */
#define DDR_CR36_NOT_USED_MASK                   (0xFFFFUL << DDR_CR36_NOT_USED_SHIFT)               /*!< DDR_CR36: NOT_USED Mask                 */
#define DDR_CR36_NOT_USED_SHIFT                  16                                                  /*!< DDR_CR36: NOT_USED Position             */
#define DDR_CR36_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR36_NOT_USED_SHIFT))&DDR_CR36_NOT_USED_MASK) /*!< DDR_CR36                                */
/* ------- CR37 Bit Fields                          ------ */
#define DDR_CR37_R2RSAME_MASK                    (0x07UL << DDR_CR37_R2RSAME_SHIFT)                  /*!< DDR_CR37: R2RSAME Mask                  */
#define DDR_CR37_R2RSAME_SHIFT                   0                                                   /*!< DDR_CR37: R2RSAME Position              */
#define DDR_CR37_R2RSAME(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR37_R2RSAME_SHIFT))&DDR_CR37_R2RSAME_MASK) /*!< DDR_CR37                                */
#define DDR_CR37_R2WSAME_MASK                    (0x07UL << DDR_CR37_R2WSAME_SHIFT)                  /*!< DDR_CR37: R2WSAME Mask                  */
#define DDR_CR37_R2WSAME_SHIFT                   8                                                   /*!< DDR_CR37: R2WSAME Position              */
#define DDR_CR37_R2WSAME(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR37_R2WSAME_SHIFT))&DDR_CR37_R2WSAME_MASK) /*!< DDR_CR37                                */
#define DDR_CR37_W2RSAME_MASK                    (0x07UL << DDR_CR37_W2RSAME_SHIFT)                  /*!< DDR_CR37: W2RSAME Mask                  */
#define DDR_CR37_W2RSAME_SHIFT                   16                                                  /*!< DDR_CR37: W2RSAME Position              */
#define DDR_CR37_W2RSAME(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR37_W2RSAME_SHIFT))&DDR_CR37_W2RSAME_MASK) /*!< DDR_CR37                                */
#define DDR_CR37_W2WSAME_MASK                    (0x07UL << DDR_CR37_W2WSAME_SHIFT)                  /*!< DDR_CR37: W2WSAME Mask                  */
#define DDR_CR37_W2WSAME_SHIFT                   24                                                  /*!< DDR_CR37: W2WSAME Position              */
#define DDR_CR37_W2WSAME(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR37_W2WSAME_SHIFT))&DDR_CR37_W2WSAME_MASK) /*!< DDR_CR37                                */
/* ------- CR38 Bit Fields                          ------ */
#define DDR_CR38_PDNCS_MASK                      (0x1FUL << DDR_CR38_PDNCS_SHIFT)                    /*!< DDR_CR38: PDNCS Mask                    */
#define DDR_CR38_PDNCS_SHIFT                     0                                                   /*!< DDR_CR38: PDNCS Position                */
#define DDR_CR38_PDNCS(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR38_PDNCS_SHIFT))&DDR_CR38_PDNCS_MASK) /*!< DDR_CR38                                */
#define DDR_CR38_PUPCS_MASK                      (0x1FUL << DDR_CR38_PUPCS_SHIFT)                    /*!< DDR_CR38: PUPCS Mask                    */
