podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define DDR_CR38_PUPCS_SHIFT                     8                                                   /*!< DDR_CR38: PUPCS Position                */
#define DDR_CR38_PUPCS(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR38_PUPCS_SHIFT))&DDR_CR38_PUPCS_MASK) /*!< DDR_CR38                                */
#define DDR_CR38_PWRCNT_MASK                     (0x7FFUL << DDR_CR38_PWRCNT_SHIFT)                  /*!< DDR_CR38: PWRCNT Mask                   */
#define DDR_CR38_PWRCNT_SHIFT                    16                                                  /*!< DDR_CR38: PWRCNT Position               */
#define DDR_CR38_PWRCNT(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR38_PWRCNT_SHIFT))&DDR_CR38_PWRCNT_MASK) /*!< DDR_CR38                                */
/* ------- CR39 Bit Fields                          ------ */
#define DDR_CR39_P0RDCNT_MASK                    (0x7FFUL << DDR_CR39_P0RDCNT_SHIFT)                 /*!< DDR_CR39: P0RDCNT Mask                  */
#define DDR_CR39_P0RDCNT_SHIFT                   0                                                   /*!< DDR_CR39: P0RDCNT Position              */
#define DDR_CR39_P0RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR39_P0RDCNT_SHIFT))&DDR_CR39_P0RDCNT_MASK) /*!< DDR_CR39                                */
#define DDR_CR39_RP0_MASK                        (0x03UL << DDR_CR39_RP0_SHIFT)                      /*!< DDR_CR39: RP0 Mask                      */
#define DDR_CR39_RP0_SHIFT                       16                                                  /*!< DDR_CR39: RP0 Position                  */
#define DDR_CR39_RP0(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR39_RP0_SHIFT))&DDR_CR39_RP0_MASK) /*!< DDR_CR39                                */
#define DDR_CR39_WP0_MASK                        (0x03UL << DDR_CR39_WP0_SHIFT)                      /*!< DDR_CR39: WP0 Mask                      */
#define DDR_CR39_WP0_SHIFT                       24                                                  /*!< DDR_CR39: WP0 Position                  */
#define DDR_CR39_WP0(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR39_WP0_SHIFT))&DDR_CR39_WP0_MASK) /*!< DDR_CR39                                */
/* ------- CR40 Bit Fields                          ------ */
#define DDR_CR40_P0TYP_MASK                      (0x03UL << DDR_CR40_P0TYP_SHIFT)                    /*!< DDR_CR40: P0TYP Mask                    */
#define DDR_CR40_P0TYP_SHIFT                     0                                                   /*!< DDR_CR40: P0TYP Position                */
#define DDR_CR40_P0TYP(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR40_P0TYP_SHIFT))&DDR_CR40_P0TYP_MASK) /*!< DDR_CR40                                */
#define DDR_CR40_P1WRCNT_MASK                    (0x7FFUL << DDR_CR40_P1WRCNT_SHIFT)                 /*!< DDR_CR40: P1WRCNT Mask                  */
#define DDR_CR40_P1WRCNT_SHIFT                   8                                                   /*!< DDR_CR40: P1WRCNT Position              */
#define DDR_CR40_P1WRCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR40_P1WRCNT_SHIFT))&DDR_CR40_P1WRCNT_MASK) /*!< DDR_CR40                                */
/* ------- CR41 Bit Fields                          ------ */
#define DDR_CR41_P1RDCNT_MASK                    (0x7FFUL << DDR_CR41_P1RDCNT_SHIFT)                 /*!< DDR_CR41: P1RDCNT Mask                  */
#define DDR_CR41_P1RDCNT_SHIFT                   0                                                   /*!< DDR_CR41: P1RDCNT Position              */
#define DDR_CR41_P1RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR41_P1RDCNT_SHIFT))&DDR_CR41_P1RDCNT_MASK) /*!< DDR_CR41                                */
#define DDR_CR41_RP1_MASK                        (0x03UL << DDR_CR41_RP1_SHIFT)                      /*!< DDR_CR41: RP1 Mask                      */
#define DDR_CR41_RP1_SHIFT                       16                                                  /*!< DDR_CR41: RP1 Position                  */
#define DDR_CR41_RP1(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR41_RP1_SHIFT))&DDR_CR41_RP1_MASK) /*!< DDR_CR41                                */
#define DDR_CR41_WP1_MASK                        (0x03UL << DDR_CR41_WP1_SHIFT)                      /*!< DDR_CR41: WP1 Mask                      */
#define DDR_CR41_WP1_SHIFT                       24                                                  /*!< DDR_CR41: WP1 Position                  */
#define DDR_CR41_WP1(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR41_WP1_SHIFT))&DDR_CR41_WP1_MASK) /*!< DDR_CR41                                */
/* ------- CR42 Bit Fields                          ------ */
#define DDR_CR42_P1TYP_MASK                      (0x03UL << DDR_CR42_P1TYP_SHIFT)                    /*!< DDR_CR42: P1TYP Mask                    */
#define DDR_CR42_P1TYP_SHIFT                     0                                                   /*!< DDR_CR42: P1TYP Position                */
#define DDR_CR42_P1TYP(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR42_P1TYP_SHIFT))&DDR_CR42_P1TYP_MASK) /*!< DDR_CR42                                */
#define DDR_CR42_P2WRCNT_MASK                    (0x7FFUL << DDR_CR42_P2WRCNT_SHIFT)                 /*!< DDR_CR42: P2WRCNT Mask                  */
#define DDR_CR42_P2WRCNT_SHIFT                   8                                                   /*!< DDR_CR42: P2WRCNT Position              */
#define DDR_CR42_P2WRCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR42_P2WRCNT_SHIFT))&DDR_CR42_P2WRCNT_MASK) /*!< DDR_CR42                                */
/* ------- CR43 Bit Fields                          ------ */
#define DDR_CR43_P2RDCNT_MASK                    (0x7FFUL << DDR_CR43_P2RDCNT_SHIFT)                 /*!< DDR_CR43: P2RDCNT Mask                  */
#define DDR_CR43_P2RDCNT_SHIFT                   0                                                   /*!< DDR_CR43: P2RDCNT Position              */
#define DDR_CR43_P2RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR43_P2RDCNT_SHIFT))&DDR_CR43_P2RDCNT_MASK) /*!< DDR_CR43                                */
#define DDR_CR43_RP2_MASK                        (0x03UL << DDR_CR43_RP2_SHIFT)                      /*!< DDR_CR43: RP2 Mask                      */
#define DDR_CR43_RP2_SHIFT                       16                                                  /*!< DDR_CR43: RP2 Position                  */
#define DDR_CR43_RP2(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR43_RP2_SHIFT))&DDR_CR43_RP2_MASK) /*!< DDR_CR43                                */
#define DDR_CR43_WP2_MASK                        (0x03UL << DDR_CR43_WP2_SHIFT)                      /*!< DDR_CR43: WP2 Mask                      */
#define DDR_CR43_WP2_SHIFT                       24                                                  /*!< DDR_CR43: WP2 Position                  */
#define DDR_CR43_WP2(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR43_WP2_SHIFT))&DDR_CR43_WP2_MASK) /*!< DDR_CR43                                */
/* ------- CR44 Bit Fields                          ------ */
#define DDR_CR44_P2TYP_MASK                      (0x03UL << DDR_CR44_P2TYP_SHIFT)                    /*!< DDR_CR44: P2TYP Mask                    */
#define DDR_CR44_P2TYP_SHIFT                     0                                                   /*!< DDR_CR44: P2TYP Position                */
#define DDR_CR44_P2TYP(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR44_P2TYP_SHIFT))&DDR_CR44_P2TYP_MASK) /*!< DDR_CR44                                */
#define DDR_CR44_WRRLAT_MASK                     (0x01UL << DDR_CR44_WRRLAT_SHIFT)                   /*!< DDR_CR44: WRRLAT Mask                   */
#define DDR_CR44_WRRLAT_SHIFT                    8                                                   /*!< DDR_CR44: WRRLAT Position               */
#define DDR_CR44_WRRSHARE_MASK                   (0x01UL << DDR_CR44_WRRSHARE_SHIFT)                 /*!< DDR_CR44: WRRSHARE Mask                 */
#define DDR_CR44_WRRSHARE_SHIFT                  16                                                  /*!< DDR_CR44: WRRSHARE Position             */
#define DDR_CR44_WRRERR_MASK                     (0x0FUL << DDR_CR44_WRRERR_SHIFT)                   /*!< DDR_CR44: WRRERR Mask                   */
#define DDR_CR44_WRRERR_SHIFT                    24                                                  /*!< DDR_CR44: WRRERR Position               */
#define DDR_CR44_WRRERR(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR44_WRRERR_SHIFT))&DDR_CR44_WRRERR_MASK) /*!< DDR_CR44                                */
/* ------- CR45 Bit Fields                          ------ */
#define DDR_CR45_P0PRI0_MASK                     (0x0FUL << DDR_CR45_P0PRI0_SHIFT)                   /*!< DDR_CR45: P0PRI0 Mask                   */
#define DDR_CR45_P0PRI0_SHIFT                    0                                                   /*!< DDR_CR45: P0PRI0 Position               */
#define DDR_CR45_P0PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI0_SHIFT))&DDR_CR45_P0PRI0_MASK) /*!< DDR_CR45                                */
#define DDR_CR45_P0PRI1_MASK                     (0x0FUL << DDR_CR45_P0PRI1_SHIFT)                   /*!< DDR_CR45: P0PRI1 Mask                   */
#define DDR_CR45_P0PRI1_SHIFT                    8                                                   /*!< DDR_CR45: P0PRI1 Position               */
#define DDR_CR45_P0PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI1_SHIFT))&DDR_CR45_P0PRI1_MASK) /*!< DDR_CR45                                */
#define DDR_CR45_P0PRI2_MASK                     (0x0FUL << DDR_CR45_P0PRI2_SHIFT)                   /*!< DDR_CR45: P0PRI2 Mask                   */
#define DDR_CR45_P0PRI2_SHIFT                    16                                                  /*!< DDR_CR45: P0PRI2 Position               */
#define DDR_CR45_P0PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI2_SHIFT))&DDR_CR45_P0PRI2_MASK) /*!< DDR_CR45                                */
#define DDR_CR45_P0PRI3_MASK                     (0x0FUL << DDR_CR45_P0PRI3_SHIFT)                   /*!< DDR_CR45: P0PRI3 Mask                   */
#define DDR_CR45_P0PRI3_SHIFT                    24                                                  /*!< DDR_CR45: P0PRI3 Position               */
#define DDR_CR45_P0PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI3_SHIFT))&DDR_CR45_P0PRI3_MASK) /*!< DDR_CR45                                */
/* ------- CR46 Bit Fields                          ------ */
#define DDR_CR46_P0ORD_MASK                      (0x03UL << DDR_CR46_P0ORD_SHIFT)                    /*!< DDR_CR46: P0ORD Mask                    */
#define DDR_CR46_P0ORD_SHIFT                     0                                                   /*!< DDR_CR46: P0ORD Position                */
#define DDR_CR46_P0ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P0ORD_SHIFT))&DDR_CR46_P0ORD_MASK) /*!< DDR_CR46                                */
#define DDR_CR46_P0PRIRLX_MASK                   (0x3FFUL << DDR_CR46_P0PRIRLX_SHIFT)                /*!< DDR_CR46: P0PRIRLX Mask                 */
#define DDR_CR46_P0PRIRLX_SHIFT                  8                                                   /*!< DDR_CR46: P0PRIRLX Position             */
#define DDR_CR46_P0PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P0PRIRLX_SHIFT))&DDR_CR46_P0PRIRLX_MASK) /*!< DDR_CR46                                */
#define DDR_CR46_P1PRI0_MASK                     (0x0FUL << DDR_CR46_P1PRI0_SHIFT)                   /*!< DDR_CR46: P1PRI0 Mask                   */
#define DDR_CR46_P1PRI0_SHIFT                    24                                                  /*!< DDR_CR46: P1PRI0 Position               */
#define DDR_CR46_P1PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P1PRI0_SHIFT))&DDR_CR46_P1PRI0_MASK) /*!< DDR_CR46                                */
/* ------- CR47 Bit Fields                          ------ */
#define DDR_CR47_P1PRI1_MASK                     (0x0FUL << DDR_CR47_P1PRI1_SHIFT)                   /*!< DDR_CR47: P1PRI1 Mask                   */
#define DDR_CR47_P1PRI1_SHIFT                    0                                                   /*!< DDR_CR47: P1PRI1 Position               */
#define DDR_CR47_P1PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI1_SHIFT))&DDR_CR47_P1PRI1_MASK) /*!< DDR_CR47                                */
#define DDR_CR47_P1PRI2_MASK                     (0x0FUL << DDR_CR47_P1PRI2_SHIFT)                   /*!< DDR_CR47: P1PRI2 Mask                   */
#define DDR_CR47_P1PRI2_SHIFT                    8                                                   /*!< DDR_CR47: P1PRI2 Position               */
#define DDR_CR47_P1PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI2_SHIFT))&DDR_CR47_P1PRI2_MASK) /*!< DDR_CR47                                */
#define DDR_CR47_P1PRI3_MASK                     (0x0FUL << DDR_CR47_P1PRI3_SHIFT)                   /*!< DDR_CR47: P1PRI3 Mask                   */
#define DDR_CR47_P1PRI3_SHIFT                    16                                                  /*!< DDR_CR47: P1PRI3 Position               */
#define DDR_CR47_P1PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI3_SHIFT))&DDR_CR47_P1PRI3_MASK) /*!< DDR_CR47                                */
#define DDR_CR47_P1ORD_MASK                      (0x03UL << DDR_CR47_P1ORD_SHIFT)                    /*!< DDR_CR47: P1ORD Mask                    */
#define DDR_CR47_P1ORD_SHIFT                     24                                                  /*!< DDR_CR47: P1ORD Position                */
#define DDR_CR47_P1ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1ORD_SHIFT))&DDR_CR47_P1ORD_MASK) /*!< DDR_CR47                                */
/* ------- CR48 Bit Fields                          ------ */
#define DDR_CR48_P1PRIRLX_MASK                   (0x3FFUL << DDR_CR48_P1PRIRLX_SHIFT)                /*!< DDR_CR48: P1PRIRLX Mask                 */
#define DDR_CR48_P1PRIRLX_SHIFT                  0                                                   /*!< DDR_CR48: P1PRIRLX Position             */
#define DDR_CR48_P1PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P1PRIRLX_SHIFT))&DDR_CR48_P1PRIRLX_MASK) /*!< DDR_CR48                                */
#define DDR_CR48_P2PRI0_MASK                     (0x0FUL << DDR_CR48_P2PRI0_SHIFT)                   /*!< DDR_CR48: P2PRI0 Mask                   */
#define DDR_CR48_P2PRI0_SHIFT                    16                                                  /*!< DDR_CR48: P2PRI0 Position               */
#define DDR_CR48_P2PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P2PRI0_SHIFT))&DDR_CR48_P2PRI0_MASK) /*!< DDR_CR48                                */
#define DDR_CR48_P2PRI1_MASK                     (0x0FUL << DDR_CR48_P2PRI1_SHIFT)                   /*!< DDR_CR48: P2PRI1 Mask                   */
#define DDR_CR48_P2PRI1_SHIFT                    24                                                  /*!< DDR_CR48: P2PRI1 Position               */
#define DDR_CR48_P2PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P2PRI1_SHIFT))&DDR_CR48_P2PRI1_MASK) /*!< DDR_CR48                                */
/* ------- CR49 Bit Fields                          ------ */
#define DDR_CR49_P2PRI2_MASK                     (0x0FUL << DDR_CR49_P2PRI2_SHIFT)                   /*!< DDR_CR49: P2PRI2 Mask                   */
#define DDR_CR49_P2PRI2_SHIFT                    0                                                   /*!< DDR_CR49: P2PRI2 Position               */
#define DDR_CR49_P2PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2PRI2_SHIFT))&DDR_CR49_P2PRI2_MASK) /*!< DDR_CR49                                */
#define DDR_CR49_P2PRI3_MASK                     (0x0FUL << DDR_CR49_P2PRI3_SHIFT)                   /*!< DDR_CR49: P2PRI3 Mask                   */
#define DDR_CR49_P2PRI3_SHIFT                    8                                                   /*!< DDR_CR49: P2PRI3 Position               */
#define DDR_CR49_P2PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2PRI3_SHIFT))&DDR_CR49_P2PRI3_MASK) /*!< DDR_CR49                                */
#define DDR_CR49_P2ORD_MASK                      (0x03UL << DDR_CR49_P2ORD_SHIFT)                    /*!< DDR_CR49: P2ORD Mask                    */
#define DDR_CR49_P2ORD_SHIFT                     16                                                  /*!< DDR_CR49: P2ORD Position                */
#define DDR_CR49_P2ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2ORD_SHIFT))&DDR_CR49_P2ORD_MASK) /*!< DDR_CR49                                */
/* ------- CR50 Bit Fields                          ------ */
#define DDR_CR50_P2PRIRLX_MASK                   (0x3FFUL << DDR_CR50_P2PRIRLX_SHIFT)                /*!< DDR_CR50: P2PRIRLX Mask                 */
#define DDR_CR50_P2PRIRLX_SHIFT                  0                                                   /*!< DDR_CR50: P2PRIRLX Position             */
#define DDR_CR50_P2PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR50_P2PRIRLX_SHIFT))&DDR_CR50_P2PRIRLX_MASK) /*!< DDR_CR50                                */
#define DDR_CR50_CLKSTATUS_MASK                  (0x01UL << DDR_CR50_CLKSTATUS_SHIFT)                /*!< DDR_CR50: CLKSTATUS Mask                */
#define DDR_CR50_CLKSTATUS_SHIFT                 16                                                  /*!< DDR_CR50: CLKSTATUS Position            */
/* ------- CR51 Bit Fields                          ------ */
#define DDR_CR51_DLLRSTDLY_MASK                  (0xFFFFUL << DDR_CR51_DLLRSTDLY_SHIFT)              /*!< DDR_CR51: DLLRSTDLY Mask                */
#define DDR_CR51_DLLRSTDLY_SHIFT                 0                                                   /*!< DDR_CR51: DLLRSTDLY Position            */
#define DDR_CR51_DLLRSTDLY(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR51_DLLRSTDLY_SHIFT))&DDR_CR51_DLLRSTDLY_MASK) /*!< DDR_CR51                                */
#define DDR_CR51_DLLRADLY_MASK                   (0xFFUL << DDR_CR51_DLLRADLY_SHIFT)                 /*!< DDR_CR51: DLLRADLY Mask                 */
#define DDR_CR51_DLLRADLY_SHIFT                  16                                                  /*!< DDR_CR51: DLLRADLY Position             */
#define DDR_CR51_DLLRADLY(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR51_DLLRADLY_SHIFT))&DDR_CR51_DLLRADLY_MASK) /*!< DDR_CR51                                */
#define DDR_CR51_PHYWRLAT_MASK                   (0x0FUL << DDR_CR51_PHYWRLAT_SHIFT)                 /*!< DDR_CR51: PHYWRLAT Mask                 */
#define DDR_CR51_PHYWRLAT_SHIFT                  24                                                  /*!< DDR_CR51: PHYWRLAT Position             */
#define DDR_CR51_PHYWRLAT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR51_PHYWRLAT_SHIFT))&DDR_CR51_PHYWRLAT_MASK) /*!< DDR_CR51                                */
/* ------- CR52 Bit Fields                          ------ */
#define DDR_CR52_PYWRLTBS_MASK                   (0x0FUL << DDR_CR52_PYWRLTBS_SHIFT)                 /*!< DDR_CR52: PYWRLTBS Mask                 */
#define DDR_CR52_PYWRLTBS_SHIFT                  0                                                   /*!< DDR_CR52: PYWRLTBS Position             */
#define DDR_CR52_PYWRLTBS(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_PYWRLTBS_SHIFT))&DDR_CR52_PYWRLTBS_MASK) /*!< DDR_CR52                                */
#define DDR_CR52_PHYRDLAT_MASK                   (0x0FUL << DDR_CR52_PHYRDLAT_SHIFT)                 /*!< DDR_CR52: PHYRDLAT Mask                 */
#define DDR_CR52_PHYRDLAT_SHIFT                  8                                                   /*!< DDR_CR52: PHYRDLAT Position             */
#define DDR_CR52_PHYRDLAT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_PHYRDLAT_SHIFT))&DDR_CR52_PHYRDLAT_MASK) /*!< DDR_CR52                                */
#define DDR_CR52_RDDATAEN_MASK                   (0x0FUL << DDR_CR52_RDDATAEN_SHIFT)                 /*!< DDR_CR52: RDDATAEN Mask                 */
#define DDR_CR52_RDDATAEN_SHIFT                  16                                                  /*!< DDR_CR52: RDDATAEN Position             */
#define DDR_CR52_RDDATAEN(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_RDDATAEN_SHIFT))&DDR_CR52_RDDATAEN_MASK) /*!< DDR_CR52                                */
#define DDR_CR52_RDDTENBAS_MASK                  (0x0FUL << DDR_CR52_RDDTENBAS_SHIFT)                /*!< DDR_CR52: RDDTENBAS Mask                */
#define DDR_CR52_RDDTENBAS_SHIFT                 24                                                  /*!< DDR_CR52: RDDTENBAS Position            */
#define DDR_CR52_RDDTENBAS(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR52_RDDTENBAS_SHIFT))&DDR_CR52_RDDTENBAS_MASK) /*!< DDR_CR52                                */
/* ------- CR53 Bit Fields                          ------ */
#define DDR_CR53_CLKDISCS_MASK                   (0x01UL << DDR_CR53_CLKDISCS_SHIFT)                 /*!< DDR_CR53: CLKDISCS Mask                 */
#define DDR_CR53_CLKDISCS_SHIFT                  0                                                   /*!< DDR_CR53: CLKDISCS Position             */
#define DDR_CR53_CRTLUPDMN_MASK                  (0x0FUL << DDR_CR53_CRTLUPDMN_SHIFT)                /*!< DDR_CR53: CRTLUPDMN Mask                */
#define DDR_CR53_CRTLUPDMN_SHIFT                 8                                                   /*!< DDR_CR53: CRTLUPDMN Position            */
#define DDR_CR53_CRTLUPDMN(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR53_CRTLUPDMN_SHIFT))&DDR_CR53_CRTLUPDMN_MASK) /*!< DDR_CR53                                */
#define DDR_CR53_CTRLUPDMX_MASK                  (0x3FFFUL << DDR_CR53_CTRLUPDMX_SHIFT)              /*!< DDR_CR53: CTRLUPDMX Mask                */
#define DDR_CR53_CTRLUPDMX_SHIFT                 16                                                  /*!< DDR_CR53: CTRLUPDMX Position            */
#define DDR_CR53_CTRLUPDMX(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR53_CTRLUPDMX_SHIFT))&DDR_CR53_CTRLUPDMX_MASK) /*!< DDR_CR53                                */
/* ------- CR54 Bit Fields                          ------ */
#define DDR_CR54_PHYUPDTY0_MASK                  (0x3FFFUL << DDR_CR54_PHYUPDTY0_SHIFT)              /*!< DDR_CR54: PHYUPDTY0 Mask                */
#define DDR_CR54_PHYUPDTY0_SHIFT                 0                                                   /*!< DDR_CR54: PHYUPDTY0 Position            */
#define DDR_CR54_PHYUPDTY0(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR54_PHYUPDTY0_SHIFT))&DDR_CR54_PHYUPDTY0_MASK) /*!< DDR_CR54                                */
#define DDR_CR54_PHYUPDTY1_MASK                  (0x3FFFUL << DDR_CR54_PHYUPDTY1_SHIFT)              /*!< DDR_CR54: PHYUPDTY1 Mask                */
#define DDR_CR54_PHYUPDTY1_SHIFT                 16                                                  /*!< DDR_CR54: PHYUPDTY1 Position            */
#define DDR_CR54_PHYUPDTY1(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR54_PHYUPDTY1_SHIFT))&DDR_CR54_PHYUPDTY1_MASK) /*!< DDR_CR54                                */
/* ------- CR55 Bit Fields                          ------ */
#define DDR_CR55_PHYUPDTY2_MASK                  (0x3FFFUL << DDR_CR55_PHYUPDTY2_SHIFT)              /*!< DDR_CR55: PHYUPDTY2 Mask                */
