podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup DMA0_Register_Masks_GROUP DMA0 Register Masks
* @brief Register Masks for DMA0
* @{
*/
/* ------- CR Bit Fields                            ------ */
#define DMA_CR_EDBG_MASK                         (0x01UL << DMA_CR_EDBG_SHIFT)                       /*!< DMA0_CR: EDBG Mask                      */
#define DMA_CR_EDBG_SHIFT                        1                                                   /*!< DMA0_CR: EDBG Position                  */
#define DMA_CR_ERCA_MASK                         (0x01UL << DMA_CR_ERCA_SHIFT)                       /*!< DMA0_CR: ERCA Mask                      */
#define DMA_CR_ERCA_SHIFT                        2                                                   /*!< DMA0_CR: ERCA Position                  */
#define DMA_CR_ERGA_MASK                         (0x01UL << DMA_CR_ERGA_SHIFT)                       /*!< DMA0_CR: ERGA Mask                      */
#define DMA_CR_ERGA_SHIFT                        3                                                   /*!< DMA0_CR: ERGA Position                  */
#define DMA_CR_HOE_MASK                          (0x01UL << DMA_CR_HOE_SHIFT)                        /*!< DMA0_CR: HOE Mask                       */
#define DMA_CR_HOE_SHIFT                         4                                                   /*!< DMA0_CR: HOE Position                   */
#define DMA_CR_HALT_MASK                         (0x01UL << DMA_CR_HALT_SHIFT)                       /*!< DMA0_CR: HALT Mask                      */
#define DMA_CR_HALT_SHIFT                        5                                                   /*!< DMA0_CR: HALT Position                  */
#define DMA_CR_CLM_MASK                          (0x01UL << DMA_CR_CLM_SHIFT)                        /*!< DMA0_CR: CLM Mask                       */
#define DMA_CR_CLM_SHIFT                         6                                                   /*!< DMA0_CR: CLM Position                   */
#define DMA_CR_EMLM_MASK                         (0x01UL << DMA_CR_EMLM_SHIFT)                       /*!< DMA0_CR: EMLM Mask                      */
#define DMA_CR_EMLM_SHIFT                        7                                                   /*!< DMA0_CR: EMLM Position                  */
#define DMA_CR_GRP0PRI_MASK                      (0x03UL << DMA_CR_GRP0PRI_SHIFT)                    /*!< DMA0_CR: GRP0PRI Mask                   */
#define DMA_CR_GRP0PRI_SHIFT                     8                                                   /*!< DMA0_CR: GRP0PRI Position               */
#define DMA_CR_GRP0PRI(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_CR_GRP0PRI_SHIFT))&DMA_CR_GRP0PRI_MASK) /*!< DMA0_CR                                 */
#define DMA_CR_GRP1PRI_MASK                      (0x03UL << DMA_CR_GRP1PRI_SHIFT)                    /*!< DMA0_CR: GRP1PRI Mask                   */
#define DMA_CR_GRP1PRI_SHIFT                     10                                                  /*!< DMA0_CR: GRP1PRI Position               */
#define DMA_CR_GRP1PRI(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_CR_GRP1PRI_SHIFT))&DMA_CR_GRP1PRI_MASK) /*!< DMA0_CR                                 */
#define DMA_CR_ECX_MASK                          (0x01UL << DMA_CR_ECX_SHIFT)                        /*!< DMA0_CR: ECX Mask                       */
#define DMA_CR_ECX_SHIFT                         16                                                  /*!< DMA0_CR: ECX Position                   */
#define DMA_CR_CX_MASK                           (0x01UL << DMA_CR_CX_SHIFT)                         /*!< DMA0_CR: CX Mask                        */
#define DMA_CR_CX_SHIFT                          17                                                  /*!< DMA0_CR: CX Position                    */
/* ------- ES Bit Fields                            ------ */
#define DMA_ES_DBE_MASK                          (0x01UL << DMA_ES_DBE_SHIFT)                        /*!< DMA0_ES: DBE Mask                       */
#define DMA_ES_DBE_SHIFT                         0                                                   /*!< DMA0_ES: DBE Position                   */
#define DMA_ES_SBE_MASK                          (0x01UL << DMA_ES_SBE_SHIFT)                        /*!< DMA0_ES: SBE Mask                       */
#define DMA_ES_SBE_SHIFT                         1                                                   /*!< DMA0_ES: SBE Position                   */
#define DMA_ES_SGE_MASK                          (0x01UL << DMA_ES_SGE_SHIFT)                        /*!< DMA0_ES: SGE Mask                       */
#define DMA_ES_SGE_SHIFT                         2                                                   /*!< DMA0_ES: SGE Position                   */
#define DMA_ES_NCE_MASK                          (0x01UL << DMA_ES_NCE_SHIFT)                        /*!< DMA0_ES: NCE Mask                       */
#define DMA_ES_NCE_SHIFT                         3                                                   /*!< DMA0_ES: NCE Position                   */
#define DMA_ES_DOE_MASK                          (0x01UL << DMA_ES_DOE_SHIFT)                        /*!< DMA0_ES: DOE Mask                       */
#define DMA_ES_DOE_SHIFT                         4                                                   /*!< DMA0_ES: DOE Position                   */
#define DMA_ES_DAE_MASK                          (0x01UL << DMA_ES_DAE_SHIFT)                        /*!< DMA0_ES: DAE Mask                       */
#define DMA_ES_DAE_SHIFT                         5                                                   /*!< DMA0_ES: DAE Position                   */
#define DMA_ES_SOE_MASK                          (0x01UL << DMA_ES_SOE_SHIFT)                        /*!< DMA0_ES: SOE Mask                       */
#define DMA_ES_SOE_SHIFT                         6                                                   /*!< DMA0_ES: SOE Position                   */
#define DMA_ES_SAE_MASK                          (0x01UL << DMA_ES_SAE_SHIFT)                        /*!< DMA0_ES: SAE Mask                       */
#define DMA_ES_SAE_SHIFT                         7                                                   /*!< DMA0_ES: SAE Position                   */
#define DMA_ES_ERRCHN_MASK                       (0x1FUL << DMA_ES_ERRCHN_SHIFT)                     /*!< DMA0_ES: ERRCHN Mask                    */
#define DMA_ES_ERRCHN_SHIFT                      8                                                   /*!< DMA0_ES: ERRCHN Position                */
#define DMA_ES_ERRCHN(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ES_ERRCHN_SHIFT))&DMA_ES_ERRCHN_MASK) /*!< DMA0_ES                                 */
#define DMA_ES_CPE_MASK                          (0x01UL << DMA_ES_CPE_SHIFT)                        /*!< DMA0_ES: CPE Mask                       */
#define DMA_ES_CPE_SHIFT                         14                                                  /*!< DMA0_ES: CPE Position                   */
#define DMA_ES_GPE_MASK                          (0x01UL << DMA_ES_GPE_SHIFT)                        /*!< DMA0_ES: GPE Mask                       */
#define DMA_ES_GPE_SHIFT                         15                                                  /*!< DMA0_ES: GPE Position                   */
#define DMA_ES_ECX_MASK                          (0x01UL << DMA_ES_ECX_SHIFT)                        /*!< DMA0_ES: ECX Mask                       */
#define DMA_ES_ECX_SHIFT                         16                                                  /*!< DMA0_ES: ECX Position                   */
#define DMA_ES_VLD_MASK                          (0x01UL << DMA_ES_VLD_SHIFT)                        /*!< DMA0_ES: VLD Mask                       */
#define DMA_ES_VLD_SHIFT                         31                                                  /*!< DMA0_ES: VLD Position                   */
/* ------- ERQ Bit Fields                           ------ */
#define DMA_ERQ_ERQ0_MASK                        (0x01UL << DMA_ERQ_ERQ0_SHIFT)                      /*!< DMA0_ERQ: ERQ0 Mask                     */
#define DMA_ERQ_ERQ0_SHIFT                       0                                                   /*!< DMA0_ERQ: ERQ0 Position                 */
#define DMA_ERQ_ERQ1_MASK                        (0x01UL << DMA_ERQ_ERQ1_SHIFT)                      /*!< DMA0_ERQ: ERQ1 Mask                     */
#define DMA_ERQ_ERQ1_SHIFT                       1                                                   /*!< DMA0_ERQ: ERQ1 Position                 */
#define DMA_ERQ_ERQ2_MASK                        (0x01UL << DMA_ERQ_ERQ2_SHIFT)                      /*!< DMA0_ERQ: ERQ2 Mask                     */
#define DMA_ERQ_ERQ2_SHIFT                       2                                                   /*!< DMA0_ERQ: ERQ2 Position                 */
#define DMA_ERQ_ERQ3_MASK                        (0x01UL << DMA_ERQ_ERQ3_SHIFT)                      /*!< DMA0_ERQ: ERQ3 Mask                     */
#define DMA_ERQ_ERQ3_SHIFT                       3                                                   /*!< DMA0_ERQ: ERQ3 Position                 */
#define DMA_ERQ_ERQ4_MASK                        (0x01UL << DMA_ERQ_ERQ4_SHIFT)                      /*!< DMA0_ERQ: ERQ4 Mask                     */
#define DMA_ERQ_ERQ4_SHIFT                       4                                                   /*!< DMA0_ERQ: ERQ4 Position                 */
#define DMA_ERQ_ERQ5_MASK                        (0x01UL << DMA_ERQ_ERQ5_SHIFT)                      /*!< DMA0_ERQ: ERQ5 Mask                     */
#define DMA_ERQ_ERQ5_SHIFT                       5                                                   /*!< DMA0_ERQ: ERQ5 Position                 */
#define DMA_ERQ_ERQ6_MASK                        (0x01UL << DMA_ERQ_ERQ6_SHIFT)                      /*!< DMA0_ERQ: ERQ6 Mask                     */
#define DMA_ERQ_ERQ6_SHIFT                       6                                                   /*!< DMA0_ERQ: ERQ6 Position                 */
#define DMA_ERQ_ERQ7_MASK                        (0x01UL << DMA_ERQ_ERQ7_SHIFT)                      /*!< DMA0_ERQ: ERQ7 Mask                     */
#define DMA_ERQ_ERQ7_SHIFT                       7                                                   /*!< DMA0_ERQ: ERQ7 Position                 */
#define DMA_ERQ_ERQ8_MASK                        (0x01UL << DMA_ERQ_ERQ8_SHIFT)                      /*!< DMA0_ERQ: ERQ8 Mask                     */
#define DMA_ERQ_ERQ8_SHIFT                       8                                                   /*!< DMA0_ERQ: ERQ8 Position                 */
#define DMA_ERQ_ERQ9_MASK                        (0x01UL << DMA_ERQ_ERQ9_SHIFT)                      /*!< DMA0_ERQ: ERQ9 Mask                     */
#define DMA_ERQ_ERQ9_SHIFT                       9                                                   /*!< DMA0_ERQ: ERQ9 Position                 */
#define DMA_ERQ_ERQ10_MASK                       (0x01UL << DMA_ERQ_ERQ10_SHIFT)                     /*!< DMA0_ERQ: ERQ10 Mask                    */
#define DMA_ERQ_ERQ10_SHIFT                      10                                                  /*!< DMA0_ERQ: ERQ10 Position                */
#define DMA_ERQ_ERQ11_MASK                       (0x01UL << DMA_ERQ_ERQ11_SHIFT)                     /*!< DMA0_ERQ: ERQ11 Mask                    */
#define DMA_ERQ_ERQ11_SHIFT                      11                                                  /*!< DMA0_ERQ: ERQ11 Position                */
#define DMA_ERQ_ERQ12_MASK                       (0x01UL << DMA_ERQ_ERQ12_SHIFT)                     /*!< DMA0_ERQ: ERQ12 Mask                    */
#define DMA_ERQ_ERQ12_SHIFT                      12                                                  /*!< DMA0_ERQ: ERQ12 Position                */
#define DMA_ERQ_ERQ13_MASK                       (0x01UL << DMA_ERQ_ERQ13_SHIFT)                     /*!< DMA0_ERQ: ERQ13 Mask                    */
#define DMA_ERQ_ERQ13_SHIFT                      13                                                  /*!< DMA0_ERQ: ERQ13 Position                */
#define DMA_ERQ_ERQ14_MASK                       (0x01UL << DMA_ERQ_ERQ14_SHIFT)                     /*!< DMA0_ERQ: ERQ14 Mask                    */
#define DMA_ERQ_ERQ14_SHIFT                      14                                                  /*!< DMA0_ERQ: ERQ14 Position                */
#define DMA_ERQ_ERQ15_MASK                       (0x01UL << DMA_ERQ_ERQ15_SHIFT)                     /*!< DMA0_ERQ: ERQ15 Mask                    */
#define DMA_ERQ_ERQ15_SHIFT                      15                                                  /*!< DMA0_ERQ: ERQ15 Position                */
#define DMA_ERQ_ERQ16_MASK                       (0x01UL << DMA_ERQ_ERQ16_SHIFT)                     /*!< DMA0_ERQ: ERQ16 Mask                    */
#define DMA_ERQ_ERQ16_SHIFT                      16                                                  /*!< DMA0_ERQ: ERQ16 Position                */
#define DMA_ERQ_ERQ17_MASK                       (0x01UL << DMA_ERQ_ERQ17_SHIFT)                     /*!< DMA0_ERQ: ERQ17 Mask                    */
#define DMA_ERQ_ERQ17_SHIFT                      17                                                  /*!< DMA0_ERQ: ERQ17 Position                */
#define DMA_ERQ_ERQ18_MASK                       (0x01UL << DMA_ERQ_ERQ18_SHIFT)                     /*!< DMA0_ERQ: ERQ18 Mask                    */
#define DMA_ERQ_ERQ18_SHIFT                      18                                                  /*!< DMA0_ERQ: ERQ18 Position                */
#define DMA_ERQ_ERQ19_MASK                       (0x01UL << DMA_ERQ_ERQ19_SHIFT)                     /*!< DMA0_ERQ: ERQ19 Mask                    */
#define DMA_ERQ_ERQ19_SHIFT                      19                                                  /*!< DMA0_ERQ: ERQ19 Position                */
#define DMA_ERQ_ERQ20_MASK                       (0x01UL << DMA_ERQ_ERQ20_SHIFT)                     /*!< DMA0_ERQ: ERQ20 Mask                    */
#define DMA_ERQ_ERQ20_SHIFT                      20                                                  /*!< DMA0_ERQ: ERQ20 Position                */
#define DMA_ERQ_ERQ21_MASK                       (0x01UL << DMA_ERQ_ERQ21_SHIFT)                     /*!< DMA0_ERQ: ERQ21 Mask                    */
#define DMA_ERQ_ERQ21_SHIFT                      21                                                  /*!< DMA0_ERQ: ERQ21 Position                */
#define DMA_ERQ_ERQ22_MASK                       (0x01UL << DMA_ERQ_ERQ22_SHIFT)                     /*!< DMA0_ERQ: ERQ22 Mask                    */
#define DMA_ERQ_ERQ22_SHIFT                      22                                                  /*!< DMA0_ERQ: ERQ22 Position                */
#define DMA_ERQ_ERQ23_MASK                       (0x01UL << DMA_ERQ_ERQ23_SHIFT)                     /*!< DMA0_ERQ: ERQ23 Mask                    */
#define DMA_ERQ_ERQ23_SHIFT                      23                                                  /*!< DMA0_ERQ: ERQ23 Position                */
#define DMA_ERQ_ERQ24_MASK                       (0x01UL << DMA_ERQ_ERQ24_SHIFT)                     /*!< DMA0_ERQ: ERQ24 Mask                    */
#define DMA_ERQ_ERQ24_SHIFT                      24                                                  /*!< DMA0_ERQ: ERQ24 Position                */
#define DMA_ERQ_ERQ25_MASK                       (0x01UL << DMA_ERQ_ERQ25_SHIFT)                     /*!< DMA0_ERQ: ERQ25 Mask                    */
#define DMA_ERQ_ERQ25_SHIFT                      25                                                  /*!< DMA0_ERQ: ERQ25 Position                */
#define DMA_ERQ_ERQ26_MASK                       (0x01UL << DMA_ERQ_ERQ26_SHIFT)                     /*!< DMA0_ERQ: ERQ26 Mask                    */
#define DMA_ERQ_ERQ26_SHIFT                      26                                                  /*!< DMA0_ERQ: ERQ26 Position                */
#define DMA_ERQ_ERQ27_MASK                       (0x01UL << DMA_ERQ_ERQ27_SHIFT)                     /*!< DMA0_ERQ: ERQ27 Mask                    */
#define DMA_ERQ_ERQ27_SHIFT                      27                                                  /*!< DMA0_ERQ: ERQ27 Position                */
#define DMA_ERQ_ERQ28_MASK                       (0x01UL << DMA_ERQ_ERQ28_SHIFT)                     /*!< DMA0_ERQ: ERQ28 Mask                    */
#define DMA_ERQ_ERQ28_SHIFT                      28                                                  /*!< DMA0_ERQ: ERQ28 Position                */
#define DMA_ERQ_ERQ29_MASK                       (0x01UL << DMA_ERQ_ERQ29_SHIFT)                     /*!< DMA0_ERQ: ERQ29 Mask                    */
#define DMA_ERQ_ERQ29_SHIFT                      29                                                  /*!< DMA0_ERQ: ERQ29 Position                */
#define DMA_ERQ_ERQ30_MASK                       (0x01UL << DMA_ERQ_ERQ30_SHIFT)                     /*!< DMA0_ERQ: ERQ30 Mask                    */
#define DMA_ERQ_ERQ30_SHIFT                      30                                                  /*!< DMA0_ERQ: ERQ30 Position                */
#define DMA_ERQ_ERQ31_MASK                       (0x01UL << DMA_ERQ_ERQ31_SHIFT)                     /*!< DMA0_ERQ: ERQ31 Mask                    */
#define DMA_ERQ_ERQ31_SHIFT                      31                                                  /*!< DMA0_ERQ: ERQ31 Position                */
/* ------- EEI Bit Fields                           ------ */
#define DMA_EEI_EEI0_MASK                        (0x01UL << DMA_EEI_EEI0_SHIFT)                      /*!< DMA0_EEI: EEI0 Mask                     */
#define DMA_EEI_EEI0_SHIFT                       0                                                   /*!< DMA0_EEI: EEI0 Position                 */
#define DMA_EEI_EEI1_MASK                        (0x01UL << DMA_EEI_EEI1_SHIFT)                      /*!< DMA0_EEI: EEI1 Mask                     */
#define DMA_EEI_EEI1_SHIFT                       1                                                   /*!< DMA0_EEI: EEI1 Position                 */
#define DMA_EEI_EEI2_MASK                        (0x01UL << DMA_EEI_EEI2_SHIFT)                      /*!< DMA0_EEI: EEI2 Mask                     */
#define DMA_EEI_EEI2_SHIFT                       2                                                   /*!< DMA0_EEI: EEI2 Position                 */
#define DMA_EEI_EEI3_MASK                        (0x01UL << DMA_EEI_EEI3_SHIFT)                      /*!< DMA0_EEI: EEI3 Mask                     */
#define DMA_EEI_EEI3_SHIFT                       3                                                   /*!< DMA0_EEI: EEI3 Position                 */
#define DMA_EEI_EEI4_MASK                        (0x01UL << DMA_EEI_EEI4_SHIFT)                      /*!< DMA0_EEI: EEI4 Mask                     */
#define DMA_EEI_EEI4_SHIFT                       4                                                   /*!< DMA0_EEI: EEI4 Position                 */
#define DMA_EEI_EEI5_MASK                        (0x01UL << DMA_EEI_EEI5_SHIFT)                      /*!< DMA0_EEI: EEI5 Mask                     */
#define DMA_EEI_EEI5_SHIFT                       5                                                   /*!< DMA0_EEI: EEI5 Position                 */
#define DMA_EEI_EEI6_MASK                        (0x01UL << DMA_EEI_EEI6_SHIFT)                      /*!< DMA0_EEI: EEI6 Mask                     */
#define DMA_EEI_EEI6_SHIFT                       6                                                   /*!< DMA0_EEI: EEI6 Position                 */
#define DMA_EEI_EEI7_MASK                        (0x01UL << DMA_EEI_EEI7_SHIFT)                      /*!< DMA0_EEI: EEI7 Mask                     */
#define DMA_EEI_EEI7_SHIFT                       7                                                   /*!< DMA0_EEI: EEI7 Position                 */
#define DMA_EEI_EEI8_MASK                        (0x01UL << DMA_EEI_EEI8_SHIFT)                      /*!< DMA0_EEI: EEI8 Mask                     */
#define DMA_EEI_EEI8_SHIFT                       8                                                   /*!< DMA0_EEI: EEI8 Position                 */
#define DMA_EEI_EEI9_MASK                        (0x01UL << DMA_EEI_EEI9_SHIFT)                      /*!< DMA0_EEI: EEI9 Mask                     */
#define DMA_EEI_EEI9_SHIFT                       9                                                   /*!< DMA0_EEI: EEI9 Position                 */
#define DMA_EEI_EEI10_MASK                       (0x01UL << DMA_EEI_EEI10_SHIFT)                     /*!< DMA0_EEI: EEI10 Mask                    */
#define DMA_EEI_EEI10_SHIFT                      10                                                  /*!< DMA0_EEI: EEI10 Position                */
#define DMA_EEI_EEI11_MASK                       (0x01UL << DMA_EEI_EEI11_SHIFT)                     /*!< DMA0_EEI: EEI11 Mask                    */
#define DMA_EEI_EEI11_SHIFT                      11                                                  /*!< DMA0_EEI: EEI11 Position                */
#define DMA_EEI_EEI12_MASK                       (0x01UL << DMA_EEI_EEI12_SHIFT)                     /*!< DMA0_EEI: EEI12 Mask                    */
#define DMA_EEI_EEI12_SHIFT                      12                                                  /*!< DMA0_EEI: EEI12 Position                */
#define DMA_EEI_EEI13_MASK                       (0x01UL << DMA_EEI_EEI13_SHIFT)                     /*!< DMA0_EEI: EEI13 Mask                    */
#define DMA_EEI_EEI13_SHIFT                      13                                                  /*!< DMA0_EEI: EEI13 Position                */
#define DMA_EEI_EEI14_MASK                       (0x01UL << DMA_EEI_EEI14_SHIFT)                     /*!< DMA0_EEI: EEI14 Mask                    */
#define DMA_EEI_EEI14_SHIFT                      14                                                  /*!< DMA0_EEI: EEI14 Position                */
#define DMA_EEI_EEI15_MASK                       (0x01UL << DMA_EEI_EEI15_SHIFT)                     /*!< DMA0_EEI: EEI15 Mask                    */
#define DMA_EEI_EEI15_SHIFT                      15                                                  /*!< DMA0_EEI: EEI15 Position                */
#define DMA_EEI_EEI16_MASK                       (0x01UL << DMA_EEI_EEI16_SHIFT)                     /*!< DMA0_EEI: EEI16 Mask                    */
#define DMA_EEI_EEI16_SHIFT                      16                                                  /*!< DMA0_EEI: EEI16 Position                */
#define DMA_EEI_EEI17_MASK                       (0x01UL << DMA_EEI_EEI17_SHIFT)                     /*!< DMA0_EEI: EEI17 Mask                    */
#define DMA_EEI_EEI17_SHIFT                      17                                                  /*!< DMA0_EEI: EEI17 Position                */
#define DMA_EEI_EEI18_MASK                       (0x01UL << DMA_EEI_EEI18_SHIFT)                     /*!< DMA0_EEI: EEI18 Mask                    */
#define DMA_EEI_EEI18_SHIFT                      18                                                  /*!< DMA0_EEI: EEI18 Position                */
#define DMA_EEI_EEI19_MASK                       (0x01UL << DMA_EEI_EEI19_SHIFT)                     /*!< DMA0_EEI: EEI19 Mask                    */
#define DMA_EEI_EEI19_SHIFT                      19                                                  /*!< DMA0_EEI: EEI19 Position                */
#define DMA_EEI_EEI20_MASK                       (0x01UL << DMA_EEI_EEI20_SHIFT)                     /*!< DMA0_EEI: EEI20 Mask                    */
#define DMA_EEI_EEI20_SHIFT                      20                                                  /*!< DMA0_EEI: EEI20 Position                */
#define DMA_EEI_EEI21_MASK                       (0x01UL << DMA_EEI_EEI21_SHIFT)                     /*!< DMA0_EEI: EEI21 Mask                    */
