podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define DMA_EEI_EEI21_SHIFT                      21                                                  /*!< DMA0_EEI: EEI21 Position                */
#define DMA_EEI_EEI22_MASK                       (0x01UL << DMA_EEI_EEI22_SHIFT)                     /*!< DMA0_EEI: EEI22 Mask                    */
#define DMA_EEI_EEI22_SHIFT                      22                                                  /*!< DMA0_EEI: EEI22 Position                */
#define DMA_EEI_EEI23_MASK                       (0x01UL << DMA_EEI_EEI23_SHIFT)                     /*!< DMA0_EEI: EEI23 Mask                    */
#define DMA_EEI_EEI23_SHIFT                      23                                                  /*!< DMA0_EEI: EEI23 Position                */
#define DMA_EEI_EEI24_MASK                       (0x01UL << DMA_EEI_EEI24_SHIFT)                     /*!< DMA0_EEI: EEI24 Mask                    */
#define DMA_EEI_EEI24_SHIFT                      24                                                  /*!< DMA0_EEI: EEI24 Position                */
#define DMA_EEI_EEI25_MASK                       (0x01UL << DMA_EEI_EEI25_SHIFT)                     /*!< DMA0_EEI: EEI25 Mask                    */
#define DMA_EEI_EEI25_SHIFT                      25                                                  /*!< DMA0_EEI: EEI25 Position                */
#define DMA_EEI_EEI26_MASK                       (0x01UL << DMA_EEI_EEI26_SHIFT)                     /*!< DMA0_EEI: EEI26 Mask                    */
#define DMA_EEI_EEI26_SHIFT                      26                                                  /*!< DMA0_EEI: EEI26 Position                */
#define DMA_EEI_EEI27_MASK                       (0x01UL << DMA_EEI_EEI27_SHIFT)                     /*!< DMA0_EEI: EEI27 Mask                    */
#define DMA_EEI_EEI27_SHIFT                      27                                                  /*!< DMA0_EEI: EEI27 Position                */
#define DMA_EEI_EEI28_MASK                       (0x01UL << DMA_EEI_EEI28_SHIFT)                     /*!< DMA0_EEI: EEI28 Mask                    */
#define DMA_EEI_EEI28_SHIFT                      28                                                  /*!< DMA0_EEI: EEI28 Position                */
#define DMA_EEI_EEI29_MASK                       (0x01UL << DMA_EEI_EEI29_SHIFT)                     /*!< DMA0_EEI: EEI29 Mask                    */
#define DMA_EEI_EEI29_SHIFT                      29                                                  /*!< DMA0_EEI: EEI29 Position                */
#define DMA_EEI_EEI30_MASK                       (0x01UL << DMA_EEI_EEI30_SHIFT)                     /*!< DMA0_EEI: EEI30 Mask                    */
#define DMA_EEI_EEI30_SHIFT                      30                                                  /*!< DMA0_EEI: EEI30 Position                */
#define DMA_EEI_EEI31_MASK                       (0x01UL << DMA_EEI_EEI31_SHIFT)                     /*!< DMA0_EEI: EEI31 Mask                    */
#define DMA_EEI_EEI31_SHIFT                      31                                                  /*!< DMA0_EEI: EEI31 Position                */
/* ------- CEEI Bit Fields                          ------ */
#define DMA_CEEI_CEEI_MASK                       (0x1FUL << DMA_CEEI_CEEI_SHIFT)                     /*!< DMA0_CEEI: CEEI Mask                    */
#define DMA_CEEI_CEEI_SHIFT                      0                                                   /*!< DMA0_CEEI: CEEI Position                */
#define DMA_CEEI_CEEI(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CEEI_CEEI_SHIFT))&DMA_CEEI_CEEI_MASK) /*!< DMA0_CEEI                               */
#define DMA_CEEI_CAEE_MASK                       (0x01UL << DMA_CEEI_CAEE_SHIFT)                     /*!< DMA0_CEEI: CAEE Mask                    */
#define DMA_CEEI_CAEE_SHIFT                      6                                                   /*!< DMA0_CEEI: CAEE Position                */
#define DMA_CEEI_NOP_MASK                        (0x01UL << DMA_CEEI_NOP_SHIFT)                      /*!< DMA0_CEEI: NOP Mask                     */
#define DMA_CEEI_NOP_SHIFT                       7                                                   /*!< DMA0_CEEI: NOP Position                 */
/* ------- SEEI Bit Fields                          ------ */
#define DMA_SEEI_SEEI_MASK                       (0x1FUL << DMA_SEEI_SEEI_SHIFT)                     /*!< DMA0_SEEI: SEEI Mask                    */
#define DMA_SEEI_SEEI_SHIFT                      0                                                   /*!< DMA0_SEEI: SEEI Position                */
#define DMA_SEEI_SEEI(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SEEI_SEEI_SHIFT))&DMA_SEEI_SEEI_MASK) /*!< DMA0_SEEI                               */
#define DMA_SEEI_SAEE_MASK                       (0x01UL << DMA_SEEI_SAEE_SHIFT)                     /*!< DMA0_SEEI: SAEE Mask                    */
#define DMA_SEEI_SAEE_SHIFT                      6                                                   /*!< DMA0_SEEI: SAEE Position                */
#define DMA_SEEI_NOP_MASK                        (0x01UL << DMA_SEEI_NOP_SHIFT)                      /*!< DMA0_SEEI: NOP Mask                     */
#define DMA_SEEI_NOP_SHIFT                       7                                                   /*!< DMA0_SEEI: NOP Position                 */
/* ------- CERQ Bit Fields                          ------ */
#define DMA_CERQ_CERQ_MASK                       (0x1FUL << DMA_CERQ_CERQ_SHIFT)                     /*!< DMA0_CERQ: CERQ Mask                    */
#define DMA_CERQ_CERQ_SHIFT                      0                                                   /*!< DMA0_CERQ: CERQ Position                */
#define DMA_CERQ_CERQ(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CERQ_CERQ_SHIFT))&DMA_CERQ_CERQ_MASK) /*!< DMA0_CERQ                               */
#define DMA_CERQ_CAER_MASK                       (0x01UL << DMA_CERQ_CAER_SHIFT)                     /*!< DMA0_CERQ: CAER Mask                    */
#define DMA_CERQ_CAER_SHIFT                      6                                                   /*!< DMA0_CERQ: CAER Position                */
#define DMA_CERQ_NOP_MASK                        (0x01UL << DMA_CERQ_NOP_SHIFT)                      /*!< DMA0_CERQ: NOP Mask                     */
#define DMA_CERQ_NOP_SHIFT                       7                                                   /*!< DMA0_CERQ: NOP Position                 */
/* ------- SERQ Bit Fields                          ------ */
#define DMA_SERQ_SERQ_MASK                       (0x1FUL << DMA_SERQ_SERQ_SHIFT)                     /*!< DMA0_SERQ: SERQ Mask                    */
#define DMA_SERQ_SERQ_SHIFT                      0                                                   /*!< DMA0_SERQ: SERQ Position                */
#define DMA_SERQ_SERQ(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SERQ_SERQ_SHIFT))&DMA_SERQ_SERQ_MASK) /*!< DMA0_SERQ                               */
#define DMA_SERQ_SAER_MASK                       (0x01UL << DMA_SERQ_SAER_SHIFT)                     /*!< DMA0_SERQ: SAER Mask                    */
#define DMA_SERQ_SAER_SHIFT                      6                                                   /*!< DMA0_SERQ: SAER Position                */
#define DMA_SERQ_NOP_MASK                        (0x01UL << DMA_SERQ_NOP_SHIFT)                      /*!< DMA0_SERQ: NOP Mask                     */
#define DMA_SERQ_NOP_SHIFT                       7                                                   /*!< DMA0_SERQ: NOP Position                 */
/* ------- CDNE Bit Fields                          ------ */
#define DMA_CDNE_CDNE_MASK                       (0x1FUL << DMA_CDNE_CDNE_SHIFT)                     /*!< DMA0_CDNE: CDNE Mask                    */
#define DMA_CDNE_CDNE_SHIFT                      0                                                   /*!< DMA0_CDNE: CDNE Position                */
#define DMA_CDNE_CDNE(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CDNE_CDNE_SHIFT))&DMA_CDNE_CDNE_MASK) /*!< DMA0_CDNE                               */
#define DMA_CDNE_CADN_MASK                       (0x01UL << DMA_CDNE_CADN_SHIFT)                     /*!< DMA0_CDNE: CADN Mask                    */
#define DMA_CDNE_CADN_SHIFT                      6                                                   /*!< DMA0_CDNE: CADN Position                */
#define DMA_CDNE_NOP_MASK                        (0x01UL << DMA_CDNE_NOP_SHIFT)                      /*!< DMA0_CDNE: NOP Mask                     */
#define DMA_CDNE_NOP_SHIFT                       7                                                   /*!< DMA0_CDNE: NOP Position                 */
/* ------- SSRT Bit Fields                          ------ */
#define DMA_SSRT_SSRT_MASK                       (0x1FUL << DMA_SSRT_SSRT_SHIFT)                     /*!< DMA0_SSRT: SSRT Mask                    */
#define DMA_SSRT_SSRT_SHIFT                      0                                                   /*!< DMA0_SSRT: SSRT Position                */
#define DMA_SSRT_SSRT(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SSRT_SSRT_SHIFT))&DMA_SSRT_SSRT_MASK) /*!< DMA0_SSRT                               */
#define DMA_SSRT_SAST_MASK                       (0x01UL << DMA_SSRT_SAST_SHIFT)                     /*!< DMA0_SSRT: SAST Mask                    */
#define DMA_SSRT_SAST_SHIFT                      6                                                   /*!< DMA0_SSRT: SAST Position                */
#define DMA_SSRT_NOP_MASK                        (0x01UL << DMA_SSRT_NOP_SHIFT)                      /*!< DMA0_SSRT: NOP Mask                     */
#define DMA_SSRT_NOP_SHIFT                       7                                                   /*!< DMA0_SSRT: NOP Position                 */
/* ------- CERR Bit Fields                          ------ */
#define DMA_CERR_CERR_MASK                       (0x1FUL << DMA_CERR_CERR_SHIFT)                     /*!< DMA0_CERR: CERR Mask                    */
#define DMA_CERR_CERR_SHIFT                      0                                                   /*!< DMA0_CERR: CERR Position                */
#define DMA_CERR_CERR(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CERR_CERR_SHIFT))&DMA_CERR_CERR_MASK) /*!< DMA0_CERR                               */
#define DMA_CERR_CAEI_MASK                       (0x01UL << DMA_CERR_CAEI_SHIFT)                     /*!< DMA0_CERR: CAEI Mask                    */
#define DMA_CERR_CAEI_SHIFT                      6                                                   /*!< DMA0_CERR: CAEI Position                */
#define DMA_CERR_NOP_MASK                        (0x01UL << DMA_CERR_NOP_SHIFT)                      /*!< DMA0_CERR: NOP Mask                     */
#define DMA_CERR_NOP_SHIFT                       7                                                   /*!< DMA0_CERR: NOP Position                 */
/* ------- CINT Bit Fields                          ------ */
#define DMA_CINT_CINT_MASK                       (0x1FUL << DMA_CINT_CINT_SHIFT)                     /*!< DMA0_CINT: CINT Mask                    */
#define DMA_CINT_CINT_SHIFT                      0                                                   /*!< DMA0_CINT: CINT Position                */
#define DMA_CINT_CINT(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CINT_CINT_SHIFT))&DMA_CINT_CINT_MASK) /*!< DMA0_CINT                               */
#define DMA_CINT_CAIR_MASK                       (0x01UL << DMA_CINT_CAIR_SHIFT)                     /*!< DMA0_CINT: CAIR Mask                    */
#define DMA_CINT_CAIR_SHIFT                      6                                                   /*!< DMA0_CINT: CAIR Position                */
#define DMA_CINT_NOP_MASK                        (0x01UL << DMA_CINT_NOP_SHIFT)                      /*!< DMA0_CINT: NOP Mask                     */
#define DMA_CINT_NOP_SHIFT                       7                                                   /*!< DMA0_CINT: NOP Position                 */
/* ------- INT Bit Fields                           ------ */
#define DMA_INT_INT0_MASK                        (0x01UL << DMA_INT_INT0_SHIFT)                      /*!< DMA0_INT: INT0 Mask                     */
#define DMA_INT_INT0_SHIFT                       0                                                   /*!< DMA0_INT: INT0 Position                 */
#define DMA_INT_INT1_MASK                        (0x01UL << DMA_INT_INT1_SHIFT)                      /*!< DMA0_INT: INT1 Mask                     */
#define DMA_INT_INT1_SHIFT                       1                                                   /*!< DMA0_INT: INT1 Position                 */
#define DMA_INT_INT2_MASK                        (0x01UL << DMA_INT_INT2_SHIFT)                      /*!< DMA0_INT: INT2 Mask                     */
#define DMA_INT_INT2_SHIFT                       2                                                   /*!< DMA0_INT: INT2 Position                 */
#define DMA_INT_INT3_MASK                        (0x01UL << DMA_INT_INT3_SHIFT)                      /*!< DMA0_INT: INT3 Mask                     */
#define DMA_INT_INT3_SHIFT                       3                                                   /*!< DMA0_INT: INT3 Position                 */
#define DMA_INT_INT4_MASK                        (0x01UL << DMA_INT_INT4_SHIFT)                      /*!< DMA0_INT: INT4 Mask                     */
#define DMA_INT_INT4_SHIFT                       4                                                   /*!< DMA0_INT: INT4 Position                 */
#define DMA_INT_INT5_MASK                        (0x01UL << DMA_INT_INT5_SHIFT)                      /*!< DMA0_INT: INT5 Mask                     */
#define DMA_INT_INT5_SHIFT                       5                                                   /*!< DMA0_INT: INT5 Position                 */
#define DMA_INT_INT6_MASK                        (0x01UL << DMA_INT_INT6_SHIFT)                      /*!< DMA0_INT: INT6 Mask                     */
#define DMA_INT_INT6_SHIFT                       6                                                   /*!< DMA0_INT: INT6 Position                 */
#define DMA_INT_INT7_MASK                        (0x01UL << DMA_INT_INT7_SHIFT)                      /*!< DMA0_INT: INT7 Mask                     */
#define DMA_INT_INT7_SHIFT                       7                                                   /*!< DMA0_INT: INT7 Position                 */
#define DMA_INT_INT8_MASK                        (0x01UL << DMA_INT_INT8_SHIFT)                      /*!< DMA0_INT: INT8 Mask                     */
#define DMA_INT_INT8_SHIFT                       8                                                   /*!< DMA0_INT: INT8 Position                 */
#define DMA_INT_INT9_MASK                        (0x01UL << DMA_INT_INT9_SHIFT)                      /*!< DMA0_INT: INT9 Mask                     */
#define DMA_INT_INT9_SHIFT                       9                                                   /*!< DMA0_INT: INT9 Position                 */
#define DMA_INT_INT10_MASK                       (0x01UL << DMA_INT_INT10_SHIFT)                     /*!< DMA0_INT: INT10 Mask                    */
#define DMA_INT_INT10_SHIFT                      10                                                  /*!< DMA0_INT: INT10 Position                */
#define DMA_INT_INT11_MASK                       (0x01UL << DMA_INT_INT11_SHIFT)                     /*!< DMA0_INT: INT11 Mask                    */
#define DMA_INT_INT11_SHIFT                      11                                                  /*!< DMA0_INT: INT11 Position                */
#define DMA_INT_INT12_MASK                       (0x01UL << DMA_INT_INT12_SHIFT)                     /*!< DMA0_INT: INT12 Mask                    */
#define DMA_INT_INT12_SHIFT                      12                                                  /*!< DMA0_INT: INT12 Position                */
#define DMA_INT_INT13_MASK                       (0x01UL << DMA_INT_INT13_SHIFT)                     /*!< DMA0_INT: INT13 Mask                    */
#define DMA_INT_INT13_SHIFT                      13                                                  /*!< DMA0_INT: INT13 Position                */
#define DMA_INT_INT14_MASK                       (0x01UL << DMA_INT_INT14_SHIFT)                     /*!< DMA0_INT: INT14 Mask                    */
#define DMA_INT_INT14_SHIFT                      14                                                  /*!< DMA0_INT: INT14 Position                */
#define DMA_INT_INT15_MASK                       (0x01UL << DMA_INT_INT15_SHIFT)                     /*!< DMA0_INT: INT15 Mask                    */
#define DMA_INT_INT15_SHIFT                      15                                                  /*!< DMA0_INT: INT15 Position                */
#define DMA_INT_INT16_MASK                       (0x01UL << DMA_INT_INT16_SHIFT)                     /*!< DMA0_INT: INT16 Mask                    */
#define DMA_INT_INT16_SHIFT                      16                                                  /*!< DMA0_INT: INT16 Position                */
#define DMA_INT_INT17_MASK                       (0x01UL << DMA_INT_INT17_SHIFT)                     /*!< DMA0_INT: INT17 Mask                    */
#define DMA_INT_INT17_SHIFT                      17                                                  /*!< DMA0_INT: INT17 Position                */
#define DMA_INT_INT18_MASK                       (0x01UL << DMA_INT_INT18_SHIFT)                     /*!< DMA0_INT: INT18 Mask                    */
#define DMA_INT_INT18_SHIFT                      18                                                  /*!< DMA0_INT: INT18 Position                */
#define DMA_INT_INT19_MASK                       (0x01UL << DMA_INT_INT19_SHIFT)                     /*!< DMA0_INT: INT19 Mask                    */
#define DMA_INT_INT19_SHIFT                      19                                                  /*!< DMA0_INT: INT19 Position                */
#define DMA_INT_INT20_MASK                       (0x01UL << DMA_INT_INT20_SHIFT)                     /*!< DMA0_INT: INT20 Mask                    */
#define DMA_INT_INT20_SHIFT                      20                                                  /*!< DMA0_INT: INT20 Position                */
#define DMA_INT_INT21_MASK                       (0x01UL << DMA_INT_INT21_SHIFT)                     /*!< DMA0_INT: INT21 Mask                    */
#define DMA_INT_INT21_SHIFT                      21                                                  /*!< DMA0_INT: INT21 Position                */
#define DMA_INT_INT22_MASK                       (0x01UL << DMA_INT_INT22_SHIFT)                     /*!< DMA0_INT: INT22 Mask                    */
#define DMA_INT_INT22_SHIFT                      22                                                  /*!< DMA0_INT: INT22 Position                */
#define DMA_INT_INT23_MASK                       (0x01UL << DMA_INT_INT23_SHIFT)                     /*!< DMA0_INT: INT23 Mask                    */
#define DMA_INT_INT23_SHIFT                      23                                                  /*!< DMA0_INT: INT23 Position                */
#define DMA_INT_INT24_MASK                       (0x01UL << DMA_INT_INT24_SHIFT)                     /*!< DMA0_INT: INT24 Mask                    */
#define DMA_INT_INT24_SHIFT                      24                                                  /*!< DMA0_INT: INT24 Position                */
#define DMA_INT_INT25_MASK                       (0x01UL << DMA_INT_INT25_SHIFT)                     /*!< DMA0_INT: INT25 Mask                    */
#define DMA_INT_INT25_SHIFT                      25                                                  /*!< DMA0_INT: INT25 Position                */
#define DMA_INT_INT26_MASK                       (0x01UL << DMA_INT_INT26_SHIFT)                     /*!< DMA0_INT: INT26 Mask                    */
#define DMA_INT_INT26_SHIFT                      26                                                  /*!< DMA0_INT: INT26 Position                */
#define DMA_INT_INT27_MASK                       (0x01UL << DMA_INT_INT27_SHIFT)                     /*!< DMA0_INT: INT27 Mask                    */
#define DMA_INT_INT27_SHIFT                      27                                                  /*!< DMA0_INT: INT27 Position                */
#define DMA_INT_INT28_MASK                       (0x01UL << DMA_INT_INT28_SHIFT)                     /*!< DMA0_INT: INT28 Mask                    */
#define DMA_INT_INT28_SHIFT                      28                                                  /*!< DMA0_INT: INT28 Position                */
#define DMA_INT_INT29_MASK                       (0x01UL << DMA_INT_INT29_SHIFT)                     /*!< DMA0_INT: INT29 Mask                    */
#define DMA_INT_INT29_SHIFT                      29                                                  /*!< DMA0_INT: INT29 Position                */
#define DMA_INT_INT30_MASK                       (0x01UL << DMA_INT_INT30_SHIFT)                     /*!< DMA0_INT: INT30 Mask                    */
#define DMA_INT_INT30_SHIFT                      30                                                  /*!< DMA0_INT: INT30 Position                */
#define DMA_INT_INT31_MASK                       (0x01UL << DMA_INT_INT31_SHIFT)                     /*!< DMA0_INT: INT31 Mask                    */
#define DMA_INT_INT31_SHIFT                      31                                                  /*!< DMA0_INT: INT31 Position                */
/* ------- ERR Bit Fields                           ------ */
#define DMA_ERR_ERR0_MASK                        (0x01UL << DMA_ERR_ERR0_SHIFT)                      /*!< DMA0_ERR: ERR0 Mask                     */
#define DMA_ERR_ERR0_SHIFT                       0                                                   /*!< DMA0_ERR: ERR0 Position                 */
#define DMA_ERR_ERR1_MASK                        (0x01UL << DMA_ERR_ERR1_SHIFT)                      /*!< DMA0_ERR: ERR1 Mask                     */
#define DMA_ERR_ERR1_SHIFT                       1                                                   /*!< DMA0_ERR: ERR1 Position                 */
#define DMA_ERR_ERR2_MASK                        (0x01UL << DMA_ERR_ERR2_SHIFT)                      /*!< DMA0_ERR: ERR2 Mask                     */
#define DMA_ERR_ERR2_SHIFT                       2                                                   /*!< DMA0_ERR: ERR2 Position                 */
#define DMA_ERR_ERR3_MASK                        (0x01UL << DMA_ERR_ERR3_SHIFT)                      /*!< DMA0_ERR: ERR3 Mask                     */
#define DMA_ERR_ERR3_SHIFT                       3                                                   /*!< DMA0_ERR: ERR3 Position                 */
#define DMA_ERR_ERR4_MASK                        (0x01UL << DMA_ERR_ERR4_SHIFT)                      /*!< DMA0_ERR: ERR4 Mask                     */
#define DMA_ERR_ERR4_SHIFT                       4                                                   /*!< DMA0_ERR: ERR4 Position                 */
#define DMA_ERR_ERR5_MASK                        (0x01UL << DMA_ERR_ERR5_SHIFT)                      /*!< DMA0_ERR: ERR5 Mask                     */
#define DMA_ERR_ERR5_SHIFT                       5                                                   /*!< DMA0_ERR: ERR5 Position                 */
#define DMA_ERR_ERR6_MASK                        (0x01UL << DMA_ERR_ERR6_SHIFT)                      /*!< DMA0_ERR: ERR6 Mask                     */
#define DMA_ERR_ERR6_SHIFT                       6                                                   /*!< DMA0_ERR: ERR6 Position                 */
