podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define DMA_ERR_ERR7_MASK                        (0x01UL << DMA_ERR_ERR7_SHIFT)                      /*!< DMA0_ERR: ERR7 Mask                     */
#define DMA_ERR_ERR7_SHIFT                       7                                                   /*!< DMA0_ERR: ERR7 Position                 */
#define DMA_ERR_ERR8_MASK                        (0x01UL << DMA_ERR_ERR8_SHIFT)                      /*!< DMA0_ERR: ERR8 Mask                     */
#define DMA_ERR_ERR8_SHIFT                       8                                                   /*!< DMA0_ERR: ERR8 Position                 */
#define DMA_ERR_ERR9_MASK                        (0x01UL << DMA_ERR_ERR9_SHIFT)                      /*!< DMA0_ERR: ERR9 Mask                     */
#define DMA_ERR_ERR9_SHIFT                       9                                                   /*!< DMA0_ERR: ERR9 Position                 */
#define DMA_ERR_ERR10_MASK                       (0x01UL << DMA_ERR_ERR10_SHIFT)                     /*!< DMA0_ERR: ERR10 Mask                    */
#define DMA_ERR_ERR10_SHIFT                      10                                                  /*!< DMA0_ERR: ERR10 Position                */
#define DMA_ERR_ERR11_MASK                       (0x01UL << DMA_ERR_ERR11_SHIFT)                     /*!< DMA0_ERR: ERR11 Mask                    */
#define DMA_ERR_ERR11_SHIFT                      11                                                  /*!< DMA0_ERR: ERR11 Position                */
#define DMA_ERR_ERR12_MASK                       (0x01UL << DMA_ERR_ERR12_SHIFT)                     /*!< DMA0_ERR: ERR12 Mask                    */
#define DMA_ERR_ERR12_SHIFT                      12                                                  /*!< DMA0_ERR: ERR12 Position                */
#define DMA_ERR_ERR13_MASK                       (0x01UL << DMA_ERR_ERR13_SHIFT)                     /*!< DMA0_ERR: ERR13 Mask                    */
#define DMA_ERR_ERR13_SHIFT                      13                                                  /*!< DMA0_ERR: ERR13 Position                */
#define DMA_ERR_ERR14_MASK                       (0x01UL << DMA_ERR_ERR14_SHIFT)                     /*!< DMA0_ERR: ERR14 Mask                    */
#define DMA_ERR_ERR14_SHIFT                      14                                                  /*!< DMA0_ERR: ERR14 Position                */
#define DMA_ERR_ERR15_MASK                       (0x01UL << DMA_ERR_ERR15_SHIFT)                     /*!< DMA0_ERR: ERR15 Mask                    */
#define DMA_ERR_ERR15_SHIFT                      15                                                  /*!< DMA0_ERR: ERR15 Position                */
#define DMA_ERR_ERR16_MASK                       (0x01UL << DMA_ERR_ERR16_SHIFT)                     /*!< DMA0_ERR: ERR16 Mask                    */
#define DMA_ERR_ERR16_SHIFT                      16                                                  /*!< DMA0_ERR: ERR16 Position                */
#define DMA_ERR_ERR17_MASK                       (0x01UL << DMA_ERR_ERR17_SHIFT)                     /*!< DMA0_ERR: ERR17 Mask                    */
#define DMA_ERR_ERR17_SHIFT                      17                                                  /*!< DMA0_ERR: ERR17 Position                */
#define DMA_ERR_ERR18_MASK                       (0x01UL << DMA_ERR_ERR18_SHIFT)                     /*!< DMA0_ERR: ERR18 Mask                    */
#define DMA_ERR_ERR18_SHIFT                      18                                                  /*!< DMA0_ERR: ERR18 Position                */
#define DMA_ERR_ERR19_MASK                       (0x01UL << DMA_ERR_ERR19_SHIFT)                     /*!< DMA0_ERR: ERR19 Mask                    */
#define DMA_ERR_ERR19_SHIFT                      19                                                  /*!< DMA0_ERR: ERR19 Position                */
#define DMA_ERR_ERR20_MASK                       (0x01UL << DMA_ERR_ERR20_SHIFT)                     /*!< DMA0_ERR: ERR20 Mask                    */
#define DMA_ERR_ERR20_SHIFT                      20                                                  /*!< DMA0_ERR: ERR20 Position                */
#define DMA_ERR_ERR21_MASK                       (0x01UL << DMA_ERR_ERR21_SHIFT)                     /*!< DMA0_ERR: ERR21 Mask                    */
#define DMA_ERR_ERR21_SHIFT                      21                                                  /*!< DMA0_ERR: ERR21 Position                */
#define DMA_ERR_ERR22_MASK                       (0x01UL << DMA_ERR_ERR22_SHIFT)                     /*!< DMA0_ERR: ERR22 Mask                    */
#define DMA_ERR_ERR22_SHIFT                      22                                                  /*!< DMA0_ERR: ERR22 Position                */
#define DMA_ERR_ERR23_MASK                       (0x01UL << DMA_ERR_ERR23_SHIFT)                     /*!< DMA0_ERR: ERR23 Mask                    */
#define DMA_ERR_ERR23_SHIFT                      23                                                  /*!< DMA0_ERR: ERR23 Position                */
#define DMA_ERR_ERR24_MASK                       (0x01UL << DMA_ERR_ERR24_SHIFT)                     /*!< DMA0_ERR: ERR24 Mask                    */
#define DMA_ERR_ERR24_SHIFT                      24                                                  /*!< DMA0_ERR: ERR24 Position                */
#define DMA_ERR_ERR25_MASK                       (0x01UL << DMA_ERR_ERR25_SHIFT)                     /*!< DMA0_ERR: ERR25 Mask                    */
#define DMA_ERR_ERR25_SHIFT                      25                                                  /*!< DMA0_ERR: ERR25 Position                */
#define DMA_ERR_ERR26_MASK                       (0x01UL << DMA_ERR_ERR26_SHIFT)                     /*!< DMA0_ERR: ERR26 Mask                    */
#define DMA_ERR_ERR26_SHIFT                      26                                                  /*!< DMA0_ERR: ERR26 Position                */
#define DMA_ERR_ERR27_MASK                       (0x01UL << DMA_ERR_ERR27_SHIFT)                     /*!< DMA0_ERR: ERR27 Mask                    */
#define DMA_ERR_ERR27_SHIFT                      27                                                  /*!< DMA0_ERR: ERR27 Position                */
#define DMA_ERR_ERR28_MASK                       (0x01UL << DMA_ERR_ERR28_SHIFT)                     /*!< DMA0_ERR: ERR28 Mask                    */
#define DMA_ERR_ERR28_SHIFT                      28                                                  /*!< DMA0_ERR: ERR28 Position                */
#define DMA_ERR_ERR29_MASK                       (0x01UL << DMA_ERR_ERR29_SHIFT)                     /*!< DMA0_ERR: ERR29 Mask                    */
#define DMA_ERR_ERR29_SHIFT                      29                                                  /*!< DMA0_ERR: ERR29 Position                */
#define DMA_ERR_ERR30_MASK                       (0x01UL << DMA_ERR_ERR30_SHIFT)                     /*!< DMA0_ERR: ERR30 Mask                    */
#define DMA_ERR_ERR30_SHIFT                      30                                                  /*!< DMA0_ERR: ERR30 Position                */
#define DMA_ERR_ERR31_MASK                       (0x01UL << DMA_ERR_ERR31_SHIFT)                     /*!< DMA0_ERR: ERR31 Mask                    */
#define DMA_ERR_ERR31_SHIFT                      31                                                  /*!< DMA0_ERR: ERR31 Position                */
/* ------- HRS Bit Fields                           ------ */
#define DMA_HRS_HRS0_MASK                        (0x01UL << DMA_HRS_HRS0_SHIFT)                      /*!< DMA0_HRS: HRS0 Mask                     */
#define DMA_HRS_HRS0_SHIFT                       0                                                   /*!< DMA0_HRS: HRS0 Position                 */
#define DMA_HRS_HRS1_MASK                        (0x01UL << DMA_HRS_HRS1_SHIFT)                      /*!< DMA0_HRS: HRS1 Mask                     */
#define DMA_HRS_HRS1_SHIFT                       1                                                   /*!< DMA0_HRS: HRS1 Position                 */
#define DMA_HRS_HRS2_MASK                        (0x01UL << DMA_HRS_HRS2_SHIFT)                      /*!< DMA0_HRS: HRS2 Mask                     */
#define DMA_HRS_HRS2_SHIFT                       2                                                   /*!< DMA0_HRS: HRS2 Position                 */
#define DMA_HRS_HRS3_MASK                        (0x01UL << DMA_HRS_HRS3_SHIFT)                      /*!< DMA0_HRS: HRS3 Mask                     */
#define DMA_HRS_HRS3_SHIFT                       3                                                   /*!< DMA0_HRS: HRS3 Position                 */
#define DMA_HRS_HRS4_MASK                        (0x01UL << DMA_HRS_HRS4_SHIFT)                      /*!< DMA0_HRS: HRS4 Mask                     */
#define DMA_HRS_HRS4_SHIFT                       4                                                   /*!< DMA0_HRS: HRS4 Position                 */
#define DMA_HRS_HRS5_MASK                        (0x01UL << DMA_HRS_HRS5_SHIFT)                      /*!< DMA0_HRS: HRS5 Mask                     */
#define DMA_HRS_HRS5_SHIFT                       5                                                   /*!< DMA0_HRS: HRS5 Position                 */
#define DMA_HRS_HRS6_MASK                        (0x01UL << DMA_HRS_HRS6_SHIFT)                      /*!< DMA0_HRS: HRS6 Mask                     */
#define DMA_HRS_HRS6_SHIFT                       6                                                   /*!< DMA0_HRS: HRS6 Position                 */
#define DMA_HRS_HRS7_MASK                        (0x01UL << DMA_HRS_HRS7_SHIFT)                      /*!< DMA0_HRS: HRS7 Mask                     */
#define DMA_HRS_HRS7_SHIFT                       7                                                   /*!< DMA0_HRS: HRS7 Position                 */
#define DMA_HRS_HRS8_MASK                        (0x01UL << DMA_HRS_HRS8_SHIFT)                      /*!< DMA0_HRS: HRS8 Mask                     */
#define DMA_HRS_HRS8_SHIFT                       8                                                   /*!< DMA0_HRS: HRS8 Position                 */
#define DMA_HRS_HRS9_MASK                        (0x01UL << DMA_HRS_HRS9_SHIFT)                      /*!< DMA0_HRS: HRS9 Mask                     */
#define DMA_HRS_HRS9_SHIFT                       9                                                   /*!< DMA0_HRS: HRS9 Position                 */
#define DMA_HRS_HRS10_MASK                       (0x01UL << DMA_HRS_HRS10_SHIFT)                     /*!< DMA0_HRS: HRS10 Mask                    */
#define DMA_HRS_HRS10_SHIFT                      10                                                  /*!< DMA0_HRS: HRS10 Position                */
#define DMA_HRS_HRS11_MASK                       (0x01UL << DMA_HRS_HRS11_SHIFT)                     /*!< DMA0_HRS: HRS11 Mask                    */
#define DMA_HRS_HRS11_SHIFT                      11                                                  /*!< DMA0_HRS: HRS11 Position                */
#define DMA_HRS_HRS12_MASK                       (0x01UL << DMA_HRS_HRS12_SHIFT)                     /*!< DMA0_HRS: HRS12 Mask                    */
#define DMA_HRS_HRS12_SHIFT                      12                                                  /*!< DMA0_HRS: HRS12 Position                */
#define DMA_HRS_HRS13_MASK                       (0x01UL << DMA_HRS_HRS13_SHIFT)                     /*!< DMA0_HRS: HRS13 Mask                    */
#define DMA_HRS_HRS13_SHIFT                      13                                                  /*!< DMA0_HRS: HRS13 Position                */
#define DMA_HRS_HRS14_MASK                       (0x01UL << DMA_HRS_HRS14_SHIFT)                     /*!< DMA0_HRS: HRS14 Mask                    */
#define DMA_HRS_HRS14_SHIFT                      14                                                  /*!< DMA0_HRS: HRS14 Position                */
#define DMA_HRS_HRS15_MASK                       (0x01UL << DMA_HRS_HRS15_SHIFT)                     /*!< DMA0_HRS: HRS15 Mask                    */
#define DMA_HRS_HRS15_SHIFT                      15                                                  /*!< DMA0_HRS: HRS15 Position                */
#define DMA_HRS_HRS16_MASK                       (0x01UL << DMA_HRS_HRS16_SHIFT)                     /*!< DMA0_HRS: HRS16 Mask                    */
#define DMA_HRS_HRS16_SHIFT                      16                                                  /*!< DMA0_HRS: HRS16 Position                */
#define DMA_HRS_HRS17_MASK                       (0x01UL << DMA_HRS_HRS17_SHIFT)                     /*!< DMA0_HRS: HRS17 Mask                    */
#define DMA_HRS_HRS17_SHIFT                      17                                                  /*!< DMA0_HRS: HRS17 Position                */
#define DMA_HRS_HRS18_MASK                       (0x01UL << DMA_HRS_HRS18_SHIFT)                     /*!< DMA0_HRS: HRS18 Mask                    */
#define DMA_HRS_HRS18_SHIFT                      18                                                  /*!< DMA0_HRS: HRS18 Position                */
#define DMA_HRS_HRS19_MASK                       (0x01UL << DMA_HRS_HRS19_SHIFT)                     /*!< DMA0_HRS: HRS19 Mask                    */
#define DMA_HRS_HRS19_SHIFT                      19                                                  /*!< DMA0_HRS: HRS19 Position                */
#define DMA_HRS_HRS20_MASK                       (0x01UL << DMA_HRS_HRS20_SHIFT)                     /*!< DMA0_HRS: HRS20 Mask                    */
#define DMA_HRS_HRS20_SHIFT                      20                                                  /*!< DMA0_HRS: HRS20 Position                */
#define DMA_HRS_HRS21_MASK                       (0x01UL << DMA_HRS_HRS21_SHIFT)                     /*!< DMA0_HRS: HRS21 Mask                    */
#define DMA_HRS_HRS21_SHIFT                      21                                                  /*!< DMA0_HRS: HRS21 Position                */
#define DMA_HRS_HRS22_MASK                       (0x01UL << DMA_HRS_HRS22_SHIFT)                     /*!< DMA0_HRS: HRS22 Mask                    */
#define DMA_HRS_HRS22_SHIFT                      22                                                  /*!< DMA0_HRS: HRS22 Position                */
#define DMA_HRS_HRS23_MASK                       (0x01UL << DMA_HRS_HRS23_SHIFT)                     /*!< DMA0_HRS: HRS23 Mask                    */
#define DMA_HRS_HRS23_SHIFT                      23                                                  /*!< DMA0_HRS: HRS23 Position                */
#define DMA_HRS_HRS24_MASK                       (0x01UL << DMA_HRS_HRS24_SHIFT)                     /*!< DMA0_HRS: HRS24 Mask                    */
#define DMA_HRS_HRS24_SHIFT                      24                                                  /*!< DMA0_HRS: HRS24 Position                */
#define DMA_HRS_HRS25_MASK                       (0x01UL << DMA_HRS_HRS25_SHIFT)                     /*!< DMA0_HRS: HRS25 Mask                    */
#define DMA_HRS_HRS25_SHIFT                      25                                                  /*!< DMA0_HRS: HRS25 Position                */
#define DMA_HRS_HRS26_MASK                       (0x01UL << DMA_HRS_HRS26_SHIFT)                     /*!< DMA0_HRS: HRS26 Mask                    */
#define DMA_HRS_HRS26_SHIFT                      26                                                  /*!< DMA0_HRS: HRS26 Position                */
#define DMA_HRS_HRS27_MASK                       (0x01UL << DMA_HRS_HRS27_SHIFT)                     /*!< DMA0_HRS: HRS27 Mask                    */
#define DMA_HRS_HRS27_SHIFT                      27                                                  /*!< DMA0_HRS: HRS27 Position                */
#define DMA_HRS_HRS28_MASK                       (0x01UL << DMA_HRS_HRS28_SHIFT)                     /*!< DMA0_HRS: HRS28 Mask                    */
#define DMA_HRS_HRS28_SHIFT                      28                                                  /*!< DMA0_HRS: HRS28 Position                */
#define DMA_HRS_HRS29_MASK                       (0x01UL << DMA_HRS_HRS29_SHIFT)                     /*!< DMA0_HRS: HRS29 Mask                    */
#define DMA_HRS_HRS29_SHIFT                      29                                                  /*!< DMA0_HRS: HRS29 Position                */
#define DMA_HRS_HRS30_MASK                       (0x01UL << DMA_HRS_HRS30_SHIFT)                     /*!< DMA0_HRS: HRS30 Mask                    */
#define DMA_HRS_HRS30_SHIFT                      30                                                  /*!< DMA0_HRS: HRS30 Position                */
#define DMA_HRS_HRS31_MASK                       (0x01UL << DMA_HRS_HRS31_SHIFT)                     /*!< DMA0_HRS: HRS31 Mask                    */
#define DMA_HRS_HRS31_SHIFT                      31                                                  /*!< DMA0_HRS: HRS31 Position                */
/* ------- DCHPRI Bit Fields                        ------ */
#define DMA_DCHPRI_CHPRI_MASK                    (0x0FUL << DMA_DCHPRI_CHPRI_SHIFT)                  /*!< DMA0_DCHPRI: CHPRI Mask                 */
#define DMA_DCHPRI_CHPRI_SHIFT                   0                                                   /*!< DMA0_DCHPRI: CHPRI Position             */
#define DMA_DCHPRI_CHPRI(x)                      (((uint8_t)(((uint8_t)(x))<<DMA_DCHPRI_CHPRI_SHIFT))&DMA_DCHPRI_CHPRI_MASK) /*!< DMA0_DCHPRI                             */
#define DMA_DCHPRI_GRPPRI_MASK                   (0x03UL << DMA_DCHPRI_GRPPRI_SHIFT)                 /*!< DMA0_DCHPRI: GRPPRI Mask                */
#define DMA_DCHPRI_GRPPRI_SHIFT                  4                                                   /*!< DMA0_DCHPRI: GRPPRI Position            */
#define DMA_DCHPRI_GRPPRI(x)                     (((uint8_t)(((uint8_t)(x))<<DMA_DCHPRI_GRPPRI_SHIFT))&DMA_DCHPRI_GRPPRI_MASK) /*!< DMA0_DCHPRI                             */
#define DMA_DCHPRI_DPA_MASK                      (0x01UL << DMA_DCHPRI_DPA_SHIFT)                    /*!< DMA0_DCHPRI: DPA Mask                   */
#define DMA_DCHPRI_DPA_SHIFT                     6                                                   /*!< DMA0_DCHPRI: DPA Position               */
#define DMA_DCHPRI_ECP_MASK                      (0x01UL << DMA_DCHPRI_ECP_SHIFT)                    /*!< DMA0_DCHPRI: ECP Mask                   */
#define DMA_DCHPRI_ECP_SHIFT                     7                                                   /*!< DMA0_DCHPRI: ECP Position               */
/* ------- SADDR Bit Fields                         ------ */
#define DMA_SADDR_SADDR_MASK                     (0xFFFFFFFFUL << DMA_SADDR_SADDR_SHIFT)             /*!< DMA0_SADDR: SADDR Mask                  */
#define DMA_SADDR_SADDR_SHIFT                    0                                                   /*!< DMA0_SADDR: SADDR Position              */
#define DMA_SADDR_SADDR(x)                       (((uint32_t)(((uint32_t)(x))<<DMA_SADDR_SADDR_SHIFT))&DMA_SADDR_SADDR_MASK) /*!< DMA0_SADDR                              */
/* ------- SOFF Bit Fields                          ------ */
#define DMA_SOFF_SOFF_MASK                       (0xFFFFUL << DMA_SOFF_SOFF_SHIFT)                   /*!< DMA0_SOFF: SOFF Mask                    */
#define DMA_SOFF_SOFF_SHIFT                      0                                                   /*!< DMA0_SOFF: SOFF Position                */
#define DMA_SOFF_SOFF(x)                         (((uint16_t)(((uint16_t)(x))<<DMA_SOFF_SOFF_SHIFT))&DMA_SOFF_SOFF_MASK) /*!< DMA0_SOFF                               */
/* ------- ATTR Bit Fields                          ------ */
#define DMA_ATTR_DSIZE_MASK                      (0x07UL << DMA_ATTR_DSIZE_SHIFT)                    /*!< DMA0_ATTR: DSIZE Mask                   */
#define DMA_ATTR_DSIZE_SHIFT                     0                                                   /*!< DMA0_ATTR: DSIZE Position               */
#define DMA_ATTR_DSIZE(x)                        (((uint16_t)(((uint16_t)(x))<<DMA_ATTR_DSIZE_SHIFT))&DMA_ATTR_DSIZE_MASK) /*!< DMA0_ATTR                               */
#define DMA_ATTR_DMOD_MASK                       (0x1FUL << DMA_ATTR_DMOD_SHIFT)                     /*!< DMA0_ATTR: DMOD Mask                    */
#define DMA_ATTR_DMOD_SHIFT                      3                                                   /*!< DMA0_ATTR: DMOD Position                */
#define DMA_ATTR_DMOD(x)                         (((uint16_t)(((uint16_t)(x))<<DMA_ATTR_DMOD_SHIFT))&DMA_ATTR_DMOD_MASK) /*!< DMA0_ATTR                               */
#define DMA_ATTR_SSIZE_MASK                      (0x07UL << DMA_ATTR_SSIZE_SHIFT)                    /*!< DMA0_ATTR: SSIZE Mask                   */
#define DMA_ATTR_SSIZE_SHIFT                     8                                                   /*!< DMA0_ATTR: SSIZE Position               */
#define DMA_ATTR_SSIZE(x)                        (((uint16_t)(((uint16_t)(x))<<DMA_ATTR_SSIZE_SHIFT))&DMA_ATTR_SSIZE_MASK) /*!< DMA0_ATTR                               */
#define DMA_ATTR_SMOD_MASK                       (0x1FUL << DMA_ATTR_SMOD_SHIFT)                     /*!< DMA0_ATTR: SMOD Mask                    */
#define DMA_ATTR_SMOD_SHIFT                      11                                                  /*!< DMA0_ATTR: SMOD Position                */
#define DMA_ATTR_SMOD(x)                         (((uint16_t)(((uint16_t)(x))<<DMA_ATTR_SMOD_SHIFT))&DMA_ATTR_SMOD_MASK) /*!< DMA0_ATTR                               */
/* ------- NBYTES_MLNO Bit Fields                   ------ */
#define DMA_NBYTES_MLNO_NBYTES_MASK              (0xFFFFFFFFUL << DMA_NBYTES_MLNO_NBYTES_SHIFT)      /*!< DMA0_NBYTES_MLNO: NBYTES Mask           */
#define DMA_NBYTES_MLNO_NBYTES_SHIFT             0                                                   /*!< DMA0_NBYTES_MLNO: NBYTES Position       */
#define DMA_NBYTES_MLNO_NBYTES(x)                (((uint32_t)(((uint32_t)(x))<<DMA_NBYTES_MLNO_NBYTES_SHIFT))&DMA_NBYTES_MLNO_NBYTES_MASK) /*!< DMA0_NBYTES_MLNO                        */
/* ------- NBYTES_MLOFFNO Bit Fields                ------ */
#define DMA_NBYTES_MLOFFNO_NBYTES_MASK           (0x3FFFFFFFUL << DMA_NBYTES_MLOFFNO_NBYTES_SHIFT)   /*!< DMA0_NBYTES_MLOFFNO: NBYTES Mask        */
#define DMA_NBYTES_MLOFFNO_NBYTES_SHIFT          0                                                   /*!< DMA0_NBYTES_MLOFFNO: NBYTES Position    */
#define DMA_NBYTES_MLOFFNO_NBYTES(x)             (((uint32_t)(((uint32_t)(x))<<DMA_NBYTES_MLOFFNO_NBYTES_SHIFT))&DMA_NBYTES_MLOFFNO_NBYTES_MASK) /*!< DMA0_NBYTES_MLOFFNO                     */
#define DMA_NBYTES_MLOFFNO_DMLOE_MASK            (0x01UL << DMA_NBYTES_MLOFFNO_DMLOE_SHIFT)          /*!< DMA0_NBYTES_MLOFFNO: DMLOE Mask         */
#define DMA_NBYTES_MLOFFNO_DMLOE_SHIFT           30                                                  /*!< DMA0_NBYTES_MLOFFNO: DMLOE Position     */
#define DMA_NBYTES_MLOFFNO_SMLOE_MASK            (0x01UL << DMA_NBYTES_MLOFFNO_SMLOE_SHIFT)          /*!< DMA0_NBYTES_MLOFFNO: SMLOE Mask         */
#define DMA_NBYTES_MLOFFNO_SMLOE_SHIFT           31                                                  /*!< DMA0_NBYTES_MLOFFNO: SMLOE Position     */
/* ------- NBYTES_MLOFFYES Bit Fields               ------ */
#define DMA_NBYTES_MLOFFYES_NBYTES_MASK          (0x3FFUL << DMA_NBYTES_MLOFFYES_NBYTES_SHIFT)       /*!< DMA0_NBYTES_MLOFFYES: NBYTES Mask       */
#define DMA_NBYTES_MLOFFYES_NBYTES_SHIFT         0                                                   /*!< DMA0_NBYTES_MLOFFYES: NBYTES Position   */
#define DMA_NBYTES_MLOFFYES_NBYTES(x)            (((uint32_t)(((uint32_t)(x))<<DMA_NBYTES_MLOFFYES_NBYTES_SHIFT))&DMA_NBYTES_MLOFFYES_NBYTES_MASK) /*!< DMA0_NBYTES_MLOFFYES                    */
