podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup DRY_Register_Masks_GROUP DRY Register Masks
* @brief Register Masks for DRY
* @{
*/
/* ------- SKVR Bit Fields                          ------ */
#define DRY_SKVR_SKV_MASK                        (0xFFUL << DRY_SKVR_SKV_SHIFT)                      /*!< DRY_SKVR: SKV Mask                      */
#define DRY_SKVR_SKV_SHIFT                       0                                                   /*!< DRY_SKVR: SKV Position                  */
#define DRY_SKVR_SKV(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_SKVR_SKV_SHIFT))&DRY_SKVR_SKV_MASK) /*!< DRY_SKVR                                */
/* ------- SKWLR Bit Fields                         ------ */
#define DRY_SKWLR_SKWL_MASK                      (0xFFUL << DRY_SKWLR_SKWL_SHIFT)                    /*!< DRY_SKWLR: SKWL Mask                    */
#define DRY_SKWLR_SKWL_SHIFT                     0                                                   /*!< DRY_SKWLR: SKWL Position                */
#define DRY_SKWLR_SKWL(x)                        (((uint32_t)(((uint32_t)(x))<<DRY_SKWLR_SKWL_SHIFT))&DRY_SKWLR_SKWL_MASK) /*!< DRY_SKWLR                               */
/* ------- SKRLR Bit Fields                         ------ */
#define DRY_SKRLR_SKRL_MASK                      (0xFFUL << DRY_SKRLR_SKRL_SHIFT)                    /*!< DRY_SKRLR: SKRL Mask                    */
#define DRY_SKRLR_SKRL_SHIFT                     0                                                   /*!< DRY_SKRLR: SKRL Position                */
#define DRY_SKRLR_SKRL(x)                        (((uint32_t)(((uint32_t)(x))<<DRY_SKRLR_SKRL_SHIFT))&DRY_SKRLR_SKRL_MASK) /*!< DRY_SKRLR                               */
/* ------- CR Bit Fields                            ------ */
#define DRY_CR_SWR_MASK                          (0x01UL << DRY_CR_SWR_SHIFT)                        /*!< DRY_CR: SWR Mask                        */
#define DRY_CR_SWR_SHIFT                         0                                                   /*!< DRY_CR: SWR Position                    */
#define DRY_CR_DEN_MASK                          (0x01UL << DRY_CR_DEN_SHIFT)                        /*!< DRY_CR: DEN Mask                        */
#define DRY_CR_DEN_SHIFT                         1                                                   /*!< DRY_CR: DEN Position                    */
#define DRY_CR_TFSR_MASK                         (0x01UL << DRY_CR_TFSR_SHIFT)                       /*!< DRY_CR: TFSR Mask                       */
#define DRY_CR_TFSR_SHIFT                        2                                                   /*!< DRY_CR: TFSR Position                   */
#define DRY_CR_UM_MASK                           (0x01UL << DRY_CR_UM_SHIFT)                         /*!< DRY_CR: UM Mask                         */
#define DRY_CR_UM_SHIFT                          3                                                   /*!< DRY_CR: UM Position                     */
#define DRY_CR_THYS_MASK                         (0x01UL << DRY_CR_THYS_SHIFT)                       /*!< DRY_CR: THYS Mask                       */
#define DRY_CR_THYS_SHIFT                        8                                                   /*!< DRY_CR: THYS Position                   */
#define DRY_CR_TPFE_MASK                         (0x01UL << DRY_CR_TPFE_SHIFT)                       /*!< DRY_CR: TPFE Mask                       */
#define DRY_CR_TPFE_SHIFT                        9                                                   /*!< DRY_CR: TPFE Position                   */
#define DRY_CR_TDSE_MASK                         (0x01UL << DRY_CR_TDSE_SHIFT)                       /*!< DRY_CR: TDSE Mask                       */
#define DRY_CR_TDSE_SHIFT                        10                                                  /*!< DRY_CR: TDSE Position                   */
#define DRY_CR_TSRE_MASK                         (0x01UL << DRY_CR_TSRE_SHIFT)                       /*!< DRY_CR: TSRE Mask                       */
#define DRY_CR_TSRE_SHIFT                        11                                                  /*!< DRY_CR: TSRE Position                   */
#define DRY_CR_DPR_MASK                          (0x7FFFUL << DRY_CR_DPR_SHIFT)                      /*!< DRY_CR: DPR Mask                        */
#define DRY_CR_DPR_SHIFT                         17                                                  /*!< DRY_CR: DPR Position                    */
#define DRY_CR_DPR(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_CR_DPR_SHIFT))&DRY_CR_DPR_MASK) /*!< DRY_CR                                  */
/* ------- SR Bit Fields                            ------ */
#define DRY_SR_DTF_MASK                          (0x01UL << DRY_SR_DTF_SHIFT)                        /*!< DRY_SR: DTF Mask                        */
#define DRY_SR_DTF_SHIFT                         0                                                   /*!< DRY_SR: DTF Position                    */
#define DRY_SR_TAF_MASK                          (0x01UL << DRY_SR_TAF_SHIFT)                        /*!< DRY_SR: TAF Mask                        */
#define DRY_SR_TAF_SHIFT                         1                                                   /*!< DRY_SR: TAF Position                    */
#define DRY_SR_TOF_MASK                          (0x01UL << DRY_SR_TOF_SHIFT)                        /*!< DRY_SR: TOF Mask                        */
#define DRY_SR_TOF_SHIFT                         2                                                   /*!< DRY_SR: TOF Position                    */
#define DRY_SR_MOF_MASK                          (0x01UL << DRY_SR_MOF_SHIFT)                        /*!< DRY_SR: MOF Mask                        */
#define DRY_SR_MOF_SHIFT                         3                                                   /*!< DRY_SR: MOF Position                    */
#define DRY_SR_VTF_MASK                          (0x01UL << DRY_SR_VTF_SHIFT)                        /*!< DRY_SR: VTF Mask                        */
#define DRY_SR_VTF_SHIFT                         4                                                   /*!< DRY_SR: VTF Position                    */
#define DRY_SR_CTF_MASK                          (0x01UL << DRY_SR_CTF_SHIFT)                        /*!< DRY_SR: CTF Mask                        */
#define DRY_SR_CTF_SHIFT                         5                                                   /*!< DRY_SR: CTF Position                    */
#define DRY_SR_TTF_MASK                          (0x01UL << DRY_SR_TTF_SHIFT)                        /*!< DRY_SR: TTF Mask                        */
#define DRY_SR_TTF_SHIFT                         6                                                   /*!< DRY_SR: TTF Position                    */
#define DRY_SR_STF_MASK                          (0x01UL << DRY_SR_STF_SHIFT)                        /*!< DRY_SR: STF Mask                        */
#define DRY_SR_STF_SHIFT                         7                                                   /*!< DRY_SR: STF Position                    */
#define DRY_SR_FSF_MASK                          (0x01UL << DRY_SR_FSF_SHIFT)                        /*!< DRY_SR: FSF Mask                        */
#define DRY_SR_FSF_SHIFT                         8                                                   /*!< DRY_SR: FSF Position                    */
#define DRY_SR_TMF_MASK                          (0x01UL << DRY_SR_TMF_SHIFT)                        /*!< DRY_SR: TMF Mask                        */
#define DRY_SR_TMF_SHIFT                         9                                                   /*!< DRY_SR: TMF Position                    */
#define DRY_SR_TPF_MASK                          (0xFFUL << DRY_SR_TPF_SHIFT)                        /*!< DRY_SR: TPF Mask                        */
#define DRY_SR_TPF_SHIFT                         16                                                  /*!< DRY_SR: TPF Position                    */
#define DRY_SR_TPF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_TPF_SHIFT))&DRY_SR_TPF_MASK) /*!< DRY_SR                                  */
/* ------- LR Bit Fields                            ------ */
#define DRY_LR_KVL_MASK                          (0x01UL << DRY_LR_KVL_SHIFT)                        /*!< DRY_LR: KVL Mask                        */
#define DRY_LR_KVL_SHIFT                         1                                                   /*!< DRY_LR: KVL Position                    */
#define DRY_LR_KWL_MASK                          (0x01UL << DRY_LR_KWL_SHIFT)                        /*!< DRY_LR: KWL Mask                        */
#define DRY_LR_KWL_SHIFT                         2                                                   /*!< DRY_LR: KWL Position                    */
#define DRY_LR_KRL_MASK                          (0x01UL << DRY_LR_KRL_SHIFT)                        /*!< DRY_LR: KRL Mask                        */
#define DRY_LR_KRL_SHIFT                         3                                                   /*!< DRY_LR: KRL Position                    */
#define DRY_LR_CRL_MASK                          (0x01UL << DRY_LR_CRL_SHIFT)                        /*!< DRY_LR: CRL Mask                        */
#define DRY_LR_CRL_SHIFT                         4                                                   /*!< DRY_LR: CRL Position                    */
#define DRY_LR_SRL_MASK                          (0x01UL << DRY_LR_SRL_SHIFT)                        /*!< DRY_LR: SRL Mask                        */
#define DRY_LR_SRL_SHIFT                         5                                                   /*!< DRY_LR: SRL Position                    */
#define DRY_LR_LRL_MASK                          (0x01UL << DRY_LR_LRL_SHIFT)                        /*!< DRY_LR: LRL Mask                        */
#define DRY_LR_LRL_SHIFT                         6                                                   /*!< DRY_LR: LRL Position                    */
#define DRY_LR_IEL_MASK                          (0x01UL << DRY_LR_IEL_SHIFT)                        /*!< DRY_LR: IEL Mask                        */
#define DRY_LR_IEL_SHIFT                         7                                                   /*!< DRY_LR: IEL Position                    */
#define DRY_LR_TSL_MASK                          (0x01UL << DRY_LR_TSL_SHIFT)                        /*!< DRY_LR: TSL Mask                        */
#define DRY_LR_TSL_SHIFT                         8                                                   /*!< DRY_LR: TSL Position                    */
#define DRY_LR_TEL_MASK                          (0x01UL << DRY_LR_TEL_SHIFT)                        /*!< DRY_LR: TEL Mask                        */
#define DRY_LR_TEL_SHIFT                         9                                                   /*!< DRY_LR: TEL Position                    */
#define DRY_LR_PDL_MASK                          (0x01UL << DRY_LR_PDL_SHIFT)                        /*!< DRY_LR: PDL Mask                        */
#define DRY_LR_PDL_SHIFT                         10                                                  /*!< DRY_LR: PDL Position                    */
#define DRY_LR_PPL_MASK                          (0x01UL << DRY_LR_PPL_SHIFT)                        /*!< DRY_LR: PPL Mask                        */
#define DRY_LR_PPL_SHIFT                         11                                                  /*!< DRY_LR: PPL Position                    */
#define DRY_LR_ATL_MASK                          (0x03UL << DRY_LR_ATL_SHIFT)                        /*!< DRY_LR: ATL Mask                        */
#define DRY_LR_ATL_SHIFT                         12                                                  /*!< DRY_LR: ATL Position                    */
#define DRY_LR_ATL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_ATL_SHIFT))&DRY_LR_ATL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_GFL_MASK                          (0xFFUL << DRY_LR_GFL_SHIFT)                        /*!< DRY_LR: GFL Mask                        */
#define DRY_LR_GFL_SHIFT                         16                                                  /*!< DRY_LR: GFL Position                    */
#define DRY_LR_GFL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_GFL_SHIFT))&DRY_LR_GFL_MASK) /*!< DRY_LR                                  */
/* ------- IER Bit Fields                           ------ */
#define DRY_IER_DTIE_MASK                        (0x01UL << DRY_IER_DTIE_SHIFT)                      /*!< DRY_IER: DTIE Mask                      */
#define DRY_IER_DTIE_SHIFT                       0                                                   /*!< DRY_IER: DTIE Position                  */
#define DRY_IER_TOIE_MASK                        (0x01UL << DRY_IER_TOIE_SHIFT)                      /*!< DRY_IER: TOIE Mask                      */
#define DRY_IER_TOIE_SHIFT                       2                                                   /*!< DRY_IER: TOIE Position                  */
#define DRY_IER_MOIE_MASK                        (0x01UL << DRY_IER_MOIE_SHIFT)                      /*!< DRY_IER: MOIE Mask                      */
#define DRY_IER_MOIE_SHIFT                       3                                                   /*!< DRY_IER: MOIE Position                  */
#define DRY_IER_VTIE_MASK                        (0x01UL << DRY_IER_VTIE_SHIFT)                      /*!< DRY_IER: VTIE Mask                      */
#define DRY_IER_VTIE_SHIFT                       4                                                   /*!< DRY_IER: VTIE Position                  */
#define DRY_IER_CTIE_MASK                        (0x01UL << DRY_IER_CTIE_SHIFT)                      /*!< DRY_IER: CTIE Mask                      */
#define DRY_IER_CTIE_SHIFT                       5                                                   /*!< DRY_IER: CTIE Position                  */
#define DRY_IER_TTIE_MASK                        (0x01UL << DRY_IER_TTIE_SHIFT)                      /*!< DRY_IER: TTIE Mask                      */
#define DRY_IER_TTIE_SHIFT                       6                                                   /*!< DRY_IER: TTIE Position                  */
#define DRY_IER_STIE_MASK                        (0x01UL << DRY_IER_STIE_SHIFT)                      /*!< DRY_IER: STIE Mask                      */
#define DRY_IER_STIE_SHIFT                       7                                                   /*!< DRY_IER: STIE Position                  */
#define DRY_IER_FSIE_MASK                        (0x01UL << DRY_IER_FSIE_SHIFT)                      /*!< DRY_IER: FSIE Mask                      */
#define DRY_IER_FSIE_SHIFT                       8                                                   /*!< DRY_IER: FSIE Position                  */
#define DRY_IER_TMIE_MASK                        (0x01UL << DRY_IER_TMIE_SHIFT)                      /*!< DRY_IER: TMIE Mask                      */
#define DRY_IER_TMIE_SHIFT                       9                                                   /*!< DRY_IER: TMIE Position                  */
#define DRY_IER_TPIE_MASK                        (0xFFUL << DRY_IER_TPIE_SHIFT)                      /*!< DRY_IER: TPIE Mask                      */
#define DRY_IER_TPIE_SHIFT                       16                                                  /*!< DRY_IER: TPIE Position                  */
#define DRY_IER_TPIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_TPIE_SHIFT))&DRY_IER_TPIE_MASK) /*!< DRY_IER                                 */
/* ------- TSR Bit Fields                           ------ */
#define DRY_TSR_TTS_MASK                         (0xFFFFFFFFUL << DRY_TSR_TTS_SHIFT)                 /*!< DRY_TSR: TTS Mask                       */
#define DRY_TSR_TTS_SHIFT                        0                                                   /*!< DRY_TSR: TTS Position                   */
#define DRY_TSR_TTS(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TSR_TTS_SHIFT))&DRY_TSR_TTS_MASK) /*!< DRY_TSR                                 */
/* ------- TER Bit Fields                           ------ */
#define DRY_TER_TOE_MASK                         (0x01UL << DRY_TER_TOE_SHIFT)                       /*!< DRY_TER: TOE Mask                       */
#define DRY_TER_TOE_SHIFT                        2                                                   /*!< DRY_TER: TOE Position                   */
#define DRY_TER_MOE_MASK                         (0x01UL << DRY_TER_MOE_SHIFT)                       /*!< DRY_TER: MOE Mask                       */
#define DRY_TER_MOE_SHIFT                        3                                                   /*!< DRY_TER: MOE Position                   */
#define DRY_TER_VTE_MASK                         (0x01UL << DRY_TER_VTE_SHIFT)                       /*!< DRY_TER: VTE Mask                       */
#define DRY_TER_VTE_SHIFT                        4                                                   /*!< DRY_TER: VTE Position                   */
#define DRY_TER_CTE_MASK                         (0x01UL << DRY_TER_CTE_SHIFT)                       /*!< DRY_TER: CTE Mask                       */
#define DRY_TER_CTE_SHIFT                        5                                                   /*!< DRY_TER: CTE Position                   */
#define DRY_TER_TTE_MASK                         (0x01UL << DRY_TER_TTE_SHIFT)                       /*!< DRY_TER: TTE Mask                       */
#define DRY_TER_TTE_SHIFT                        6                                                   /*!< DRY_TER: TTE Position                   */
#define DRY_TER_STE_MASK                         (0x01UL << DRY_TER_STE_SHIFT)                       /*!< DRY_TER: STE Mask                       */
#define DRY_TER_STE_SHIFT                        7                                                   /*!< DRY_TER: STE Position                   */
#define DRY_TER_FSE_MASK                         (0x01UL << DRY_TER_FSE_SHIFT)                       /*!< DRY_TER: FSE Mask                       */
#define DRY_TER_FSE_SHIFT                        8                                                   /*!< DRY_TER: FSE Position                   */
#define DRY_TER_TME_MASK                         (0x01UL << DRY_TER_TME_SHIFT)                       /*!< DRY_TER: TME Mask                       */
#define DRY_TER_TME_SHIFT                        9                                                   /*!< DRY_TER: TME Position                   */
#define DRY_TER_TPE_MASK                         (0xFFUL << DRY_TER_TPE_SHIFT)                       /*!< DRY_TER: TPE Mask                       */
#define DRY_TER_TPE_SHIFT                        16                                                  /*!< DRY_TER: TPE Position                   */
#define DRY_TER_TPE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_TPE_SHIFT))&DRY_TER_TPE_MASK) /*!< DRY_TER                                 */
/* ------- PDR Bit Fields                           ------ */
#define DRY_PDR_TPD_MASK                         (0xFFUL << DRY_PDR_TPD_SHIFT)                       /*!< DRY_PDR: TPD Mask                       */
#define DRY_PDR_TPD_SHIFT                        0                                                   /*!< DRY_PDR: TPD Position                   */
#define DRY_PDR_TPD(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_PDR_TPD_SHIFT))&DRY_PDR_TPD_MASK) /*!< DRY_PDR                                 */
#define DRY_PDR_TPOD_MASK                        (0xFFUL << DRY_PDR_TPOD_SHIFT)                      /*!< DRY_PDR: TPOD Mask                      */
#define DRY_PDR_TPOD_SHIFT                       16                                                  /*!< DRY_PDR: TPOD Position                  */
#define DRY_PDR_TPOD(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PDR_TPOD_SHIFT))&DRY_PDR_TPOD_MASK) /*!< DRY_PDR                                 */
/* ------- PPR Bit Fields                           ------ */
#define DRY_PPR_TPP_MASK                         (0xFFUL << DRY_PPR_TPP_SHIFT)                       /*!< DRY_PPR: TPP Mask                       */
#define DRY_PPR_TPP_SHIFT                        0                                                   /*!< DRY_PPR: TPP Position                   */
#define DRY_PPR_TPP(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_PPR_TPP_SHIFT))&DRY_PPR_TPP_MASK) /*!< DRY_PPR                                 */
#define DRY_PPR_TPID_MASK                        (0xFFUL << DRY_PPR_TPID_SHIFT)                      /*!< DRY_PPR: TPID Mask                      */
#define DRY_PPR_TPID_SHIFT                       16                                                  /*!< DRY_PPR: TPID Position                  */
#define DRY_PPR_TPID(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PPR_TPID_SHIFT))&DRY_PPR_TPID_MASK) /*!< DRY_PPR                                 */
/* ------- ATR Bit Fields                           ------ */
#define DRY_ATR_ATSR_MASK                        (0xFFFFUL << DRY_ATR_ATSR_SHIFT)                    /*!< DRY_ATR: ATSR Mask                      */
#define DRY_ATR_ATSR_SHIFT                       0                                                   /*!< DRY_ATR: ATSR Position                  */
#define DRY_ATR_ATSR(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_ATR_ATSR_SHIFT))&DRY_ATR_ATSR_MASK) /*!< DRY_ATR                                 */
#define DRY_ATR_ATP_MASK                         (0xFFFFUL << DRY_ATR_ATP_SHIFT)                     /*!< DRY_ATR: ATP Mask                       */
#define DRY_ATR_ATP_SHIFT                        16                                                  /*!< DRY_ATR: ATP Position                   */
#define DRY_ATR_ATP(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_ATR_ATP_SHIFT))&DRY_ATR_ATP_MASK) /*!< DRY_ATR                                 */
/* ------- PGFR Bit Fields                          ------ */
#define DRY_PGFR_GFW_MASK                        (0x3FUL << DRY_PGFR_GFW_SHIFT)                      /*!< DRY_PGFR: GFW Mask                      */
#define DRY_PGFR_GFW_SHIFT                       0                                                   /*!< DRY_PGFR: GFW Position                  */
#define DRY_PGFR_GFW(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_GFW_SHIFT))&DRY_PGFR_GFW_MASK) /*!< DRY_PGFR                                */
#define DRY_PGFR_GFP_MASK                        (0x01UL << DRY_PGFR_GFP_SHIFT)                      /*!< DRY_PGFR: GFP Mask                      */
#define DRY_PGFR_GFP_SHIFT                       6                                                   /*!< DRY_PGFR: GFP Position                  */
#define DRY_PGFR_GFE_MASK                        (0x01UL << DRY_PGFR_GFE_SHIFT)                      /*!< DRY_PGFR: GFE Mask                      */
#define DRY_PGFR_GFE_SHIFT                       7                                                   /*!< DRY_PGFR: GFE Position                  */
#define DRY_PGFR_TPEX_MASK                       (0x03UL << DRY_PGFR_TPEX_SHIFT)                     /*!< DRY_PGFR: TPEX Mask                     */
#define DRY_PGFR_TPEX_SHIFT                      16                                                  /*!< DRY_PGFR: TPEX Position                 */
#define DRY_PGFR_TPEX(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_TPEX_SHIFT))&DRY_PGFR_TPEX_MASK) /*!< DRY_PGFR                                */
#define DRY_PGFR_TPE_MASK                        (0x01UL << DRY_PGFR_TPE_SHIFT)                      /*!< DRY_PGFR: TPE Mask                      */
#define DRY_PGFR_TPE_SHIFT                       24                                                  /*!< DRY_PGFR: TPE Position                  */
/* ------- WAC Bit Fields                           ------ */
