podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define DRY_WAC_SKVW_MASK                        (0x01UL << DRY_WAC_SKVW_SHIFT)                      /*!< DRY_WAC: SKVW Mask                      */
#define DRY_WAC_SKVW_SHIFT                       1                                                   /*!< DRY_WAC: SKVW Position                  */
#define DRY_WAC_SKWRW_MASK                       (0x01UL << DRY_WAC_SKWRW_SHIFT)                     /*!< DRY_WAC: SKWRW Mask                     */
#define DRY_WAC_SKWRW_SHIFT                      2                                                   /*!< DRY_WAC: SKWRW Position                 */
#define DRY_WAC_SKRRW_MASK                       (0x01UL << DRY_WAC_SKRRW_SHIFT)                     /*!< DRY_WAC: SKRRW Mask                     */
#define DRY_WAC_SKRRW_SHIFT                      3                                                   /*!< DRY_WAC: SKRRW Position                 */
#define DRY_WAC_CRW_MASK                         (0x01UL << DRY_WAC_CRW_SHIFT)                       /*!< DRY_WAC: CRW Mask                       */
#define DRY_WAC_CRW_SHIFT                        4                                                   /*!< DRY_WAC: CRW Position                   */
#define DRY_WAC_SRW_MASK                         (0x01UL << DRY_WAC_SRW_SHIFT)                       /*!< DRY_WAC: SRW Mask                       */
#define DRY_WAC_SRW_SHIFT                        5                                                   /*!< DRY_WAC: SRW Position                   */
#define DRY_WAC_LRW_MASK                         (0x01UL << DRY_WAC_LRW_SHIFT)                       /*!< DRY_WAC: LRW Mask                       */
#define DRY_WAC_LRW_SHIFT                        6                                                   /*!< DRY_WAC: LRW Position                   */
#define DRY_WAC_IEW_MASK                         (0x01UL << DRY_WAC_IEW_SHIFT)                       /*!< DRY_WAC: IEW Mask                       */
#define DRY_WAC_IEW_SHIFT                        7                                                   /*!< DRY_WAC: IEW Position                   */
#define DRY_WAC_TSRW_MASK                        (0x01UL << DRY_WAC_TSRW_SHIFT)                      /*!< DRY_WAC: TSRW Mask                      */
#define DRY_WAC_TSRW_SHIFT                       8                                                   /*!< DRY_WAC: TSRW Position                  */
#define DRY_WAC_TEW_MASK                         (0x01UL << DRY_WAC_TEW_SHIFT)                       /*!< DRY_WAC: TEW Mask                       */
#define DRY_WAC_TEW_SHIFT                        9                                                   /*!< DRY_WAC: TEW Position                   */
#define DRY_WAC_PDW_MASK                         (0x01UL << DRY_WAC_PDW_SHIFT)                       /*!< DRY_WAC: PDW Mask                       */
#define DRY_WAC_PDW_SHIFT                        10                                                  /*!< DRY_WAC: PDW Position                   */
#define DRY_WAC_PPW_MASK                         (0x01UL << DRY_WAC_PPW_SHIFT)                       /*!< DRY_WAC: PPW Mask                       */
#define DRY_WAC_PPW_SHIFT                        11                                                  /*!< DRY_WAC: PPW Position                   */
#define DRY_WAC_ATW_MASK                         (0x03UL << DRY_WAC_ATW_SHIFT)                       /*!< DRY_WAC: ATW Mask                       */
#define DRY_WAC_ATW_SHIFT                        12                                                  /*!< DRY_WAC: ATW Position                   */
#define DRY_WAC_ATW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_ATW_SHIFT))&DRY_WAC_ATW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_GFW_MASK                         (0xFFUL << DRY_WAC_GFW_SHIFT)                       /*!< DRY_WAC: GFW Mask                       */
#define DRY_WAC_GFW_SHIFT                        16                                                  /*!< DRY_WAC: GFW Position                   */
#define DRY_WAC_GFW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_GFW_SHIFT))&DRY_WAC_GFW_MASK) /*!< DRY_WAC                                 */
/* ------- RAC Bit Fields                           ------ */
#define DRY_RAC_SKVR_MASK                        (0x01UL << DRY_RAC_SKVR_SHIFT)                      /*!< DRY_RAC: SKVR Mask                      */
#define DRY_RAC_SKVR_SHIFT                       1                                                   /*!< DRY_RAC: SKVR Position                  */
#define DRY_RAC_SKWRR_MASK                       (0x01UL << DRY_RAC_SKWRR_SHIFT)                     /*!< DRY_RAC: SKWRR Mask                     */
#define DRY_RAC_SKWRR_SHIFT                      2                                                   /*!< DRY_RAC: SKWRR Position                 */
#define DRY_RAC_SKRRR_MASK                       (0x01UL << DRY_RAC_SKRRR_SHIFT)                     /*!< DRY_RAC: SKRRR Mask                     */
#define DRY_RAC_SKRRR_SHIFT                      3                                                   /*!< DRY_RAC: SKRRR Position                 */
#define DRY_RAC_CRR_MASK                         (0x01UL << DRY_RAC_CRR_SHIFT)                       /*!< DRY_RAC: CRR Mask                       */
#define DRY_RAC_CRR_SHIFT                        4                                                   /*!< DRY_RAC: CRR Position                   */
#define DRY_RAC_SRR_MASK                         (0x01UL << DRY_RAC_SRR_SHIFT)                       /*!< DRY_RAC: SRR Mask                       */
#define DRY_RAC_SRR_SHIFT                        5                                                   /*!< DRY_RAC: SRR Position                   */
#define DRY_RAC_LRR_MASK                         (0x01UL << DRY_RAC_LRR_SHIFT)                       /*!< DRY_RAC: LRR Mask                       */
#define DRY_RAC_LRR_SHIFT                        6                                                   /*!< DRY_RAC: LRR Position                   */
#define DRY_RAC_IER_MASK                         (0x01UL << DRY_RAC_IER_SHIFT)                       /*!< DRY_RAC: IER Mask                       */
#define DRY_RAC_IER_SHIFT                        7                                                   /*!< DRY_RAC: IER Position                   */
#define DRY_RAC_TSRR_MASK                        (0x01UL << DRY_RAC_TSRR_SHIFT)                      /*!< DRY_RAC: TSRR Mask                      */
#define DRY_RAC_TSRR_SHIFT                       8                                                   /*!< DRY_RAC: TSRR Position                  */
#define DRY_RAC_TER_MASK                         (0x01UL << DRY_RAC_TER_SHIFT)                       /*!< DRY_RAC: TER Mask                       */
#define DRY_RAC_TER_SHIFT                        9                                                   /*!< DRY_RAC: TER Position                   */
#define DRY_RAC_PDR_MASK                         (0x01UL << DRY_RAC_PDR_SHIFT)                       /*!< DRY_RAC: PDR Mask                       */
#define DRY_RAC_PDR_SHIFT                        10                                                  /*!< DRY_RAC: PDR Position                   */
#define DRY_RAC_PPR_MASK                         (0x01UL << DRY_RAC_PPR_SHIFT)                       /*!< DRY_RAC: PPR Mask                       */
#define DRY_RAC_PPR_SHIFT                        11                                                  /*!< DRY_RAC: PPR Position                   */
#define DRY_RAC_ATR_MASK                         (0x03UL << DRY_RAC_ATR_SHIFT)                       /*!< DRY_RAC: ATR Mask                       */
#define DRY_RAC_ATR_SHIFT                        12                                                  /*!< DRY_RAC: ATR Position                   */
#define DRY_RAC_ATR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_ATR_SHIFT))&DRY_RAC_ATR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_GFR_MASK                         (0xFFUL << DRY_RAC_GFR_SHIFT)                       /*!< DRY_RAC: GFR Mask                       */
#define DRY_RAC_GFR_SHIFT                        16                                                  /*!< DRY_RAC: GFR Position                   */
#define DRY_RAC_GFR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_GFR_SHIFT))&DRY_RAC_GFR_MASK) /*!< DRY_RAC                                 */
/* ------- SKR Bit Fields                           ------ */
#define DRY_SKR_SK_MASK                          (0xFFFFFFFFUL << DRY_SKR_SK_SHIFT)                  /*!< DRY_SKR: SK Mask                        */
#define DRY_SKR_SK_SHIFT                         0                                                   /*!< DRY_SKR: SK Position                    */
#define DRY_SKR_SK(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SKR_SK_SHIFT))&DRY_SKR_SK_MASK) /*!< DRY_SKR                                 */
/* ------- SWAC Bit Fields                          ------ */
#define DRY_SWAC_SKRW_MASK                       (0xFFUL << DRY_SWAC_SKRW_SHIFT)                     /*!< DRY_SWAC: SKRW Mask                     */
#define DRY_SWAC_SKRW_SHIFT                      0                                                   /*!< DRY_SWAC: SKRW Position                 */
#define DRY_SWAC_SKRW(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_SWAC_SKRW_SHIFT))&DRY_SWAC_SKRW_MASK) /*!< DRY_SWAC                                */
/* ------- SRAC Bit Fields                          ------ */
#define DRY_SRAC_SKRR_MASK                       (0xFFUL << DRY_SRAC_SKRR_SHIFT)                     /*!< DRY_SRAC: SKRR Mask                     */
#define DRY_SRAC_SKRR_SHIFT                      0                                                   /*!< DRY_SRAC: SKRR Position                 */
#define DRY_SRAC_SKRR(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_SRAC_SKRR_SHIFT))&DRY_SRAC_SKRR_MASK) /*!< DRY_SRAC                                */
/**
 * @} */ /* End group DRY_Register_Masks_GROUP 
 */

/* DRY - Peripheral instance base addresses */
#define DRY_BasePtr                    0x40042000UL //!< Peripheral base address
#define DRY                            ((DRY_Type *) DRY_BasePtr) //!< Freescale base pointer
#define DRY_BASE_PTR                   (DRY) //!< Freescale style base pointer
/**
 * @} */ /* End group DRY_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup ENET_Peripheral_access_layer_GROUP ENET Peripheral Access Layer
* @brief C Struct for ENET
* @{
*/

/* ================================================================================ */
/* ================           ENET (file:ENET_B)                   ================ */
/* ================================================================================ */

