podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
 * @brief Ethernet MAC-NET Core
 */
/**
* @addtogroup ENET_structs_GROUP ENET struct
* @brief Struct for ENET
* @{
*/
typedef struct {                                /*       ENET Structure                                               */
   __I  uint32_t  RESERVED0;                   
   __IO uint32_t  EIR;                          /**< 0004: Interrupt Event Register                                     */
   __IO uint32_t  EIMR;                         /**< 0008: Interrupt Mask Register                                      */
   __I  uint32_t  RESERVED1;                   
   __IO uint32_t  RDAR;                         /**< 0010: Receive Descriptor Active Register                           */
   __IO uint32_t  TDAR;                         /**< 0014: Transmit Descriptor Active Register                          */
   __I  uint32_t  RESERVED2[3];                
   __IO uint32_t  ECR;                          /**< 0024: Ethernet Control Register                                    */
   __I  uint32_t  RESERVED3[6];                
   __IO uint32_t  MMFR;                         /**< 0040: MII Management Frame Register                                */
   __IO uint32_t  MSCR;                         /**< 0044: MII Speed Control Register                                   */
   __I  uint32_t  RESERVED4[7];                
   __IO uint32_t  MIBC;                         /**< 0064: MIB Control Register                                         */
   __I  uint32_t  RESERVED5[7];                
   __IO uint32_t  RCR;                          /**< 0084: Receive Control Register                                     */
   __I  uint32_t  RESERVED6[15];               
   __IO uint32_t  TCR;                          /**< 00C4: Transmit Control Register                                    */
   __I  uint32_t  RESERVED7[7];                
   __IO uint32_t  PALR;                         /**< 00E4: Physical Address Lower Register                              */
   __IO uint32_t  PAUR;                         /**< 00E8: Physical Address Upper Register                              */
   __IO uint32_t  OPD;                          /**< 00EC: Opcode/Pause Duration Register                               */
   __I  uint32_t  RESERVED8[10];               
   __IO uint32_t  IAUR;                         /**< 0118: Descriptor Individual Upper Address Register                 */
   __IO uint32_t  IALR;                         /**< 011C: Descriptor Individual Lower Address Register                 */
   __IO uint32_t  GAUR;                         /**< 0120: Descriptor Group Upper Address Register                      */
   __IO uint32_t  GALR;                         /**< 0124: Descriptor Group Lower Address Register                      */
   __I  uint32_t  RESERVED9[7];                
   __IO uint32_t  TFWR;                         /**< 0144: Transmit FIFO Watermark Register                             */
   __I  uint32_t  RESERVED10[14];              
   __IO uint32_t  RDSR;                         /**< 0180: Receive Descriptor Ring Start Register                       */
   __IO uint32_t  TDSR;                         /**< 0184: Transmit Buffer Descriptor Ring Start Register               */
   __IO uint32_t  MRBR;                         /**< 0188: Maximum Receive Buffer Size Register                         */
   __I  uint32_t  RESERVED11;                  
   __IO uint32_t  RSFL;                         /**< 0190: Receive FIFO Section Full Threshold                          */
   __IO uint32_t  RSEM;                         /**< 0194: Receive FIFO Section Empty Threshold                         */
   __IO uint32_t  RAEM;                         /**< 0198: Receive FIFO Almost Empty Threshold                          */
   __IO uint32_t  RAFL;                         /**< 019C: Receive FIFO Almost Full Threshold                           */
   __IO uint32_t  TSEM;                         /**< 01A0: Transmit FIFO Section Empty Threshold                        */
   __IO uint32_t  TAEM;                         /**< 01A4: Transmit FIFO Almost Empty Threshold                         */
   __IO uint32_t  TAFL;                         /**< 01A8: Transmit FIFO Almost Full Threshold                          */
   __IO uint32_t  TIPG;                         /**< 01AC: Transmit Inter-Packet Gap                                    */
   __IO uint32_t  FTRL;                         /**< 01B0: Frame Truncation Length                                      */
   __I  uint32_t  RESERVED12[3];               
   __IO uint32_t  TACC;                         /**< 01C0: Transmit Accelerator Function Configuration                  */
   __IO uint32_t  RACC;                         /**< 01C4: Receive Accelerator Function Configuration                   */
   __I  uint32_t  RESERVED13[14];              
   __IO uint32_t  RMON_T_DROP;                  /**< 0200: Count of frames not counted correctly (RMON_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable */
   __IO uint32_t  RMON_T_PACKETS;               /**< 0204: RMON Tx packet count (RMON_T_PACKETS)                        */
   __IO uint32_t  RMON_T_BC_PKT;                /**< 0208: RMON Tx Broadcast Packets (RMON_T_BC_PKT)                    */
   __IO uint32_t  RMON_T_MC_PKT;                /**< 020C: RMON Tx Multicast Packets (RMON_T_MC_PKT)                    */
   __IO uint32_t  RMON_T_CRC_ALIGN;             /**< 0210: RMON Tx Packets w CRC/Align error (RMON_T_CRC_ALIGN)         */
   __IO uint32_t  RMON_T_UNDERSIZE;             /**< 0214: RMON Tx Packets < 64 bytes, good CRC (RMON_T_UNDERSIZE)      */
   __IO uint32_t  RMON_T_OVERSIZE;              /**< 0218: RMON Tx Packets > MAX_FL bytes, good CRC (RMON_T_OVERSIZE)   */
   __IO uint32_t  RMON_T_FRAG;                  /**< 021C: RMON Tx Packets < 64 bytes, bad CRC (RMON_T_FRAG)            */
   __IO uint32_t  RMON_T_JAB;                   /**< 0220: RMON Tx Packets > MAX_FL bytes, bad CRC (RMON_T_JAB)         */
   __IO uint32_t  RMON_T_COL;                   /**< 0224: RMON Tx collision count (RMON_T_COL)                         */
   __IO uint32_t  RMON_T_P64;                   /**< 0228: RMON Tx 64 byte packets (RMON_T_P64)                         */
   __IO uint32_t  RMON_T_P65TO127;              /**< 022C: RMON Tx 65 to 127 byte packets (RMON_T_P65TO127)             */
   __IO uint32_t  RMON_T_P128TO255;             /**< 0230: RMON Tx 128 to 255 byte packets (RMON_T_P128TO255)           */
   __IO uint32_t  RMON_T_P256TO511;             /**< 0234: RMON Tx 256 to 511 byte packets (RMON_T_P256TO511)           */
   __IO uint32_t  RMON_T_P512TO1023;            /**< 0238: RMON Tx 512 to 1023 byte packets (RMON_T_P512TO1023)         */
   __IO uint32_t  RMON_T_P1024TO2047;           /**< 023C: RMON Tx 1024 to 2047 byte packets (RMON_T_P1024TO2047)       */
   __IO uint32_t  RMON_T_P_GTE2048;             /**< 0240: RMON Tx packets w > 2048 bytes (RMON_T_P_GTE2048)            */
   __IO uint32_t  RMON_T_OCTETS;                /**< 0244: RMON Tx Octets (RMON_T_OCTETS)                               */
   __IO uint32_t  IEEE_T_DROP;                  /**< 0248: Count of frames not counted correctly (IEEE_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable */
   __IO uint32_t  IEEE_T_FRAME_OK;              /**< 024C: Frames Transmitted OK (IEEE_T_FRAME_OK)                      */
   __IO uint32_t  IEEE_T_1COL;                  /**< 0250: Frames Transmitted with Single Collision (IEEE_T_1COL)       */
   __IO uint32_t  IEEE_T_MCOL;                  /**< 0254: Frames Transmitted with Multiple Collisions (IEEE_T_MCOL)    */
   __IO uint32_t  IEEE_T_DEF;                   /**< 0258: Frames Transmitted after Deferral Delay (IEEE_T_DEF)         */
   __IO uint32_t  IEEE_T_LCOL;                  /**< 025C: Frames Transmitted with Late Collision (IEEE_T_LCOL)         */
   __IO uint32_t  IEEE_T_EXCOL;                 /**< 0260: Frames Transmitted with Excessive Collisions (IEEE_T_EXCOL)  */
   __IO uint32_t  IEEE_T_MACERR;                /**< 0264: Frames Transmitted with Tx FIFO Underrun (IEEE_T_MACERR)     */
   __IO uint32_t  IEEE_T_CSERR;                 /**< 0268: Frames Transmitted with Carrier Sense Error (IEEE_T_CSERR)   */
   __IO uint32_t  IEEE_T_SQE;                   /**< 026C: Frames Transmitted with SQE Error (IEEE_T_SQE). NOTE: Counter not implemented (read 0 always) as no SQE information is available */
   __IO uint32_t  IEEE_T_FDXFC;                 /**< 0270: Flow Control Pause frames transmitted (IEEE_T_FDXFC)         */
   __IO uint32_t  IEEE_T_OCTETS_OK;             /**< 0274: Octet count for Frames Transmitted w/o Error (IEEE_T_OCTETS_OK). NOTE: Counts total octets (includes header and FCS fields) */
   __I  uint32_t  RESERVED14[3];               
   __IO uint32_t  RMON_R_PACKETS;               /**< 0284: RMON Rx packet count (RMON_R_PACKETS)                        */
   __IO uint32_t  RMON_R_BC_PKT;                /**< 0288: RMON Rx Broadcast Packets (RMON_R_BC_PKT)                    */
   __IO uint32_t  RMON_R_MC_PKT;                /**< 028C: RMON Rx Multicast Packets (RMON_R_MC_PKT)                    */
   __IO uint32_t  RMON_R_CRC_ALIGN;             /**< 0290: RMON Rx Packets w CRC/Align error (RMON_R_CRC_ALIGN)         */
   __IO uint32_t  RMON_R_UNDERSIZE;             /**< 0294: RMON Rx Packets < 64 bytes, good CRC (RMON_R_UNDERSIZE)      */
   __IO uint32_t  RMON_R_OVERSIZE;              /**< 0298: RMON Rx Packets > MAX_FL bytes, good CRC (RMON_R_OVERSIZE)   */
   __IO uint32_t  RMON_R_FRAG;                  /**< 029C: RMON Rx Packets < 64 bytes, bad CRC (RMON_R_FRAG)            */
   __IO uint32_t  RMON_R_JAB;                   /**< 02A0: RMON Rx Packets > MAX_FL bytes, bad CRC (RMON_R_JAB)         */
   __IO uint32_t  RMON_R_RESVD_0;               /**< 02A4: Reserved (RMON_R_RESVD_0)                                    */
   __IO uint32_t  RMON_R_P64;                   /**< 02A8: RMON Rx 64 byte packets (RMON_R_P64)                         */
   __IO uint32_t  RMON_R_P65TO127;              /**< 02AC: RMON Rx 65 to 127 byte packets (RMON_R_P65TO127)             */
   __IO uint32_t  RMON_R_P128TO255;             /**< 02B0: RMON Rx 128 to 255 byte packets (RMON_R_P128TO255)           */
   __IO uint32_t  RMON_R_P256TO511;             /**< 02B4: RMON Rx 256 to 511 byte packets (RMON_R_P256TO511)           */
   __IO uint32_t  RMON_R_P512TO1023;            /**< 02B8: RMON Rx 512 to 1023 byte packets (RMON_R_P512TO1023)         */
   __IO uint32_t  RMON_R_P1024TO2047;           /**< 02BC: RMON Rx 1024 to 2047 byte packets (RMON_R_P1024TO2047)       */
   __IO uint32_t  RMON_R_P_GTE2048;             /**< 02C0: RMON Rx packets w > 2048 bytes (RMON_R_P_GTE2048)            */
   __IO uint32_t  RMON_R_OCTETS;                /**< 02C4: RMON Rx Octets (RMON_R_OCTETS)                               */
   __IO uint32_t  IEEE_R_DROP;                  /**< 02C8: Count of frames not counted correctly (IEEE_R_DROP). NOTE: Counter increments if a frame with valid/missing SFD character is detected and has been dropped. None of the other counters increments if this counter increments */
   __IO uint32_t  IEEE_R_FRAME_OK;              /**< 02CC: Frames Received OK (IEEE_R_FRAME_OK)                         */
   __IO uint32_t  IEEE_R_CRC;                   /**< 02D0: Frames Received with CRC Error (IEEE_R_CRC)                  */
   __IO uint32_t  IEEE_R_ALIGN;                 /**< 02D4: Frames Received with Alignment Error (IEEE_R_ALIGN)          */
   __IO uint32_t  IEEE_R_MACERR;                /**< 02D8: Receive Fifo Overflow count (IEEE_R_MACERR)                  */
   __IO uint32_t  IEEE_R_FDXFC;                 /**< 02DC: Flow Control Pause frames received (IEEE_R_FDXFC)            */
   __IO uint32_t  IEEE_R_OCTETS_OK;             /**< 02E0: Octet count for Frames Rcvd w/o Error (IEEE_R_OCTETS_OK). Counts total octets (includes header and FCS fields) */
   __I  uint32_t  RESERVED15[71];              
   __IO uint32_t  ATCR;                         /**< 0400: Timer Control Register                                       */
   __IO uint32_t  ATVR;                         /**< 0404: Timer Value Register                                         */
   __IO uint32_t  ATOFF;                        /**< 0408: Timer Offset Register                                        */
   __IO uint32_t  ATPER;                        /**< 040C: Timer Period Register                                        */
   __IO uint32_t  ATCOR;                        /**< 0410: Timer Correction Register                                    */
   __IO uint32_t  ATINC;                        /**< 0414: Time-Stamping Clock Period Register                          */
   __I  uint32_t  ATSTMP;                       /**< 0418: Timestamp of Last Transmitted Frame                          */
   __I  uint32_t  RESERVED16[122];             
   __IO uint32_t  TGSR;                         /**< 0604: Timer Global Status Register                                 */
   __IO uint32_t  TCSR0;                        /**< 0608: Timer Control Status Register                                */
   __IO uint32_t  TCCR0;                        /**< 060C: Timer Compare Capture Register                               */
   __IO uint32_t  TCSR1;                        /**< 0610: Timer Control Status Register                                */
   __IO uint32_t  TCCR1;                        /**< 0614: Timer Compare Capture Register                               */
   __IO uint32_t  TCSR2;                        /**< 0618: Timer Control Status Register                                */
   __IO uint32_t  TCCR2;                        /**< 061C: Timer Compare Capture Register                               */
   __IO uint32_t  TCSR3;                        /**< 0620: Timer Control Status Register                                */
   __IO uint32_t  TCCR3;                        /**< 0624: Timer Compare Capture Register                               */
} ENET_Type;

/**
 * @} */ /* End group ENET_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'ENET' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

