podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup ENET_Register_Masks_GROUP ENET Register Masks
* @brief Register Masks for ENET
* @{
*/
/* ------- EIR Bit Fields                           ------ */
#define ENET_EIR_TS_TIMER_MASK                   (0x01UL << ENET_EIR_TS_TIMER_SHIFT)                 /*!< ENET_EIR: TS_TIMER Mask                 */
#define ENET_EIR_TS_TIMER_SHIFT                  15                                                  /*!< ENET_EIR: TS_TIMER Position             */
#define ENET_EIR_TS_AVAIL_MASK                   (0x01UL << ENET_EIR_TS_AVAIL_SHIFT)                 /*!< ENET_EIR: TS_AVAIL Mask                 */
#define ENET_EIR_TS_AVAIL_SHIFT                  16                                                  /*!< ENET_EIR: TS_AVAIL Position             */
#define ENET_EIR_WAKEUP_MASK                     (0x01UL << ENET_EIR_WAKEUP_SHIFT)                   /*!< ENET_EIR: WAKEUP Mask                   */
#define ENET_EIR_WAKEUP_SHIFT                    17                                                  /*!< ENET_EIR: WAKEUP Position               */
#define ENET_EIR_PLR_MASK                        (0x01UL << ENET_EIR_PLR_SHIFT)                      /*!< ENET_EIR: PLR Mask                      */
#define ENET_EIR_PLR_SHIFT                       18                                                  /*!< ENET_EIR: PLR Position                  */
#define ENET_EIR_UN_MASK                         (0x01UL << ENET_EIR_UN_SHIFT)                       /*!< ENET_EIR: UN Mask                       */
#define ENET_EIR_UN_SHIFT                        19                                                  /*!< ENET_EIR: UN Position                   */
#define ENET_EIR_RL_MASK                         (0x01UL << ENET_EIR_RL_SHIFT)                       /*!< ENET_EIR: RL Mask                       */
#define ENET_EIR_RL_SHIFT                        20                                                  /*!< ENET_EIR: RL Position                   */
#define ENET_EIR_LC_MASK                         (0x01UL << ENET_EIR_LC_SHIFT)                       /*!< ENET_EIR: LC Mask                       */
#define ENET_EIR_LC_SHIFT                        21                                                  /*!< ENET_EIR: LC Position                   */
#define ENET_EIR_EBERR_MASK                      (0x01UL << ENET_EIR_EBERR_SHIFT)                    /*!< ENET_EIR: EBERR Mask                    */
#define ENET_EIR_EBERR_SHIFT                     22                                                  /*!< ENET_EIR: EBERR Position                */
#define ENET_EIR_MII_MASK                        (0x01UL << ENET_EIR_MII_SHIFT)                      /*!< ENET_EIR: MII Mask                      */
#define ENET_EIR_MII_SHIFT                       23                                                  /*!< ENET_EIR: MII Position                  */
#define ENET_EIR_RXB_MASK                        (0x01UL << ENET_EIR_RXB_SHIFT)                      /*!< ENET_EIR: RXB Mask                      */
#define ENET_EIR_RXB_SHIFT                       24                                                  /*!< ENET_EIR: RXB Position                  */
#define ENET_EIR_RXF_MASK                        (0x01UL << ENET_EIR_RXF_SHIFT)                      /*!< ENET_EIR: RXF Mask                      */
#define ENET_EIR_RXF_SHIFT                       25                                                  /*!< ENET_EIR: RXF Position                  */
#define ENET_EIR_TXB_MASK                        (0x01UL << ENET_EIR_TXB_SHIFT)                      /*!< ENET_EIR: TXB Mask                      */
#define ENET_EIR_TXB_SHIFT                       26                                                  /*!< ENET_EIR: TXB Position                  */
#define ENET_EIR_TXF_MASK                        (0x01UL << ENET_EIR_TXF_SHIFT)                      /*!< ENET_EIR: TXF Mask                      */
#define ENET_EIR_TXF_SHIFT                       27                                                  /*!< ENET_EIR: TXF Position                  */
#define ENET_EIR_GRA_MASK                        (0x01UL << ENET_EIR_GRA_SHIFT)                      /*!< ENET_EIR: GRA Mask                      */
#define ENET_EIR_GRA_SHIFT                       28                                                  /*!< ENET_EIR: GRA Position                  */
#define ENET_EIR_BABT_MASK                       (0x01UL << ENET_EIR_BABT_SHIFT)                     /*!< ENET_EIR: BABT Mask                     */
#define ENET_EIR_BABT_SHIFT                      29                                                  /*!< ENET_EIR: BABT Position                 */
#define ENET_EIR_BABR_MASK                       (0x01UL << ENET_EIR_BABR_SHIFT)                     /*!< ENET_EIR: BABR Mask                     */
#define ENET_EIR_BABR_SHIFT                      30                                                  /*!< ENET_EIR: BABR Position                 */
/* ------- EIMR Bit Fields                          ------ */
#define ENET_EIMR_TS_TIMER_MASK                  (0x01UL << ENET_EIMR_TS_TIMER_SHIFT)                /*!< ENET_EIMR: TS_TIMER Mask                */
#define ENET_EIMR_TS_TIMER_SHIFT                 15                                                  /*!< ENET_EIMR: TS_TIMER Position            */
#define ENET_EIMR_TS_AVAIL_MASK                  (0x01UL << ENET_EIMR_TS_AVAIL_SHIFT)                /*!< ENET_EIMR: TS_AVAIL Mask                */
#define ENET_EIMR_TS_AVAIL_SHIFT                 16                                                  /*!< ENET_EIMR: TS_AVAIL Position            */
#define ENET_EIMR_WAKEUP_MASK                    (0x01UL << ENET_EIMR_WAKEUP_SHIFT)                  /*!< ENET_EIMR: WAKEUP Mask                  */
#define ENET_EIMR_WAKEUP_SHIFT                   17                                                  /*!< ENET_EIMR: WAKEUP Position              */
#define ENET_EIMR_PLR_MASK                       (0x01UL << ENET_EIMR_PLR_SHIFT)                     /*!< ENET_EIMR: PLR Mask                     */
#define ENET_EIMR_PLR_SHIFT                      18                                                  /*!< ENET_EIMR: PLR Position                 */
#define ENET_EIMR_UN_MASK                        (0x01UL << ENET_EIMR_UN_SHIFT)                      /*!< ENET_EIMR: UN Mask                      */
#define ENET_EIMR_UN_SHIFT                       19                                                  /*!< ENET_EIMR: UN Position                  */
#define ENET_EIMR_RL_MASK                        (0x01UL << ENET_EIMR_RL_SHIFT)                      /*!< ENET_EIMR: RL Mask                      */
#define ENET_EIMR_RL_SHIFT                       20                                                  /*!< ENET_EIMR: RL Position                  */
#define ENET_EIMR_LC_MASK                        (0x01UL << ENET_EIMR_LC_SHIFT)                      /*!< ENET_EIMR: LC Mask                      */
#define ENET_EIMR_LC_SHIFT                       21                                                  /*!< ENET_EIMR: LC Position                  */
#define ENET_EIMR_EBERR_MASK                     (0x01UL << ENET_EIMR_EBERR_SHIFT)                   /*!< ENET_EIMR: EBERR Mask                   */
#define ENET_EIMR_EBERR_SHIFT                    22                                                  /*!< ENET_EIMR: EBERR Position               */
#define ENET_EIMR_MII_MASK                       (0x01UL << ENET_EIMR_MII_SHIFT)                     /*!< ENET_EIMR: MII Mask                     */
#define ENET_EIMR_MII_SHIFT                      23                                                  /*!< ENET_EIMR: MII Position                 */
#define ENET_EIMR_RXB_MASK                       (0x01UL << ENET_EIMR_RXB_SHIFT)                     /*!< ENET_EIMR: RXB Mask                     */
#define ENET_EIMR_RXB_SHIFT                      24                                                  /*!< ENET_EIMR: RXB Position                 */
#define ENET_EIMR_RXF_MASK                       (0x01UL << ENET_EIMR_RXF_SHIFT)                     /*!< ENET_EIMR: RXF Mask                     */
#define ENET_EIMR_RXF_SHIFT                      25                                                  /*!< ENET_EIMR: RXF Position                 */
#define ENET_EIMR_TXB_MASK                       (0x01UL << ENET_EIMR_TXB_SHIFT)                     /*!< ENET_EIMR: TXB Mask                     */
#define ENET_EIMR_TXB_SHIFT                      26                                                  /*!< ENET_EIMR: TXB Position                 */
#define ENET_EIMR_TXF_MASK                       (0x01UL << ENET_EIMR_TXF_SHIFT)                     /*!< ENET_EIMR: TXF Mask                     */
#define ENET_EIMR_TXF_SHIFT                      27                                                  /*!< ENET_EIMR: TXF Position                 */
#define ENET_EIMR_GRA_MASK                       (0x01UL << ENET_EIMR_GRA_SHIFT)                     /*!< ENET_EIMR: GRA Mask                     */
#define ENET_EIMR_GRA_SHIFT                      28                                                  /*!< ENET_EIMR: GRA Position                 */
#define ENET_EIMR_BABT_MASK                      (0x01UL << ENET_EIMR_BABT_SHIFT)                    /*!< ENET_EIMR: BABT Mask                    */
#define ENET_EIMR_BABT_SHIFT                     29                                                  /*!< ENET_EIMR: BABT Position                */
#define ENET_EIMR_BABR_MASK                      (0x01UL << ENET_EIMR_BABR_SHIFT)                    /*!< ENET_EIMR: BABR Mask                    */
#define ENET_EIMR_BABR_SHIFT                     30                                                  /*!< ENET_EIMR: BABR Position                */
/* ------- RDAR Bit Fields                          ------ */
#define ENET_RDAR_RDAR_MASK                      (0x01UL << ENET_RDAR_RDAR_SHIFT)                    /*!< ENET_RDAR: RDAR Mask                    */
#define ENET_RDAR_RDAR_SHIFT                     24                                                  /*!< ENET_RDAR: RDAR Position                */
/* ------- TDAR Bit Fields                          ------ */
#define ENET_TDAR_TDAR_MASK                      (0x01UL << ENET_TDAR_TDAR_SHIFT)                    /*!< ENET_TDAR: TDAR Mask                    */
#define ENET_TDAR_TDAR_SHIFT                     24                                                  /*!< ENET_TDAR: TDAR Position                */
/* ------- ECR Bit Fields                           ------ */
#define ENET_ECR_RESET_MASK                      (0x01UL << ENET_ECR_RESET_SHIFT)                    /*!< ENET_ECR: RESET Mask                    */
#define ENET_ECR_RESET_SHIFT                     0                                                   /*!< ENET_ECR: RESET Position                */
#define ENET_ECR_ETHEREN_MASK                    (0x01UL << ENET_ECR_ETHEREN_SHIFT)                  /*!< ENET_ECR: ETHEREN Mask                  */
#define ENET_ECR_ETHEREN_SHIFT                   1                                                   /*!< ENET_ECR: ETHEREN Position              */
#define ENET_ECR_MAGICEN_MASK                    (0x01UL << ENET_ECR_MAGICEN_SHIFT)                  /*!< ENET_ECR: MAGICEN Mask                  */
#define ENET_ECR_MAGICEN_SHIFT                   2                                                   /*!< ENET_ECR: MAGICEN Position              */
#define ENET_ECR_SLEEP_MASK                      (0x01UL << ENET_ECR_SLEEP_SHIFT)                    /*!< ENET_ECR: SLEEP Mask                    */
#define ENET_ECR_SLEEP_SHIFT                     3                                                   /*!< ENET_ECR: SLEEP Position                */
#define ENET_ECR_EN1588_MASK                     (0x01UL << ENET_ECR_EN1588_SHIFT)                   /*!< ENET_ECR: EN1588 Mask                   */
#define ENET_ECR_EN1588_SHIFT                    4                                                   /*!< ENET_ECR: EN1588 Position               */
#define ENET_ECR_DBGEN_MASK                      (0x01UL << ENET_ECR_DBGEN_SHIFT)                    /*!< ENET_ECR: DBGEN Mask                    */
#define ENET_ECR_DBGEN_SHIFT                     6                                                   /*!< ENET_ECR: DBGEN Position                */
#define ENET_ECR_STOPEN_MASK                     (0x01UL << ENET_ECR_STOPEN_SHIFT)                   /*!< ENET_ECR: STOPEN Mask                   */
#define ENET_ECR_STOPEN_SHIFT                    7                                                   /*!< ENET_ECR: STOPEN Position               */
#define ENET_ECR_DBSWP_MASK                      (0x01UL << ENET_ECR_DBSWP_SHIFT)                    /*!< ENET_ECR: DBSWP Mask                    */
#define ENET_ECR_DBSWP_SHIFT                     8                                                   /*!< ENET_ECR: DBSWP Position                */
/* ------- MMFR Bit Fields                          ------ */
#define ENET_MMFR_DATA_MASK                      (0xFFFFUL << ENET_MMFR_DATA_SHIFT)                  /*!< ENET_MMFR: DATA Mask                    */
#define ENET_MMFR_DATA_SHIFT                     0                                                   /*!< ENET_MMFR: DATA Position                */
#define ENET_MMFR_DATA(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_MMFR_DATA_SHIFT))&ENET_MMFR_DATA_MASK) /*!< ENET_MMFR                               */
#define ENET_MMFR_TA_MASK                        (0x03UL << ENET_MMFR_TA_SHIFT)                      /*!< ENET_MMFR: TA Mask                      */
#define ENET_MMFR_TA_SHIFT                       16                                                  /*!< ENET_MMFR: TA Position                  */
#define ENET_MMFR_TA(x)                          (((uint32_t)(((uint32_t)(x))<<ENET_MMFR_TA_SHIFT))&ENET_MMFR_TA_MASK) /*!< ENET_MMFR                               */
#define ENET_MMFR_RA_MASK                        (0x1FUL << ENET_MMFR_RA_SHIFT)                      /*!< ENET_MMFR: RA Mask                      */
#define ENET_MMFR_RA_SHIFT                       18                                                  /*!< ENET_MMFR: RA Position                  */
#define ENET_MMFR_RA(x)                          (((uint32_t)(((uint32_t)(x))<<ENET_MMFR_RA_SHIFT))&ENET_MMFR_RA_MASK) /*!< ENET_MMFR                               */
#define ENET_MMFR_PA_MASK                        (0x1FUL << ENET_MMFR_PA_SHIFT)                      /*!< ENET_MMFR: PA Mask                      */
#define ENET_MMFR_PA_SHIFT                       23                                                  /*!< ENET_MMFR: PA Position                  */
#define ENET_MMFR_PA(x)                          (((uint32_t)(((uint32_t)(x))<<ENET_MMFR_PA_SHIFT))&ENET_MMFR_PA_MASK) /*!< ENET_MMFR                               */
#define ENET_MMFR_OP_MASK                        (0x03UL << ENET_MMFR_OP_SHIFT)                      /*!< ENET_MMFR: OP Mask                      */
#define ENET_MMFR_OP_SHIFT                       28                                                  /*!< ENET_MMFR: OP Position                  */
#define ENET_MMFR_OP(x)                          (((uint32_t)(((uint32_t)(x))<<ENET_MMFR_OP_SHIFT))&ENET_MMFR_OP_MASK) /*!< ENET_MMFR                               */
#define ENET_MMFR_ST_MASK                        (0x03UL << ENET_MMFR_ST_SHIFT)                      /*!< ENET_MMFR: ST Mask                      */
#define ENET_MMFR_ST_SHIFT                       30                                                  /*!< ENET_MMFR: ST Position                  */
#define ENET_MMFR_ST(x)                          (((uint32_t)(((uint32_t)(x))<<ENET_MMFR_ST_SHIFT))&ENET_MMFR_ST_MASK) /*!< ENET_MMFR                               */
/* ------- MSCR Bit Fields                          ------ */
#define ENET_MSCR_MII_SPEED_MASK                 (0x3FUL << ENET_MSCR_MII_SPEED_SHIFT)               /*!< ENET_MSCR: MII_SPEED Mask               */
#define ENET_MSCR_MII_SPEED_SHIFT                1                                                   /*!< ENET_MSCR: MII_SPEED Position           */
#define ENET_MSCR_MII_SPEED(x)                   (((uint32_t)(((uint32_t)(x))<<ENET_MSCR_MII_SPEED_SHIFT))&ENET_MSCR_MII_SPEED_MASK) /*!< ENET_MSCR                               */
#define ENET_MSCR_DIS_PRE_MASK                   (0x01UL << ENET_MSCR_DIS_PRE_SHIFT)                 /*!< ENET_MSCR: DIS_PRE Mask                 */
#define ENET_MSCR_DIS_PRE_SHIFT                  7                                                   /*!< ENET_MSCR: DIS_PRE Position             */
#define ENET_MSCR_HOLDTIME_MASK                  (0x07UL << ENET_MSCR_HOLDTIME_SHIFT)                /*!< ENET_MSCR: HOLDTIME Mask                */
#define ENET_MSCR_HOLDTIME_SHIFT                 8                                                   /*!< ENET_MSCR: HOLDTIME Position            */
#define ENET_MSCR_HOLDTIME(x)                    (((uint32_t)(((uint32_t)(x))<<ENET_MSCR_HOLDTIME_SHIFT))&ENET_MSCR_HOLDTIME_MASK) /*!< ENET_MSCR                               */
/* ------- MIBC Bit Fields                          ------ */
#define ENET_MIBC_MIB_CLEAR_MASK                 (0x01UL << ENET_MIBC_MIB_CLEAR_SHIFT)               /*!< ENET_MIBC: MIB_CLEAR Mask               */
#define ENET_MIBC_MIB_CLEAR_SHIFT                29                                                  /*!< ENET_MIBC: MIB_CLEAR Position           */
#define ENET_MIBC_MIB_IDLE_MASK                  (0x01UL << ENET_MIBC_MIB_IDLE_SHIFT)                /*!< ENET_MIBC: MIB_IDLE Mask                */
#define ENET_MIBC_MIB_IDLE_SHIFT                 30                                                  /*!< ENET_MIBC: MIB_IDLE Position            */
#define ENET_MIBC_MIB_DIS_MASK                   (0x01UL << ENET_MIBC_MIB_DIS_SHIFT)                 /*!< ENET_MIBC: MIB_DIS Mask                 */
#define ENET_MIBC_MIB_DIS_SHIFT                  31                                                  /*!< ENET_MIBC: MIB_DIS Position             */
/* ------- RCR Bit Fields                           ------ */
#define ENET_RCR_LOOP_MASK                       (0x01UL << ENET_RCR_LOOP_SHIFT)                     /*!< ENET_RCR: LOOP Mask                     */
#define ENET_RCR_LOOP_SHIFT                      0                                                   /*!< ENET_RCR: LOOP Position                 */
#define ENET_RCR_DRT_MASK                        (0x01UL << ENET_RCR_DRT_SHIFT)                      /*!< ENET_RCR: DRT Mask                      */
#define ENET_RCR_DRT_SHIFT                       1                                                   /*!< ENET_RCR: DRT Position                  */
#define ENET_RCR_MII_MODE_MASK                   (0x01UL << ENET_RCR_MII_MODE_SHIFT)                 /*!< ENET_RCR: MII_MODE Mask                 */
#define ENET_RCR_MII_MODE_SHIFT                  2                                                   /*!< ENET_RCR: MII_MODE Position             */
#define ENET_RCR_PROM_MASK                       (0x01UL << ENET_RCR_PROM_SHIFT)                     /*!< ENET_RCR: PROM Mask                     */
#define ENET_RCR_PROM_SHIFT                      3                                                   /*!< ENET_RCR: PROM Position                 */
#define ENET_RCR_BC_REJ_MASK                     (0x01UL << ENET_RCR_BC_REJ_SHIFT)                   /*!< ENET_RCR: BC_REJ Mask                   */
#define ENET_RCR_BC_REJ_SHIFT                    4                                                   /*!< ENET_RCR: BC_REJ Position               */
#define ENET_RCR_FCE_MASK                        (0x01UL << ENET_RCR_FCE_SHIFT)                      /*!< ENET_RCR: FCE Mask                      */
#define ENET_RCR_FCE_SHIFT                       5                                                   /*!< ENET_RCR: FCE Position                  */
#define ENET_RCR_RMII_MODE_MASK                  (0x01UL << ENET_RCR_RMII_MODE_SHIFT)                /*!< ENET_RCR: RMII_MODE Mask                */
#define ENET_RCR_RMII_MODE_SHIFT                 8                                                   /*!< ENET_RCR: RMII_MODE Position            */
#define ENET_RCR_RMII_10T_MASK                   (0x01UL << ENET_RCR_RMII_10T_SHIFT)                 /*!< ENET_RCR: RMII_10T Mask                 */
#define ENET_RCR_RMII_10T_SHIFT                  9                                                   /*!< ENET_RCR: RMII_10T Position             */
#define ENET_RCR_PADEN_MASK                      (0x01UL << ENET_RCR_PADEN_SHIFT)                    /*!< ENET_RCR: PADEN Mask                    */
#define ENET_RCR_PADEN_SHIFT                     12                                                  /*!< ENET_RCR: PADEN Position                */
#define ENET_RCR_PAUFWD_MASK                     (0x01UL << ENET_RCR_PAUFWD_SHIFT)                   /*!< ENET_RCR: PAUFWD Mask                   */
#define ENET_RCR_PAUFWD_SHIFT                    13                                                  /*!< ENET_RCR: PAUFWD Position               */
#define ENET_RCR_CRCFWD_MASK                     (0x01UL << ENET_RCR_CRCFWD_SHIFT)                   /*!< ENET_RCR: CRCFWD Mask                   */
#define ENET_RCR_CRCFWD_SHIFT                    14                                                  /*!< ENET_RCR: CRCFWD Position               */
#define ENET_RCR_CFEN_MASK                       (0x01UL << ENET_RCR_CFEN_SHIFT)                     /*!< ENET_RCR: CFEN Mask                     */
#define ENET_RCR_CFEN_SHIFT                      15                                                  /*!< ENET_RCR: CFEN Position                 */
#define ENET_RCR_MAX_FL_MASK                     (0x3FFFUL << ENET_RCR_MAX_FL_SHIFT)                 /*!< ENET_RCR: MAX_FL Mask                   */
#define ENET_RCR_MAX_FL_SHIFT                    16                                                  /*!< ENET_RCR: MAX_FL Position               */
#define ENET_RCR_MAX_FL(x)                       (((uint32_t)(((uint32_t)(x))<<ENET_RCR_MAX_FL_SHIFT))&ENET_RCR_MAX_FL_MASK) /*!< ENET_RCR                                */
#define ENET_RCR_NLC_MASK                        (0x01UL << ENET_RCR_NLC_SHIFT)                      /*!< ENET_RCR: NLC Mask                      */
#define ENET_RCR_NLC_SHIFT                       30                                                  /*!< ENET_RCR: NLC Position                  */
#define ENET_RCR_GRS_MASK                        (0x01UL << ENET_RCR_GRS_SHIFT)                      /*!< ENET_RCR: GRS Mask                      */
#define ENET_RCR_GRS_SHIFT                       31                                                  /*!< ENET_RCR: GRS Position                  */
/* ------- TCR Bit Fields                           ------ */
#define ENET_TCR_GTS_MASK                        (0x01UL << ENET_TCR_GTS_SHIFT)                      /*!< ENET_TCR: GTS Mask                      */
#define ENET_TCR_GTS_SHIFT                       0                                                   /*!< ENET_TCR: GTS Position                  */
#define ENET_TCR_FDEN_MASK                       (0x01UL << ENET_TCR_FDEN_SHIFT)                     /*!< ENET_TCR: FDEN Mask                     */
#define ENET_TCR_FDEN_SHIFT                      2                                                   /*!< ENET_TCR: FDEN Position                 */
#define ENET_TCR_TFC_PAUSE_MASK                  (0x01UL << ENET_TCR_TFC_PAUSE_SHIFT)                /*!< ENET_TCR: TFC_PAUSE Mask                */
#define ENET_TCR_TFC_PAUSE_SHIFT                 3                                                   /*!< ENET_TCR: TFC_PAUSE Position            */
#define ENET_TCR_RFC_PAUSE_MASK                  (0x01UL << ENET_TCR_RFC_PAUSE_SHIFT)                /*!< ENET_TCR: RFC_PAUSE Mask                */
