podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define ENET_TCR_RFC_PAUSE_SHIFT                 4                                                   /*!< ENET_TCR: RFC_PAUSE Position            */
#define ENET_TCR_ADDSEL_MASK                     (0x07UL << ENET_TCR_ADDSEL_SHIFT)                   /*!< ENET_TCR: ADDSEL Mask                   */
#define ENET_TCR_ADDSEL_SHIFT                    5                                                   /*!< ENET_TCR: ADDSEL Position               */
#define ENET_TCR_ADDSEL(x)                       (((uint32_t)(((uint32_t)(x))<<ENET_TCR_ADDSEL_SHIFT))&ENET_TCR_ADDSEL_MASK) /*!< ENET_TCR                                */
#define ENET_TCR_ADDINS_MASK                     (0x01UL << ENET_TCR_ADDINS_SHIFT)                   /*!< ENET_TCR: ADDINS Mask                   */
#define ENET_TCR_ADDINS_SHIFT                    8                                                   /*!< ENET_TCR: ADDINS Position               */
#define ENET_TCR_CRCFWD_MASK                     (0x01UL << ENET_TCR_CRCFWD_SHIFT)                   /*!< ENET_TCR: CRCFWD Mask                   */
#define ENET_TCR_CRCFWD_SHIFT                    9                                                   /*!< ENET_TCR: CRCFWD Position               */
/* ------- PALR Bit Fields                          ------ */
#define ENET_PALR_PADDR1_MASK                    (0xFFFFFFFFUL << ENET_PALR_PADDR1_SHIFT)            /*!< ENET_PALR: PADDR1 Mask                  */
#define ENET_PALR_PADDR1_SHIFT                   0                                                   /*!< ENET_PALR: PADDR1 Position              */
#define ENET_PALR_PADDR1(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_PALR_PADDR1_SHIFT))&ENET_PALR_PADDR1_MASK) /*!< ENET_PALR                               */
/* ------- PAUR Bit Fields                          ------ */
#define ENET_PAUR_TYPE_MASK                      (0xFFFFUL << ENET_PAUR_TYPE_SHIFT)                  /*!< ENET_PAUR: TYPE Mask                    */
#define ENET_PAUR_TYPE_SHIFT                     0                                                   /*!< ENET_PAUR: TYPE Position                */
#define ENET_PAUR_TYPE(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_PAUR_TYPE_SHIFT))&ENET_PAUR_TYPE_MASK) /*!< ENET_PAUR                               */
#define ENET_PAUR_PADDR2_MASK                    (0xFFFFUL << ENET_PAUR_PADDR2_SHIFT)                /*!< ENET_PAUR: PADDR2 Mask                  */
#define ENET_PAUR_PADDR2_SHIFT                   16                                                  /*!< ENET_PAUR: PADDR2 Position              */
#define ENET_PAUR_PADDR2(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_PAUR_PADDR2_SHIFT))&ENET_PAUR_PADDR2_MASK) /*!< ENET_PAUR                               */
/* ------- OPD Bit Fields                           ------ */
#define ENET_OPD_PAUSE_DUR_MASK                  (0xFFFFUL << ENET_OPD_PAUSE_DUR_SHIFT)              /*!< ENET_OPD: PAUSE_DUR Mask                */
#define ENET_OPD_PAUSE_DUR_SHIFT                 0                                                   /*!< ENET_OPD: PAUSE_DUR Position            */
#define ENET_OPD_PAUSE_DUR(x)                    (((uint32_t)(((uint32_t)(x))<<ENET_OPD_PAUSE_DUR_SHIFT))&ENET_OPD_PAUSE_DUR_MASK) /*!< ENET_OPD                                */
#define ENET_OPD_OPCODE_MASK                     (0xFFFFUL << ENET_OPD_OPCODE_SHIFT)                 /*!< ENET_OPD: OPCODE Mask                   */
#define ENET_OPD_OPCODE_SHIFT                    16                                                  /*!< ENET_OPD: OPCODE Position               */
#define ENET_OPD_OPCODE(x)                       (((uint32_t)(((uint32_t)(x))<<ENET_OPD_OPCODE_SHIFT))&ENET_OPD_OPCODE_MASK) /*!< ENET_OPD                                */
/* ------- IAUR Bit Fields                          ------ */
#define ENET_IAUR_IADDR1_MASK                    (0xFFFFFFFFUL << ENET_IAUR_IADDR1_SHIFT)            /*!< ENET_IAUR: IADDR1 Mask                  */
#define ENET_IAUR_IADDR1_SHIFT                   0                                                   /*!< ENET_IAUR: IADDR1 Position              */
#define ENET_IAUR_IADDR1(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_IAUR_IADDR1_SHIFT))&ENET_IAUR_IADDR1_MASK) /*!< ENET_IAUR                               */
/* ------- IALR Bit Fields                          ------ */
#define ENET_IALR_IADDR2_MASK                    (0xFFFFFFFFUL << ENET_IALR_IADDR2_SHIFT)            /*!< ENET_IALR: IADDR2 Mask                  */
#define ENET_IALR_IADDR2_SHIFT                   0                                                   /*!< ENET_IALR: IADDR2 Position              */
#define ENET_IALR_IADDR2(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_IALR_IADDR2_SHIFT))&ENET_IALR_IADDR2_MASK) /*!< ENET_IALR                               */
/* ------- GAUR Bit Fields                          ------ */
#define ENET_GAUR_GADDR1_MASK                    (0xFFFFFFFFUL << ENET_GAUR_GADDR1_SHIFT)            /*!< ENET_GAUR: GADDR1 Mask                  */
#define ENET_GAUR_GADDR1_SHIFT                   0                                                   /*!< ENET_GAUR: GADDR1 Position              */
#define ENET_GAUR_GADDR1(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_GAUR_GADDR1_SHIFT))&ENET_GAUR_GADDR1_MASK) /*!< ENET_GAUR                               */
/* ------- GALR Bit Fields                          ------ */
#define ENET_GALR_GADDR2_MASK                    (0xFFFFFFFFUL << ENET_GALR_GADDR2_SHIFT)            /*!< ENET_GALR: GADDR2 Mask                  */
#define ENET_GALR_GADDR2_SHIFT                   0                                                   /*!< ENET_GALR: GADDR2 Position              */
#define ENET_GALR_GADDR2(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_GALR_GADDR2_SHIFT))&ENET_GALR_GADDR2_MASK) /*!< ENET_GALR                               */
/* ------- TFWR Bit Fields                          ------ */
#define ENET_TFWR_TFWR_MASK                      (0x3FUL << ENET_TFWR_TFWR_SHIFT)                    /*!< ENET_TFWR: TFWR Mask                    */
#define ENET_TFWR_TFWR_SHIFT                     0                                                   /*!< ENET_TFWR: TFWR Position                */
#define ENET_TFWR_TFWR(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_TFWR_TFWR_SHIFT))&ENET_TFWR_TFWR_MASK) /*!< ENET_TFWR                               */
#define ENET_TFWR_STRFWD_MASK                    (0x01UL << ENET_TFWR_STRFWD_SHIFT)                  /*!< ENET_TFWR: STRFWD Mask                  */
#define ENET_TFWR_STRFWD_SHIFT                   8                                                   /*!< ENET_TFWR: STRFWD Position              */
/* ------- RDSR Bit Fields                          ------ */
#define ENET_RDSR_R_DES_START_MASK               (0x1FFFFFFFUL << ENET_RDSR_R_DES_START_SHIFT)       /*!< ENET_RDSR: R_DES_START Mask             */
#define ENET_RDSR_R_DES_START_SHIFT              3                                                   /*!< ENET_RDSR: R_DES_START Position         */
#define ENET_RDSR_R_DES_START(x)                 (((uint32_t)(((uint32_t)(x))<<ENET_RDSR_R_DES_START_SHIFT))&ENET_RDSR_R_DES_START_MASK) /*!< ENET_RDSR                               */
/* ------- TDSR Bit Fields                          ------ */
#define ENET_TDSR_X_DES_START_MASK               (0x1FFFFFFFUL << ENET_TDSR_X_DES_START_SHIFT)       /*!< ENET_TDSR: X_DES_START Mask             */
#define ENET_TDSR_X_DES_START_SHIFT              3                                                   /*!< ENET_TDSR: X_DES_START Position         */
#define ENET_TDSR_X_DES_START(x)                 (((uint32_t)(((uint32_t)(x))<<ENET_TDSR_X_DES_START_SHIFT))&ENET_TDSR_X_DES_START_MASK) /*!< ENET_TDSR                               */
/* ------- MRBR Bit Fields                          ------ */
#define ENET_MRBR_R_BUF_SIZE_MASK                (0x3FFUL << ENET_MRBR_R_BUF_SIZE_SHIFT)             /*!< ENET_MRBR: R_BUF_SIZE Mask              */
#define ENET_MRBR_R_BUF_SIZE_SHIFT               4                                                   /*!< ENET_MRBR: R_BUF_SIZE Position          */
#define ENET_MRBR_R_BUF_SIZE(x)                  (((uint32_t)(((uint32_t)(x))<<ENET_MRBR_R_BUF_SIZE_SHIFT))&ENET_MRBR_R_BUF_SIZE_MASK) /*!< ENET_MRBR                               */
/* ------- RSFL Bit Fields                          ------ */
#define ENET_RSFL_RX_SECTION_FULL_MASK           (0xFFUL << ENET_RSFL_RX_SECTION_FULL_SHIFT)         /*!< ENET_RSFL: RX_SECTION_FULL Mask         */
#define ENET_RSFL_RX_SECTION_FULL_SHIFT          0                                                   /*!< ENET_RSFL: RX_SECTION_FULL Position     */
#define ENET_RSFL_RX_SECTION_FULL(x)             (((uint32_t)(((uint32_t)(x))<<ENET_RSFL_RX_SECTION_FULL_SHIFT))&ENET_RSFL_RX_SECTION_FULL_MASK) /*!< ENET_RSFL                               */
/* ------- RSEM Bit Fields                          ------ */
#define ENET_RSEM_RX_SECTION_EMPTY_MASK          (0xFFUL << ENET_RSEM_RX_SECTION_EMPTY_SHIFT)        /*!< ENET_RSEM: RX_SECTION_EMPTY Mask        */
#define ENET_RSEM_RX_SECTION_EMPTY_SHIFT         0                                                   /*!< ENET_RSEM: RX_SECTION_EMPTY Position    */
#define ENET_RSEM_RX_SECTION_EMPTY(x)            (((uint32_t)(((uint32_t)(x))<<ENET_RSEM_RX_SECTION_EMPTY_SHIFT))&ENET_RSEM_RX_SECTION_EMPTY_MASK) /*!< ENET_RSEM                               */
/* ------- RAEM Bit Fields                          ------ */
#define ENET_RAEM_RX_ALMOST_EMPTY_MASK           (0xFFUL << ENET_RAEM_RX_ALMOST_EMPTY_SHIFT)         /*!< ENET_RAEM: RX_ALMOST_EMPTY Mask         */
#define ENET_RAEM_RX_ALMOST_EMPTY_SHIFT          0                                                   /*!< ENET_RAEM: RX_ALMOST_EMPTY Position     */
#define ENET_RAEM_RX_ALMOST_EMPTY(x)             (((uint32_t)(((uint32_t)(x))<<ENET_RAEM_RX_ALMOST_EMPTY_SHIFT))&ENET_RAEM_RX_ALMOST_EMPTY_MASK) /*!< ENET_RAEM                               */
/* ------- RAFL Bit Fields                          ------ */
#define ENET_RAFL_RX_ALMOST_FULL_MASK            (0xFFUL << ENET_RAFL_RX_ALMOST_FULL_SHIFT)          /*!< ENET_RAFL: RX_ALMOST_FULL Mask          */
#define ENET_RAFL_RX_ALMOST_FULL_SHIFT           0                                                   /*!< ENET_RAFL: RX_ALMOST_FULL Position      */
#define ENET_RAFL_RX_ALMOST_FULL(x)              (((uint32_t)(((uint32_t)(x))<<ENET_RAFL_RX_ALMOST_FULL_SHIFT))&ENET_RAFL_RX_ALMOST_FULL_MASK) /*!< ENET_RAFL                               */
/* ------- TSEM Bit Fields                          ------ */
#define ENET_TSEM_TX_SECTION_EMPTY_MASK          (0xFFUL << ENET_TSEM_TX_SECTION_EMPTY_SHIFT)        /*!< ENET_TSEM: TX_SECTION_EMPTY Mask        */
#define ENET_TSEM_TX_SECTION_EMPTY_SHIFT         0                                                   /*!< ENET_TSEM: TX_SECTION_EMPTY Position    */
#define ENET_TSEM_TX_SECTION_EMPTY(x)            (((uint32_t)(((uint32_t)(x))<<ENET_TSEM_TX_SECTION_EMPTY_SHIFT))&ENET_TSEM_TX_SECTION_EMPTY_MASK) /*!< ENET_TSEM                               */
/* ------- TAEM Bit Fields                          ------ */
#define ENET_TAEM_TX_ALMOST_EMPTY_MASK           (0xFFUL << ENET_TAEM_TX_ALMOST_EMPTY_SHIFT)         /*!< ENET_TAEM: TX_ALMOST_EMPTY Mask         */
#define ENET_TAEM_TX_ALMOST_EMPTY_SHIFT          0                                                   /*!< ENET_TAEM: TX_ALMOST_EMPTY Position     */
#define ENET_TAEM_TX_ALMOST_EMPTY(x)             (((uint32_t)(((uint32_t)(x))<<ENET_TAEM_TX_ALMOST_EMPTY_SHIFT))&ENET_TAEM_TX_ALMOST_EMPTY_MASK) /*!< ENET_TAEM                               */
/* ------- TAFL Bit Fields                          ------ */
#define ENET_TAFL_TX_ALMOST_FULL_MASK            (0xFFUL << ENET_TAFL_TX_ALMOST_FULL_SHIFT)          /*!< ENET_TAFL: TX_ALMOST_FULL Mask          */
#define ENET_TAFL_TX_ALMOST_FULL_SHIFT           0                                                   /*!< ENET_TAFL: TX_ALMOST_FULL Position      */
#define ENET_TAFL_TX_ALMOST_FULL(x)              (((uint32_t)(((uint32_t)(x))<<ENET_TAFL_TX_ALMOST_FULL_SHIFT))&ENET_TAFL_TX_ALMOST_FULL_MASK) /*!< ENET_TAFL                               */
/* ------- TIPG Bit Fields                          ------ */
#define ENET_TIPG_IPG_MASK                       (0x1FUL << ENET_TIPG_IPG_SHIFT)                     /*!< ENET_TIPG: IPG Mask                     */
#define ENET_TIPG_IPG_SHIFT                      0                                                   /*!< ENET_TIPG: IPG Position                 */
#define ENET_TIPG_IPG(x)                         (((uint32_t)(((uint32_t)(x))<<ENET_TIPG_IPG_SHIFT))&ENET_TIPG_IPG_MASK) /*!< ENET_TIPG                               */
/* ------- FTRL Bit Fields                          ------ */
#define ENET_FTRL_TRUNC_FL_MASK                  (0x3FFFUL << ENET_FTRL_TRUNC_FL_SHIFT)              /*!< ENET_FTRL: TRUNC_FL Mask                */
#define ENET_FTRL_TRUNC_FL_SHIFT                 0                                                   /*!< ENET_FTRL: TRUNC_FL Position            */
#define ENET_FTRL_TRUNC_FL(x)                    (((uint32_t)(((uint32_t)(x))<<ENET_FTRL_TRUNC_FL_SHIFT))&ENET_FTRL_TRUNC_FL_MASK) /*!< ENET_FTRL                               */
/* ------- TACC Bit Fields                          ------ */
#define ENET_TACC_SHIFT16_MASK                   (0x01UL << ENET_TACC_SHIFT16_SHIFT)                 /*!< ENET_TACC: SHIFT16 Mask                 */
#define ENET_TACC_SHIFT16_SHIFT                  0                                                   /*!< ENET_TACC: SHIFT16 Position             */
#define ENET_TACC_IPCHK_MASK                     (0x01UL << ENET_TACC_IPCHK_SHIFT)                   /*!< ENET_TACC: IPCHK Mask                   */
#define ENET_TACC_IPCHK_SHIFT                    3                                                   /*!< ENET_TACC: IPCHK Position               */
#define ENET_TACC_PROCHK_MASK                    (0x01UL << ENET_TACC_PROCHK_SHIFT)                  /*!< ENET_TACC: PROCHK Mask                  */
#define ENET_TACC_PROCHK_SHIFT                   4                                                   /*!< ENET_TACC: PROCHK Position              */
/* ------- RACC Bit Fields                          ------ */
#define ENET_RACC_PADREM_MASK                    (0x01UL << ENET_RACC_PADREM_SHIFT)                  /*!< ENET_RACC: PADREM Mask                  */
#define ENET_RACC_PADREM_SHIFT                   0                                                   /*!< ENET_RACC: PADREM Position              */
#define ENET_RACC_IPDIS_MASK                     (0x01UL << ENET_RACC_IPDIS_SHIFT)                   /*!< ENET_RACC: IPDIS Mask                   */
#define ENET_RACC_IPDIS_SHIFT                    1                                                   /*!< ENET_RACC: IPDIS Position               */
#define ENET_RACC_PRODIS_MASK                    (0x01UL << ENET_RACC_PRODIS_SHIFT)                  /*!< ENET_RACC: PRODIS Mask                  */
#define ENET_RACC_PRODIS_SHIFT                   2                                                   /*!< ENET_RACC: PRODIS Position              */
#define ENET_RACC_LINEDIS_MASK                   (0x01UL << ENET_RACC_LINEDIS_SHIFT)                 /*!< ENET_RACC: LINEDIS Mask                 */
#define ENET_RACC_LINEDIS_SHIFT                  6                                                   /*!< ENET_RACC: LINEDIS Position             */
#define ENET_RACC_SHIFT16_MASK                   (0x01UL << ENET_RACC_SHIFT16_SHIFT)                 /*!< ENET_RACC: SHIFT16 Mask                 */
#define ENET_RACC_SHIFT16_SHIFT                  7                                                   /*!< ENET_RACC: SHIFT16 Position             */
/* ------- RMON_T_DROP Bit Fields                   ------ */
/* ------- RMON_T_PACKETS Bit Fields                ------ */
/* ------- RMON_T_BC_PKT Bit Fields                 ------ */
/* ------- RMON_T_MC_PKT Bit Fields                 ------ */
/* ------- RMON_T_CRC_ALIGN Bit Fields              ------ */
/* ------- RMON_T_UNDERSIZE Bit Fields              ------ */
/* ------- RMON_T_OVERSIZE Bit Fields               ------ */
/* ------- RMON_T_FRAG Bit Fields                   ------ */
/* ------- RMON_T_JAB Bit Fields                    ------ */
/* ------- RMON_T_COL Bit Fields                    ------ */
/* ------- RMON_T_P64 Bit Fields                    ------ */
/* ------- RMON_T_P65TO127 Bit Fields               ------ */
/* ------- RMON_T_P128TO255 Bit Fields              ------ */
/* ------- RMON_T_P256TO511 Bit Fields              ------ */
/* ------- RMON_T_P512TO1023 Bit Fields             ------ */
/* ------- RMON_T_P1024TO2047 Bit Fields            ------ */
/* ------- RMON_T_P_GTE2048 Bit Fields              ------ */
/* ------- RMON_T_OCTETS Bit Fields                 ------ */
/* ------- IEEE_T_DROP Bit Fields                   ------ */
/* ------- IEEE_T_FRAME_OK Bit Fields               ------ */
/* ------- IEEE_T_1COL Bit Fields                   ------ */
/* ------- IEEE_T_MCOL Bit Fields                   ------ */
/* ------- IEEE_T_DEF Bit Fields                    ------ */
/* ------- IEEE_T_LCOL Bit Fields                   ------ */
/* ------- IEEE_T_EXCOL Bit Fields                  ------ */
/* ------- IEEE_T_MACERR Bit Fields                 ------ */
/* ------- IEEE_T_CSERR Bit Fields                  ------ */
/* ------- IEEE_T_SQE Bit Fields                    ------ */
/* ------- IEEE_T_FDXFC Bit Fields                  ------ */
/* ------- IEEE_T_OCTETS_OK Bit Fields              ------ */
/* ------- RMON_R_PACKETS Bit Fields                ------ */
/* ------- RMON_R_BC_PKT Bit Fields                 ------ */
/* ------- RMON_R_MC_PKT Bit Fields                 ------ */
/* ------- RMON_R_CRC_ALIGN Bit Fields              ------ */
/* ------- RMON_R_UNDERSIZE Bit Fields              ------ */
/* ------- RMON_R_OVERSIZE Bit Fields               ------ */
/* ------- RMON_R_FRAG Bit Fields                   ------ */
/* ------- RMON_R_JAB Bit Fields                    ------ */
/* ------- RMON_R_RESVD_0 Bit Fields                ------ */
/* ------- RMON_R_P64 Bit Fields                    ------ */
/* ------- RMON_R_P65TO127 Bit Fields               ------ */
/* ------- RMON_R_P128TO255 Bit Fields              ------ */
/* ------- RMON_R_P256TO511 Bit Fields              ------ */
/* ------- RMON_R_P512TO1023 Bit Fields             ------ */
/* ------- RMON_R_P1024TO2047 Bit Fields            ------ */
/* ------- RMON_R_P_GTE2048 Bit Fields              ------ */
/* ------- RMON_R_OCTETS Bit Fields                 ------ */
/* ------- IEEE_R_DROP Bit Fields                   ------ */
/* ------- IEEE_R_FRAME_OK Bit Fields               ------ */
/* ------- IEEE_R_CRC Bit Fields                    ------ */
/* ------- IEEE_R_ALIGN Bit Fields                  ------ */
/* ------- IEEE_R_MACERR Bit Fields                 ------ */
/* ------- IEEE_R_FDXFC Bit Fields                  ------ */
/* ------- IEEE_R_OCTETS_OK Bit Fields              ------ */
/* ------- ATCR Bit Fields                          ------ */
#define ENET_ATCR_EN_MASK                        (0x01UL << ENET_ATCR_EN_SHIFT)                      /*!< ENET_ATCR: EN Mask                      */
#define ENET_ATCR_EN_SHIFT                       0                                                   /*!< ENET_ATCR: EN Position                  */
#define ENET_ATCR_OFFEN_MASK                     (0x01UL << ENET_ATCR_OFFEN_SHIFT)                   /*!< ENET_ATCR: OFFEN Mask                   */
#define ENET_ATCR_OFFEN_SHIFT                    2                                                   /*!< ENET_ATCR: OFFEN Position               */
#define ENET_ATCR_OFFRST_MASK                    (0x01UL << ENET_ATCR_OFFRST_SHIFT)                  /*!< ENET_ATCR: OFFRST Mask                  */
#define ENET_ATCR_OFFRST_SHIFT                   3                                                   /*!< ENET_ATCR: OFFRST Position              */
#define ENET_ATCR_PEREN_MASK                     (0x01UL << ENET_ATCR_PEREN_SHIFT)                   /*!< ENET_ATCR: PEREN Mask                   */
#define ENET_ATCR_PEREN_SHIFT                    4                                                   /*!< ENET_ATCR: PEREN Position               */
#define ENET_ATCR_PINPER_MASK                    (0x01UL << ENET_ATCR_PINPER_SHIFT)                  /*!< ENET_ATCR: PINPER Mask                  */
#define ENET_ATCR_PINPER_SHIFT                   7                                                   /*!< ENET_ATCR: PINPER Position              */
#define ENET_ATCR_RESTART_MASK                   (0x01UL << ENET_ATCR_RESTART_SHIFT)                 /*!< ENET_ATCR: RESTART Mask                 */
#define ENET_ATCR_RESTART_SHIFT                  9                                                   /*!< ENET_ATCR: RESTART Position             */
#define ENET_ATCR_CAPTURE_MASK                   (0x01UL << ENET_ATCR_CAPTURE_SHIFT)                 /*!< ENET_ATCR: CAPTURE Mask                 */
#define ENET_ATCR_CAPTURE_SHIFT                  11                                                  /*!< ENET_ATCR: CAPTURE Position             */
#define ENET_ATCR_SLAVE_MASK                     (0x01UL << ENET_ATCR_SLAVE_SHIFT)                   /*!< ENET_ATCR: SLAVE Mask                   */
#define ENET_ATCR_SLAVE_SHIFT                    13                                                  /*!< ENET_ATCR: SLAVE Position               */
/* ------- ATVR Bit Fields                          ------ */
#define ENET_ATVR_ATIME_MASK                     (0xFFFFFFFFUL << ENET_ATVR_ATIME_SHIFT)             /*!< ENET_ATVR: ATIME Mask                   */
#define ENET_ATVR_ATIME_SHIFT                    0                                                   /*!< ENET_ATVR: ATIME Position               */
#define ENET_ATVR_ATIME(x)                       (((uint32_t)(((uint32_t)(x))<<ENET_ATVR_ATIME_SHIFT))&ENET_ATVR_ATIME_MASK) /*!< ENET_ATVR                               */
/* ------- ATOFF Bit Fields                         ------ */
#define ENET_ATOFF_OFFSET_MASK                   (0xFFFFFFFFUL << ENET_ATOFF_OFFSET_SHIFT)           /*!< ENET_ATOFF: OFFSET Mask                 */
#define ENET_ATOFF_OFFSET_SHIFT                  0                                                   /*!< ENET_ATOFF: OFFSET Position             */
#define ENET_ATOFF_OFFSET(x)                     (((uint32_t)(((uint32_t)(x))<<ENET_ATOFF_OFFSET_SHIFT))&ENET_ATOFF_OFFSET_MASK) /*!< ENET_ATOFF                              */
/* ------- ATPER Bit Fields                         ------ */
#define ENET_ATPER_PERIOD_MASK                   (0xFFFFFFFFUL << ENET_ATPER_PERIOD_SHIFT)           /*!< ENET_ATPER: PERIOD Mask                 */
#define ENET_ATPER_PERIOD_SHIFT                  0                                                   /*!< ENET_ATPER: PERIOD Position             */
#define ENET_ATPER_PERIOD(x)                     (((uint32_t)(((uint32_t)(x))<<ENET_ATPER_PERIOD_SHIFT))&ENET_ATPER_PERIOD_MASK) /*!< ENET_ATPER                              */
/* ------- ATCOR Bit Fields                         ------ */
#define ENET_ATCOR_COR_MASK                      (0x7FFFFFFFUL << ENET_ATCOR_COR_SHIFT)              /*!< ENET_ATCOR: COR Mask                    */
#define ENET_ATCOR_COR_SHIFT                     0                                                   /*!< ENET_ATCOR: COR Position                */
#define ENET_ATCOR_COR(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_ATCOR_COR_SHIFT))&ENET_ATCOR_COR_MASK) /*!< ENET_ATCOR                              */
/* ------- ATINC Bit Fields                         ------ */
#define ENET_ATINC_INC_MASK                      (0x7FUL << ENET_ATINC_INC_SHIFT)                    /*!< ENET_ATINC: INC Mask                    */
