podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define ENET_ATINC_INC_SHIFT                     0                                                   /*!< ENET_ATINC: INC Position                */
#define ENET_ATINC_INC(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_ATINC_INC_SHIFT))&ENET_ATINC_INC_MASK) /*!< ENET_ATINC                              */
#define ENET_ATINC_INC_CORR_MASK                 (0x7FUL << ENET_ATINC_INC_CORR_SHIFT)               /*!< ENET_ATINC: INC_CORR Mask               */
#define ENET_ATINC_INC_CORR_SHIFT                8                                                   /*!< ENET_ATINC: INC_CORR Position           */
#define ENET_ATINC_INC_CORR(x)                   (((uint32_t)(((uint32_t)(x))<<ENET_ATINC_INC_CORR_SHIFT))&ENET_ATINC_INC_CORR_MASK) /*!< ENET_ATINC                              */
/* ------- ATSTMP Bit Fields                        ------ */
#define ENET_ATSTMP_TIMESTAMP_MASK               (0xFFFFFFFFUL << ENET_ATSTMP_TIMESTAMP_SHIFT)       /*!< ENET_ATSTMP: TIMESTAMP Mask             */
#define ENET_ATSTMP_TIMESTAMP_SHIFT              0                                                   /*!< ENET_ATSTMP: TIMESTAMP Position         */
#define ENET_ATSTMP_TIMESTAMP(x)                 (((uint32_t)(((uint32_t)(x))<<ENET_ATSTMP_TIMESTAMP_SHIFT))&ENET_ATSTMP_TIMESTAMP_MASK) /*!< ENET_ATSTMP                             */
/* ------- TGSR Bit Fields                          ------ */
#define ENET_TGSR_TF0_MASK                       (0x01UL << ENET_TGSR_TF0_SHIFT)                     /*!< ENET_TGSR: TF0 Mask                     */
#define ENET_TGSR_TF0_SHIFT                      0                                                   /*!< ENET_TGSR: TF0 Position                 */
#define ENET_TGSR_TF1_MASK                       (0x01UL << ENET_TGSR_TF1_SHIFT)                     /*!< ENET_TGSR: TF1 Mask                     */
#define ENET_TGSR_TF1_SHIFT                      1                                                   /*!< ENET_TGSR: TF1 Position                 */
#define ENET_TGSR_TF2_MASK                       (0x01UL << ENET_TGSR_TF2_SHIFT)                     /*!< ENET_TGSR: TF2 Mask                     */
#define ENET_TGSR_TF2_SHIFT                      2                                                   /*!< ENET_TGSR: TF2 Position                 */
#define ENET_TGSR_TF3_MASK                       (0x01UL << ENET_TGSR_TF3_SHIFT)                     /*!< ENET_TGSR: TF3 Mask                     */
#define ENET_TGSR_TF3_SHIFT                      3                                                   /*!< ENET_TGSR: TF3 Position                 */
/* ------- TCSR0 Bit Fields                         ------ */
#define ENET_TCSR0_TDRE_MASK                     (0x01UL << ENET_TCSR0_TDRE_SHIFT)                   /*!< ENET_TCSR0: TDRE Mask                   */
#define ENET_TCSR0_TDRE_SHIFT                    0                                                   /*!< ENET_TCSR0: TDRE Position               */
#define ENET_TCSR0_TMODE_MASK                    (0x0FUL << ENET_TCSR0_TMODE_SHIFT)                  /*!< ENET_TCSR0: TMODE Mask                  */
#define ENET_TCSR0_TMODE_SHIFT                   2                                                   /*!< ENET_TCSR0: TMODE Position              */
#define ENET_TCSR0_TMODE(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_TCSR0_TMODE_SHIFT))&ENET_TCSR0_TMODE_MASK) /*!< ENET_TCSR0                              */
#define ENET_TCSR0_TIE_MASK                      (0x01UL << ENET_TCSR0_TIE_SHIFT)                    /*!< ENET_TCSR0: TIE Mask                    */
#define ENET_TCSR0_TIE_SHIFT                     6                                                   /*!< ENET_TCSR0: TIE Position                */
#define ENET_TCSR0_TF_MASK                       (0x01UL << ENET_TCSR0_TF_SHIFT)                     /*!< ENET_TCSR0: TF Mask                     */
#define ENET_TCSR0_TF_SHIFT                      7                                                   /*!< ENET_TCSR0: TF Position                 */
/* ------- TCCR0 Bit Fields                         ------ */
#define ENET_TCCR0_TCC_MASK                      (0xFFFFFFFFUL << ENET_TCCR0_TCC_SHIFT)              /*!< ENET_TCCR0: TCC Mask                    */
#define ENET_TCCR0_TCC_SHIFT                     0                                                   /*!< ENET_TCCR0: TCC Position                */
#define ENET_TCCR0_TCC(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_TCCR0_TCC_SHIFT))&ENET_TCCR0_TCC_MASK) /*!< ENET_TCCR0                              */
/* ------- TCSR1 Bit Fields                         ------ */
#define ENET_TCSR1_TDRE_MASK                     (0x01UL << ENET_TCSR1_TDRE_SHIFT)                   /*!< ENET_TCSR1: TDRE Mask                   */
#define ENET_TCSR1_TDRE_SHIFT                    0                                                   /*!< ENET_TCSR1: TDRE Position               */
#define ENET_TCSR1_TMODE_MASK                    (0x0FUL << ENET_TCSR1_TMODE_SHIFT)                  /*!< ENET_TCSR1: TMODE Mask                  */
#define ENET_TCSR1_TMODE_SHIFT                   2                                                   /*!< ENET_TCSR1: TMODE Position              */
#define ENET_TCSR1_TMODE(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_TCSR1_TMODE_SHIFT))&ENET_TCSR1_TMODE_MASK) /*!< ENET_TCSR1                              */
#define ENET_TCSR1_TIE_MASK                      (0x01UL << ENET_TCSR1_TIE_SHIFT)                    /*!< ENET_TCSR1: TIE Mask                    */
#define ENET_TCSR1_TIE_SHIFT                     6                                                   /*!< ENET_TCSR1: TIE Position                */
#define ENET_TCSR1_TF_MASK                       (0x01UL << ENET_TCSR1_TF_SHIFT)                     /*!< ENET_TCSR1: TF Mask                     */
#define ENET_TCSR1_TF_SHIFT                      7                                                   /*!< ENET_TCSR1: TF Position                 */
/* ------- TCCR1 Bit Fields                         ------ */
#define ENET_TCCR1_TCC_MASK                      (0xFFFFFFFFUL << ENET_TCCR1_TCC_SHIFT)              /*!< ENET_TCCR1: TCC Mask                    */
#define ENET_TCCR1_TCC_SHIFT                     0                                                   /*!< ENET_TCCR1: TCC Position                */
#define ENET_TCCR1_TCC(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_TCCR1_TCC_SHIFT))&ENET_TCCR1_TCC_MASK) /*!< ENET_TCCR1                              */
/* ------- TCSR2 Bit Fields                         ------ */
#define ENET_TCSR2_TDRE_MASK                     (0x01UL << ENET_TCSR2_TDRE_SHIFT)                   /*!< ENET_TCSR2: TDRE Mask                   */
#define ENET_TCSR2_TDRE_SHIFT                    0                                                   /*!< ENET_TCSR2: TDRE Position               */
#define ENET_TCSR2_TMODE_MASK                    (0x0FUL << ENET_TCSR2_TMODE_SHIFT)                  /*!< ENET_TCSR2: TMODE Mask                  */
#define ENET_TCSR2_TMODE_SHIFT                   2                                                   /*!< ENET_TCSR2: TMODE Position              */
#define ENET_TCSR2_TMODE(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_TCSR2_TMODE_SHIFT))&ENET_TCSR2_TMODE_MASK) /*!< ENET_TCSR2                              */
#define ENET_TCSR2_TIE_MASK                      (0x01UL << ENET_TCSR2_TIE_SHIFT)                    /*!< ENET_TCSR2: TIE Mask                    */
#define ENET_TCSR2_TIE_SHIFT                     6                                                   /*!< ENET_TCSR2: TIE Position                */
#define ENET_TCSR2_TF_MASK                       (0x01UL << ENET_TCSR2_TF_SHIFT)                     /*!< ENET_TCSR2: TF Mask                     */
#define ENET_TCSR2_TF_SHIFT                      7                                                   /*!< ENET_TCSR2: TF Position                 */
/* ------- TCCR2 Bit Fields                         ------ */
#define ENET_TCCR2_TCC_MASK                      (0xFFFFFFFFUL << ENET_TCCR2_TCC_SHIFT)              /*!< ENET_TCCR2: TCC Mask                    */
#define ENET_TCCR2_TCC_SHIFT                     0                                                   /*!< ENET_TCCR2: TCC Position                */
#define ENET_TCCR2_TCC(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_TCCR2_TCC_SHIFT))&ENET_TCCR2_TCC_MASK) /*!< ENET_TCCR2                              */
/* ------- TCSR3 Bit Fields                         ------ */
#define ENET_TCSR3_TDRE_MASK                     (0x01UL << ENET_TCSR3_TDRE_SHIFT)                   /*!< ENET_TCSR3: TDRE Mask                   */
#define ENET_TCSR3_TDRE_SHIFT                    0                                                   /*!< ENET_TCSR3: TDRE Position               */
#define ENET_TCSR3_TMODE_MASK                    (0x0FUL << ENET_TCSR3_TMODE_SHIFT)                  /*!< ENET_TCSR3: TMODE Mask                  */
#define ENET_TCSR3_TMODE_SHIFT                   2                                                   /*!< ENET_TCSR3: TMODE Position              */
#define ENET_TCSR3_TMODE(x)                      (((uint32_t)(((uint32_t)(x))<<ENET_TCSR3_TMODE_SHIFT))&ENET_TCSR3_TMODE_MASK) /*!< ENET_TCSR3                              */
#define ENET_TCSR3_TIE_MASK                      (0x01UL << ENET_TCSR3_TIE_SHIFT)                    /*!< ENET_TCSR3: TIE Mask                    */
#define ENET_TCSR3_TIE_SHIFT                     6                                                   /*!< ENET_TCSR3: TIE Position                */
#define ENET_TCSR3_TF_MASK                       (0x01UL << ENET_TCSR3_TF_SHIFT)                     /*!< ENET_TCSR3: TF Mask                     */
#define ENET_TCSR3_TF_SHIFT                      7                                                   /*!< ENET_TCSR3: TF Position                 */
/* ------- TCCR3 Bit Fields                         ------ */
#define ENET_TCCR3_TCC_MASK                      (0xFFFFFFFFUL << ENET_TCCR3_TCC_SHIFT)              /*!< ENET_TCCR3: TCC Mask                    */
#define ENET_TCCR3_TCC_SHIFT                     0                                                   /*!< ENET_TCCR3: TCC Position                */
#define ENET_TCCR3_TCC(x)                        (((uint32_t)(((uint32_t)(x))<<ENET_TCCR3_TCC_SHIFT))&ENET_TCCR3_TCC_MASK) /*!< ENET_TCCR3                              */
/**
 * @} */ /* End group ENET_Register_Masks_GROUP 
 */

