podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup FMC_Register_Masks_GROUP FMC Register Masks
* @brief Register Masks for FMC
* @{
*/
/* ------- PFAPR Bit Fields                         ------ */
#define FMC_PFAPR_M0AP_MASK                      (0x03UL << FMC_PFAPR_M0AP_SHIFT)                    /*!< FMC_PFAPR: M0AP Mask                    */
#define FMC_PFAPR_M0AP_SHIFT                     0                                                   /*!< FMC_PFAPR: M0AP Position                */
#define FMC_PFAPR_M0AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M0AP_SHIFT))&FMC_PFAPR_M0AP_MASK) /*!< FMC_PFAPR                               */
#define FMC_PFAPR_M1AP_MASK                      (0x03UL << FMC_PFAPR_M1AP_SHIFT)                    /*!< FMC_PFAPR: M1AP Mask                    */
#define FMC_PFAPR_M1AP_SHIFT                     2                                                   /*!< FMC_PFAPR: M1AP Position                */
#define FMC_PFAPR_M1AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M1AP_SHIFT))&FMC_PFAPR_M1AP_MASK) /*!< FMC_PFAPR                               */
#define FMC_PFAPR_M2AP_MASK                      (0x03UL << FMC_PFAPR_M2AP_SHIFT)                    /*!< FMC_PFAPR: M2AP Mask                    */
#define FMC_PFAPR_M2AP_SHIFT                     4                                                   /*!< FMC_PFAPR: M2AP Position                */
#define FMC_PFAPR_M2AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M2AP_SHIFT))&FMC_PFAPR_M2AP_MASK) /*!< FMC_PFAPR                               */
#define FMC_PFAPR_M3AP_MASK                      (0x03UL << FMC_PFAPR_M3AP_SHIFT)                    /*!< FMC_PFAPR: M3AP Mask                    */
#define FMC_PFAPR_M3AP_SHIFT                     6                                                   /*!< FMC_PFAPR: M3AP Position                */
#define FMC_PFAPR_M3AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M3AP_SHIFT))&FMC_PFAPR_M3AP_MASK) /*!< FMC_PFAPR                               */
#define FMC_PFAPR_M4AP_MASK                      (0x03UL << FMC_PFAPR_M4AP_SHIFT)                    /*!< FMC_PFAPR: M4AP Mask                    */
#define FMC_PFAPR_M4AP_SHIFT                     8                                                   /*!< FMC_PFAPR: M4AP Position                */
#define FMC_PFAPR_M4AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M4AP_SHIFT))&FMC_PFAPR_M4AP_MASK) /*!< FMC_PFAPR                               */
#define FMC_PFAPR_M5AP_MASK                      (0x03UL << FMC_PFAPR_M5AP_SHIFT)                    /*!< FMC_PFAPR: M5AP Mask                    */
#define FMC_PFAPR_M5AP_SHIFT                     10                                                  /*!< FMC_PFAPR: M5AP Position                */
#define FMC_PFAPR_M5AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M5AP_SHIFT))&FMC_PFAPR_M5AP_MASK) /*!< FMC_PFAPR                               */
#define FMC_PFAPR_M6AP_MASK                      (0x03UL << FMC_PFAPR_M6AP_SHIFT)                    /*!< FMC_PFAPR: M6AP Mask                    */
#define FMC_PFAPR_M6AP_SHIFT                     12                                                  /*!< FMC_PFAPR: M6AP Position                */
#define FMC_PFAPR_M6AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M6AP_SHIFT))&FMC_PFAPR_M6AP_MASK) /*!< FMC_PFAPR                               */
#define FMC_PFAPR_M7AP_MASK                      (0x03UL << FMC_PFAPR_M7AP_SHIFT)                    /*!< FMC_PFAPR: M7AP Mask                    */
#define FMC_PFAPR_M7AP_SHIFT                     14                                                  /*!< FMC_PFAPR: M7AP Position                */
#define FMC_PFAPR_M7AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M7AP_SHIFT))&FMC_PFAPR_M7AP_MASK) /*!< FMC_PFAPR                               */
#define FMC_PFAPR_M0PFD_MASK                     (0x01UL << FMC_PFAPR_M0PFD_SHIFT)                   /*!< FMC_PFAPR: M0PFD Mask                   */
#define FMC_PFAPR_M0PFD_SHIFT                    16                                                  /*!< FMC_PFAPR: M0PFD Position               */
#define FMC_PFAPR_M1PFD_MASK                     (0x01UL << FMC_PFAPR_M1PFD_SHIFT)                   /*!< FMC_PFAPR: M1PFD Mask                   */
#define FMC_PFAPR_M1PFD_SHIFT                    17                                                  /*!< FMC_PFAPR: M1PFD Position               */
#define FMC_PFAPR_M2PFD_MASK                     (0x01UL << FMC_PFAPR_M2PFD_SHIFT)                   /*!< FMC_PFAPR: M2PFD Mask                   */
#define FMC_PFAPR_M2PFD_SHIFT                    18                                                  /*!< FMC_PFAPR: M2PFD Position               */
#define FMC_PFAPR_M3PFD_MASK                     (0x01UL << FMC_PFAPR_M3PFD_SHIFT)                   /*!< FMC_PFAPR: M3PFD Mask                   */
#define FMC_PFAPR_M3PFD_SHIFT                    19                                                  /*!< FMC_PFAPR: M3PFD Position               */
#define FMC_PFAPR_M4PFD_MASK                     (0x01UL << FMC_PFAPR_M4PFD_SHIFT)                   /*!< FMC_PFAPR: M4PFD Mask                   */
#define FMC_PFAPR_M4PFD_SHIFT                    20                                                  /*!< FMC_PFAPR: M4PFD Position               */
#define FMC_PFAPR_M5PFD_MASK                     (0x01UL << FMC_PFAPR_M5PFD_SHIFT)                   /*!< FMC_PFAPR: M5PFD Mask                   */
#define FMC_PFAPR_M5PFD_SHIFT                    21                                                  /*!< FMC_PFAPR: M5PFD Position               */
#define FMC_PFAPR_M6PFD_MASK                     (0x01UL << FMC_PFAPR_M6PFD_SHIFT)                   /*!< FMC_PFAPR: M6PFD Mask                   */
#define FMC_PFAPR_M6PFD_SHIFT                    22                                                  /*!< FMC_PFAPR: M6PFD Position               */
#define FMC_PFAPR_M7PFD_MASK                     (0x01UL << FMC_PFAPR_M7PFD_SHIFT)                   /*!< FMC_PFAPR: M7PFD Mask                   */
#define FMC_PFAPR_M7PFD_SHIFT                    23                                                  /*!< FMC_PFAPR: M7PFD Position               */
/* ------- PFB01CR Bit Fields                       ------ */
#define FMC_PFB01CR_B01SEBE_MASK                 (0x01UL << FMC_PFB01CR_B01SEBE_SHIFT)               /*!< FMC_PFB01CR: B01SEBE Mask               */
#define FMC_PFB01CR_B01SEBE_SHIFT                0                                                   /*!< FMC_PFB01CR: B01SEBE Position           */
#define FMC_PFB01CR_B01IPE_MASK                  (0x01UL << FMC_PFB01CR_B01IPE_SHIFT)                /*!< FMC_PFB01CR: B01IPE Mask                */
#define FMC_PFB01CR_B01IPE_SHIFT                 1                                                   /*!< FMC_PFB01CR: B01IPE Position            */
#define FMC_PFB01CR_B01DPE_MASK                  (0x01UL << FMC_PFB01CR_B01DPE_SHIFT)                /*!< FMC_PFB01CR: B01DPE Mask                */
#define FMC_PFB01CR_B01DPE_SHIFT                 2                                                   /*!< FMC_PFB01CR: B01DPE Position            */
#define FMC_PFB01CR_B01ICE_MASK                  (0x01UL << FMC_PFB01CR_B01ICE_SHIFT)                /*!< FMC_PFB01CR: B01ICE Mask                */
#define FMC_PFB01CR_B01ICE_SHIFT                 3                                                   /*!< FMC_PFB01CR: B01ICE Position            */
#define FMC_PFB01CR_B01DCE_MASK                  (0x01UL << FMC_PFB01CR_B01DCE_SHIFT)                /*!< FMC_PFB01CR: B01DCE Mask                */
#define FMC_PFB01CR_B01DCE_SHIFT                 4                                                   /*!< FMC_PFB01CR: B01DCE Position            */
#define FMC_PFB01CR_CRC_MASK                     (0x07UL << FMC_PFB01CR_CRC_SHIFT)                   /*!< FMC_PFB01CR: CRC Mask                   */
#define FMC_PFB01CR_CRC_SHIFT                    5                                                   /*!< FMC_PFB01CR: CRC Position               */
#define FMC_PFB01CR_CRC(x)                       (((uint32_t)(((uint32_t)(x))<<FMC_PFB01CR_CRC_SHIFT))&FMC_PFB01CR_CRC_MASK) /*!< FMC_PFB01CR                             */
#define FMC_PFB01CR_B01MW_MASK                   (0x03UL << FMC_PFB01CR_B01MW_SHIFT)                 /*!< FMC_PFB01CR: B01MW Mask                 */
#define FMC_PFB01CR_B01MW_SHIFT                  17                                                  /*!< FMC_PFB01CR: B01MW Position             */
#define FMC_PFB01CR_B01MW(x)                     (((uint32_t)(((uint32_t)(x))<<FMC_PFB01CR_B01MW_SHIFT))&FMC_PFB01CR_B01MW_MASK) /*!< FMC_PFB01CR                             */
#define FMC_PFB01CR_S_B_INV_MASK                 (0x01UL << FMC_PFB01CR_S_B_INV_SHIFT)               /*!< FMC_PFB01CR: S_B_INV Mask               */
#define FMC_PFB01CR_S_B_INV_SHIFT                19                                                  /*!< FMC_PFB01CR: S_B_INV Position           */
#define FMC_PFB01CR_CINV_WAY_MASK                (0x0FUL << FMC_PFB01CR_CINV_WAY_SHIFT)              /*!< FMC_PFB01CR: CINV_WAY Mask              */
#define FMC_PFB01CR_CINV_WAY_SHIFT               20                                                  /*!< FMC_PFB01CR: CINV_WAY Position          */
#define FMC_PFB01CR_CINV_WAY(x)                  (((uint32_t)(((uint32_t)(x))<<FMC_PFB01CR_CINV_WAY_SHIFT))&FMC_PFB01CR_CINV_WAY_MASK) /*!< FMC_PFB01CR                             */
#define FMC_PFB01CR_CLCK_WAY_MASK                (0x0FUL << FMC_PFB01CR_CLCK_WAY_SHIFT)              /*!< FMC_PFB01CR: CLCK_WAY Mask              */
#define FMC_PFB01CR_CLCK_WAY_SHIFT               24                                                  /*!< FMC_PFB01CR: CLCK_WAY Position          */
#define FMC_PFB01CR_CLCK_WAY(x)                  (((uint32_t)(((uint32_t)(x))<<FMC_PFB01CR_CLCK_WAY_SHIFT))&FMC_PFB01CR_CLCK_WAY_MASK) /*!< FMC_PFB01CR                             */
#define FMC_PFB01CR_B01RWSC_MASK                 (0x0FUL << FMC_PFB01CR_B01RWSC_SHIFT)               /*!< FMC_PFB01CR: B01RWSC Mask               */
#define FMC_PFB01CR_B01RWSC_SHIFT                28                                                  /*!< FMC_PFB01CR: B01RWSC Position           */
#define FMC_PFB01CR_B01RWSC(x)                   (((uint32_t)(((uint32_t)(x))<<FMC_PFB01CR_B01RWSC_SHIFT))&FMC_PFB01CR_B01RWSC_MASK) /*!< FMC_PFB01CR                             */
/* ------- PFB23CR Bit Fields                       ------ */
#define FMC_PFB23CR_B23SEBE_MASK                 (0x01UL << FMC_PFB23CR_B23SEBE_SHIFT)               /*!< FMC_PFB23CR: B23SEBE Mask               */
#define FMC_PFB23CR_B23SEBE_SHIFT                0                                                   /*!< FMC_PFB23CR: B23SEBE Position           */
#define FMC_PFB23CR_B23IPE_MASK                  (0x01UL << FMC_PFB23CR_B23IPE_SHIFT)                /*!< FMC_PFB23CR: B23IPE Mask                */
#define FMC_PFB23CR_B23IPE_SHIFT                 1                                                   /*!< FMC_PFB23CR: B23IPE Position            */
#define FMC_PFB23CR_B23DPE_MASK                  (0x01UL << FMC_PFB23CR_B23DPE_SHIFT)                /*!< FMC_PFB23CR: B23DPE Mask                */
#define FMC_PFB23CR_B23DPE_SHIFT                 2                                                   /*!< FMC_PFB23CR: B23DPE Position            */
#define FMC_PFB23CR_B23ICE_MASK                  (0x01UL << FMC_PFB23CR_B23ICE_SHIFT)                /*!< FMC_PFB23CR: B23ICE Mask                */
#define FMC_PFB23CR_B23ICE_SHIFT                 3                                                   /*!< FMC_PFB23CR: B23ICE Position            */
#define FMC_PFB23CR_B23DCE_MASK                  (0x01UL << FMC_PFB23CR_B23DCE_SHIFT)                /*!< FMC_PFB23CR: B23DCE Mask                */
#define FMC_PFB23CR_B23DCE_SHIFT                 4                                                   /*!< FMC_PFB23CR: B23DCE Position            */
#define FMC_PFB23CR_B23MW_MASK                   (0x03UL << FMC_PFB23CR_B23MW_SHIFT)                 /*!< FMC_PFB23CR: B23MW Mask                 */
#define FMC_PFB23CR_B23MW_SHIFT                  17                                                  /*!< FMC_PFB23CR: B23MW Position             */
#define FMC_PFB23CR_B23MW(x)                     (((uint32_t)(((uint32_t)(x))<<FMC_PFB23CR_B23MW_SHIFT))&FMC_PFB23CR_B23MW_MASK) /*!< FMC_PFB23CR                             */
#define FMC_PFB23CR_B23RWSC_MASK                 (0x0FUL << FMC_PFB23CR_B23RWSC_SHIFT)               /*!< FMC_PFB23CR: B23RWSC Mask               */
#define FMC_PFB23CR_B23RWSC_SHIFT                28                                                  /*!< FMC_PFB23CR: B23RWSC Position           */
#define FMC_PFB23CR_B23RWSC(x)                   (((uint32_t)(((uint32_t)(x))<<FMC_PFB23CR_B23RWSC_SHIFT))&FMC_PFB23CR_B23RWSC_MASK) /*!< FMC_PFB23CR                             */
/* ------- S0 Bit Fields                            ------ */
#define FMC_TAGVD0_valid_MASK                    (0x01UL << FMC_TAGVD0_valid_SHIFT)                  /*!< FMC_TAGVD0: valid Mask                  */
#define FMC_TAGVD0_valid_SHIFT                   0                                                   /*!< FMC_TAGVD0: valid Position              */
#define FMC_TAGVD0_tag_MASK                      (0x3FFFUL << FMC_TAGVD0_tag_SHIFT)                  /*!< FMC_TAGVD0: tag Mask                    */
#define FMC_TAGVD0_tag_SHIFT                     6                                                   /*!< FMC_TAGVD0: tag Position                */
#define FMC_TAGVD0_tag(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_TAGVD0_tag_SHIFT))&FMC_TAGVD0_tag_MASK) /*!< FMC_TAGVD0                              */
/* ------- S0UM Bit Fields                          ------ */
#define FMC_DATAW0UM_data_MASK                   (0xFFFFFFFFUL << FMC_DATAW0UM_data_SHIFT)           /*!< FMC_DATAW0UM: data Mask                 */
#define FMC_DATAW0UM_data_SHIFT                  0                                                   /*!< FMC_DATAW0UM: data Position             */
#define FMC_DATAW0UM_data(x)                     (((uint32_t)(((uint32_t)(x))<<FMC_DATAW0UM_data_SHIFT))&FMC_DATAW0UM_data_MASK) /*!< FMC_DATAW0UM                            */
/* ------- S0MU Bit Fields                          ------ */
#define FMC_DATAW0MU_data_MASK                   (0xFFFFFFFFUL << FMC_DATAW0MU_data_SHIFT)           /*!< FMC_DATAW0MU: data Mask                 */
#define FMC_DATAW0MU_data_SHIFT                  0                                                   /*!< FMC_DATAW0MU: data Position             */
#define FMC_DATAW0MU_data(x)                     (((uint32_t)(((uint32_t)(x))<<FMC_DATAW0MU_data_SHIFT))&FMC_DATAW0MU_data_MASK) /*!< FMC_DATAW0MU                            */
/* ------- S0ML Bit Fields                          ------ */
#define FMC_DATAW0ML_data_MASK                   (0xFFFFFFFFUL << FMC_DATAW0ML_data_SHIFT)           /*!< FMC_DATAW0ML: data Mask                 */
#define FMC_DATAW0ML_data_SHIFT                  0                                                   /*!< FMC_DATAW0ML: data Position             */
#define FMC_DATAW0ML_data(x)                     (((uint32_t)(((uint32_t)(x))<<FMC_DATAW0ML_data_SHIFT))&FMC_DATAW0ML_data_MASK) /*!< FMC_DATAW0ML                            */
/* ------- S0LM Bit Fields                          ------ */
#define FMC_DATAW0LM_data_MASK                   (0xFFFFFFFFUL << FMC_DATAW0LM_data_SHIFT)           /*!< FMC_DATAW0LM: data Mask                 */
#define FMC_DATAW0LM_data_SHIFT                  0                                                   /*!< FMC_DATAW0LM: data Position             */
#define FMC_DATAW0LM_data(x)                     (((uint32_t)(((uint32_t)(x))<<FMC_DATAW0LM_data_SHIFT))&FMC_DATAW0LM_data_MASK) /*!< FMC_DATAW0LM                            */
/**
 * @} */ /* End group FMC_Register_Masks_GROUP 
 */

/* FMC - Peripheral instance base addresses */
#define FMC_BasePtr                    0x4001F000UL //!< Peripheral base address
#define FMC                            ((FMC_Type *) FMC_BasePtr) //!< Freescale base pointer
#define FMC_BASE_PTR                   (FMC) //!< Freescale style base pointer
/**
 * @} */ /* End group FMC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTFE_Peripheral_access_layer_GROUP FTFE Peripheral Access Layer
* @brief C Struct for FTFE
* @{
*/

/* ================================================================================ */
/* ================           FTFE (file:FTFE_FEPROT_FDPROT)       ================ */
/* ================================================================================ */

/**
 * @brief Flash Memory Interface
 */
/**
* @addtogroup FTFE_structs_GROUP FTFE struct
* @brief Struct for FTFE
* @{
*/
typedef struct {                                /*       FTFE Structure                                               */
   __IO uint8_t   FSTAT;                        /**< 0000: Flash Status Register                                        */
   __IO uint8_t   FCNFG;                        /**< 0001: Flash Configuration Register                                 */
   __I  uint8_t   FSEC;                         /**< 0002: Flash Security Register                                      */
   __I  uint8_t   FOPT;                         /**< 0003: Flash Option Register                                        */
   __IO uint8_t   FCCOB3;                       /**< 0004: FCCOB 3 - Usually Flash address [7..0]                       */
   __IO uint8_t   FCCOB2;                       /**< 0005: FCCOB 2 - Usually Flash address [15..8]                      */
   __IO uint8_t   FCCOB1;                       /**< 0006: FCCOB 1 - Usually Flash address [23..16]                     */
   __IO uint8_t   FCCOB0;                       /**< 0007: FCCOB 0 - Usually FCMD (Flash command)                       */
   __IO uint8_t   FCCOB7;                       /**< 0008: FCCOB 7 - Usually Data Byte 3                                */
   __IO uint8_t   FCCOB6;                       /**< 0009: FCCOB 6 - Usually Data Byte 2                                */
   __IO uint8_t   FCCOB5;                       /**< 000A: FCCOB 5 - Usually Data Byte 1                                */
   __IO uint8_t   FCCOB4;                       /**< 000B: FCCOB 4 - Usually Data Byte 0                                */
   __IO uint8_t   FCCOBB;                       /**< 000C: FCCOB B - Usually Data Byte 7                                */
   __IO uint8_t   FCCOBA;                       /**< 000D: FCCOB A - Usually Data Byte 6                                */
   __IO uint8_t   FCCOB9;                       /**< 000E: FCCOB 9 - Usually Data Byte 5                                */
   __IO uint8_t   FCCOB8;                       /**< 000F: FCCOB 8 - Usually Data Byte 4                                */
   __IO uint8_t   FPROT3;                       /**< 0010: Program Flash Protection                                     */
   __IO uint8_t   FPROT2;                       /**< 0011: Program Flash Protection                                     */
   __IO uint8_t   FPROT1;                       /**< 0012: Program Flash Protection                                     */
   __IO uint8_t   FPROT0;                       /**< 0013: Program Flash Protection                                     */
   __I  uint16_t  RESERVED0;                   
   __IO uint8_t   FEPROT;                       /**< 0016: EEPROM Protection Register                                   */
   __IO uint8_t   FDPROT;                       /**< 0017: Data Flash Protection Register                               */
} FTFE_Type;

/**
 * @} */ /* End group FTFE_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTFE' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

