podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup FTFE_Register_Masks_GROUP FTFE Register Masks
* @brief Register Masks for FTFE
* @{
*/
/* ------- FSTAT Bit Fields                         ------ */
#define FTFE_FSTAT_MGSTAT0_MASK                  (0x01UL << FTFE_FSTAT_MGSTAT0_SHIFT)                /*!< FTFE_FSTAT: MGSTAT0 Mask                */
#define FTFE_FSTAT_MGSTAT0_SHIFT                 0                                                   /*!< FTFE_FSTAT: MGSTAT0 Position            */
#define FTFE_FSTAT_FPVIOL_MASK                   (0x01UL << FTFE_FSTAT_FPVIOL_SHIFT)                 /*!< FTFE_FSTAT: FPVIOL Mask                 */
#define FTFE_FSTAT_FPVIOL_SHIFT                  4                                                   /*!< FTFE_FSTAT: FPVIOL Position             */
#define FTFE_FSTAT_ACCERR_MASK                   (0x01UL << FTFE_FSTAT_ACCERR_SHIFT)                 /*!< FTFE_FSTAT: ACCERR Mask                 */
#define FTFE_FSTAT_ACCERR_SHIFT                  5                                                   /*!< FTFE_FSTAT: ACCERR Position             */
#define FTFE_FSTAT_RDCOLERR_MASK                 (0x01UL << FTFE_FSTAT_RDCOLERR_SHIFT)               /*!< FTFE_FSTAT: RDCOLERR Mask               */
#define FTFE_FSTAT_RDCOLERR_SHIFT                6                                                   /*!< FTFE_FSTAT: RDCOLERR Position           */
#define FTFE_FSTAT_CCIF_MASK                     (0x01UL << FTFE_FSTAT_CCIF_SHIFT)                   /*!< FTFE_FSTAT: CCIF Mask                   */
#define FTFE_FSTAT_CCIF_SHIFT                    7                                                   /*!< FTFE_FSTAT: CCIF Position               */
/* ------- FCNFG Bit Fields                         ------ */
#define FTFE_FCNFG_EEERDY_MASK                   (0x01UL << FTFE_FCNFG_EEERDY_SHIFT)                 /*!< FTFE_FCNFG: EEERDY Mask                 */
#define FTFE_FCNFG_EEERDY_SHIFT                  0                                                   /*!< FTFE_FCNFG: EEERDY Position             */
#define FTFE_FCNFG_RAMRDY_MASK                   (0x01UL << FTFE_FCNFG_RAMRDY_SHIFT)                 /*!< FTFE_FCNFG: RAMRDY Mask                 */
#define FTFE_FCNFG_RAMRDY_SHIFT                  1                                                   /*!< FTFE_FCNFG: RAMRDY Position             */
#define FTFE_FCNFG_PFLSH_MASK                    (0x01UL << FTFE_FCNFG_PFLSH_SHIFT)                  /*!< FTFE_FCNFG: PFLSH Mask                  */
#define FTFE_FCNFG_PFLSH_SHIFT                   2                                                   /*!< FTFE_FCNFG: PFLSH Position              */
#define FTFE_FCNFG_SWAP_MASK                     (0x01UL << FTFE_FCNFG_SWAP_SHIFT)                   /*!< FTFE_FCNFG: SWAP Mask                   */
#define FTFE_FCNFG_SWAP_SHIFT                    3                                                   /*!< FTFE_FCNFG: SWAP Position               */
#define FTFE_FCNFG_ERSSUSP_MASK                  (0x01UL << FTFE_FCNFG_ERSSUSP_SHIFT)                /*!< FTFE_FCNFG: ERSSUSP Mask                */
#define FTFE_FCNFG_ERSSUSP_SHIFT                 4                                                   /*!< FTFE_FCNFG: ERSSUSP Position            */
#define FTFE_FCNFG_ERSAREQ_MASK                  (0x01UL << FTFE_FCNFG_ERSAREQ_SHIFT)                /*!< FTFE_FCNFG: ERSAREQ Mask                */
#define FTFE_FCNFG_ERSAREQ_SHIFT                 5                                                   /*!< FTFE_FCNFG: ERSAREQ Position            */
#define FTFE_FCNFG_RDCOLLIE_MASK                 (0x01UL << FTFE_FCNFG_RDCOLLIE_SHIFT)               /*!< FTFE_FCNFG: RDCOLLIE Mask               */
#define FTFE_FCNFG_RDCOLLIE_SHIFT                6                                                   /*!< FTFE_FCNFG: RDCOLLIE Position           */
#define FTFE_FCNFG_CCIE_MASK                     (0x01UL << FTFE_FCNFG_CCIE_SHIFT)                   /*!< FTFE_FCNFG: CCIE Mask                   */
#define FTFE_FCNFG_CCIE_SHIFT                    7                                                   /*!< FTFE_FCNFG: CCIE Position               */
/* ------- FSEC Bit Fields                          ------ */
#define FTFE_FSEC_SEC_MASK                       (0x03UL << FTFE_FSEC_SEC_SHIFT)                     /*!< FTFE_FSEC: SEC Mask                     */
#define FTFE_FSEC_SEC_SHIFT                      0                                                   /*!< FTFE_FSEC: SEC Position                 */
#define FTFE_FSEC_SEC(x)                         (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_SEC_SHIFT))&FTFE_FSEC_SEC_MASK) /*!< FTFE_FSEC                               */
#define FTFE_FSEC_FSLACC_MASK                    (0x03UL << FTFE_FSEC_FSLACC_SHIFT)                  /*!< FTFE_FSEC: FSLACC Mask                  */
#define FTFE_FSEC_FSLACC_SHIFT                   2                                                   /*!< FTFE_FSEC: FSLACC Position              */
#define FTFE_FSEC_FSLACC(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_FSLACC_SHIFT))&FTFE_FSEC_FSLACC_MASK) /*!< FTFE_FSEC                               */
#define FTFE_FSEC_MEEN_MASK                      (0x03UL << FTFE_FSEC_MEEN_SHIFT)                    /*!< FTFE_FSEC: MEEN Mask                    */
#define FTFE_FSEC_MEEN_SHIFT                     4                                                   /*!< FTFE_FSEC: MEEN Position                */
#define FTFE_FSEC_MEEN(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_MEEN_SHIFT))&FTFE_FSEC_MEEN_MASK) /*!< FTFE_FSEC                               */
#define FTFE_FSEC_KEYEN_MASK                     (0x03UL << FTFE_FSEC_KEYEN_SHIFT)                   /*!< FTFE_FSEC: KEYEN Mask                   */
#define FTFE_FSEC_KEYEN_SHIFT                    6                                                   /*!< FTFE_FSEC: KEYEN Position               */
#define FTFE_FSEC_KEYEN(x)                       (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_KEYEN_SHIFT))&FTFE_FSEC_KEYEN_MASK) /*!< FTFE_FSEC                               */
/* ------- FOPT Bit Fields                          ------ */
#define FTFE_FOPT_OPT_MASK                       (0xFFUL << FTFE_FOPT_OPT_SHIFT)                     /*!< FTFE_FOPT: OPT Mask                     */
#define FTFE_FOPT_OPT_SHIFT                      0                                                   /*!< FTFE_FOPT: OPT Position                 */
#define FTFE_FOPT_OPT(x)                         (((uint8_t)(((uint8_t)(x))<<FTFE_FOPT_OPT_SHIFT))&FTFE_FOPT_OPT_MASK) /*!< FTFE_FOPT                               */
/* ------- FCCOB Bit Fields                         ------ */
#define FTFE_FCCOB_CCOBn_MASK                    (0xFFUL << FTFE_FCCOB_CCOBn_SHIFT)                  /*!< FTFE_FCCOB: CCOBn Mask                  */
#define FTFE_FCCOB_CCOBn_SHIFT                   0                                                   /*!< FTFE_FCCOB: CCOBn Position              */
#define FTFE_FCCOB_CCOBn(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB_CCOBn_SHIFT))&FTFE_FCCOB_CCOBn_MASK) /*!< FTFE_FCCOB                              */
/* ------- FPROT Bit Fields                         ------ */
#define FTFE_FPROT_PROT_MASK                     (0xFFUL << FTFE_FPROT_PROT_SHIFT)                   /*!< FTFE_FPROT: PROT Mask                   */
#define FTFE_FPROT_PROT_SHIFT                    0                                                   /*!< FTFE_FPROT: PROT Position               */
#define FTFE_FPROT_PROT(x)                       (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT_PROT_SHIFT))&FTFE_FPROT_PROT_MASK) /*!< FTFE_FPROT                              */
/* ------- FEPROT Bit Fields                        ------ */
#define FTFE_FEPROT_EPROT_MASK                   (0xFFUL << FTFE_FEPROT_EPROT_SHIFT)                 /*!< FTFE_FEPROT: EPROT Mask                 */
#define FTFE_FEPROT_EPROT_SHIFT                  0                                                   /*!< FTFE_FEPROT: EPROT Position             */
#define FTFE_FEPROT_EPROT(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FEPROT_EPROT_SHIFT))&FTFE_FEPROT_EPROT_MASK) /*!< FTFE_FEPROT                             */
/* ------- FDPROT Bit Fields                        ------ */
#define FTFE_FDPROT_DPROT_MASK                   (0xFFUL << FTFE_FDPROT_DPROT_SHIFT)                 /*!< FTFE_FDPROT: DPROT Mask                 */
#define FTFE_FDPROT_DPROT_SHIFT                  0                                                   /*!< FTFE_FDPROT: DPROT Position             */
#define FTFE_FDPROT_DPROT(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FDPROT_DPROT_SHIFT))&FTFE_FDPROT_DPROT_MASK) /*!< FTFE_FDPROT                             */
/**
 * @} */ /* End group FTFE_Register_Masks_GROUP 
 */

/* FTFE - Peripheral instance base addresses */
#define FTFE_BasePtr                   0x40020000UL //!< Peripheral base address
#define FTFE                           ((FTFE_Type *) FTFE_BasePtr) //!< Freescale base pointer
#define FTFE_BASE_PTR                  (FTFE) //!< Freescale style base pointer
/**
 * @} */ /* End group FTFE_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTM_Peripheral_access_layer_GROUP FTM Peripheral Access Layer
* @brief C Struct for FTM
* @{
*/

/* ================================================================================ */
/* ================           FTM0 (file:FTM0_8CH)                 ================ */
/* ================================================================================ */

/**
 * @brief FlexTimer Module (8 channels)
 */
/**
* @addtogroup FTM_structs_GROUP FTM struct
* @brief Struct for FTM
* @{
*/
typedef struct {                                /*       FTM0 Structure                                               */
   __IO uint32_t  SC;                           /**< 0000: Status and Control                                           */
   __IO uint32_t  CNT;                          /**< 0004: Counter                                                      */
   __IO uint32_t  MOD;                          /**< 0008: Modulo                                                       */
   struct {
      __IO uint32_t  CnSC;                      /**< 000C: Channel  Status and Control                                  */
      __IO uint32_t  CnV;                       /**< 0010: Channel  Value                                               */
   } CONTROLS[8];                               /**< 000C: (cluster: size=0x0040, 64)                                   */
   __IO uint32_t  CNTIN;                        /**< 004C: Counter Initial Value                                        */
   __IO uint32_t  STATUS;                       /**< 0050: Capture and Compare Status                                   */
   __IO uint32_t  MODE;                         /**< 0054: Features Mode Selection                                      */
   __IO uint32_t  SYNC;                         /**< 0058: Synchronization                                              */
   __IO uint32_t  OUTINIT;                      /**< 005C: Initial State for Channels Output                            */
   __IO uint32_t  OUTMASK;                      /**< 0060: Output Mask                                                  */
   __IO uint32_t  COMBINE;                      /**< 0064: Function for Linked Channels                                 */
   __IO uint32_t  DEADTIME;                     /**< 0068: Deadtime Insertion Control                                   */
   __IO uint32_t  EXTTRIG;                      /**< 006C: FTM External Trigger                                         */
   __IO uint32_t  POL;                          /**< 0070: Channels Polarity                                            */
   __IO uint32_t  FMS;                          /**< 0074: Fault Mode Status                                            */
   __IO uint32_t  FILTER;                       /**< 0078: Input Capture Filter Control                                 */
   __IO uint32_t  FLTCTRL;                      /**< 007C: Fault Control                                                */
   __IO uint32_t  QDCTRL;                       /**< 0080: Quadrature Decoder Control and Status                        */
   __IO uint32_t  CONF;                         /**< 0084: Configuration                                                */
   __IO uint32_t  FLTPOL;                       /**< 0088: FTM Fault Input Polarity                                     */
   __IO uint32_t  SYNCONF;                      /**< 008C: Synchronization Configuration                                */
   __IO uint32_t  INVCTRL;                      /**< 0090: FTM Inverting Control                                        */
   __IO uint32_t  SWOCTRL;                      /**< 0094: FTM Software Output Control                                  */
   __IO uint32_t  PWMLOAD;                      /**< 0098: FTM PWM Load                                                 */
} FTM_Type;

/**
 * @} */ /* End group FTM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTM0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

