podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/* ================================================================================ */
/* ================           LMEM (file:LMEM_0)                   ================ */
/* ================================================================================ */

/**
 * @brief Local Memory Controller
 */
/**
* @addtogroup LMEM_structs_GROUP LMEM struct
* @brief Struct for LMEM
* @{
*/
typedef struct {                                /*       LMEM Structure                                               */
   __IO uint32_t  PCCCR;                        /**< 0000: Cache control register                                       */
   __IO uint32_t  PCCLCR;                       /**< 0004: Cache line control register                                  */
   __IO uint32_t  PCCSAR;                       /**< 0008: Cache search address register                                */
   __IO uint32_t  PCCCVR;                       /**< 000C: Cache read/write value register                              */
   __I  uint32_t  RESERVED0[4];                
   __IO uint32_t  PCCRMR;                       /**< 0020: Cache regions mode register                                  */
   __I  uint32_t  RESERVED1[503];              
   __IO uint32_t  PSCCR;                        /**< 0800: Cache control register                                       */
   __IO uint32_t  PSCLCR;                       /**< 0804: Cache line control register                                  */
   __IO uint32_t  PSCSAR;                       /**< 0808: Cache search address register                                */
   __IO uint32_t  PSCCVR;                       /**< 080C: Cache read/write value register                              */
   __I  uint32_t  RESERVED2[4];                
   __IO uint32_t  PSCRMR;                       /**< 0820: Cache regions mode register                                  */
} LMEM_Type;

/**
 * @} */ /* End group LMEM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'LMEM' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup LMEM_Register_Masks_GROUP LMEM Register Masks
* @brief Register Masks for LMEM
* @{
*/
/* ------- PCCCR Bit Fields                         ------ */
#define LMEM_PCCCR_ENCACHE_MASK                  (0x01UL << LMEM_PCCCR_ENCACHE_SHIFT)                /*!< LMEM_PCCCR: ENCACHE Mask                */
#define LMEM_PCCCR_ENCACHE_SHIFT                 0                                                   /*!< LMEM_PCCCR: ENCACHE Position            */
#define LMEM_PCCCR_ENWRBUF_MASK                  (0x01UL << LMEM_PCCCR_ENWRBUF_SHIFT)                /*!< LMEM_PCCCR: ENWRBUF Mask                */
#define LMEM_PCCCR_ENWRBUF_SHIFT                 1                                                   /*!< LMEM_PCCCR: ENWRBUF Position            */
#define LMEM_PCCCR_INVW0_MASK                    (0x01UL << LMEM_PCCCR_INVW0_SHIFT)                  /*!< LMEM_PCCCR: INVW0 Mask                  */
#define LMEM_PCCCR_INVW0_SHIFT                   24                                                  /*!< LMEM_PCCCR: INVW0 Position              */
#define LMEM_PCCCR_PUSHW0_MASK                   (0x01UL << LMEM_PCCCR_PUSHW0_SHIFT)                 /*!< LMEM_PCCCR: PUSHW0 Mask                 */
#define LMEM_PCCCR_PUSHW0_SHIFT                  25                                                  /*!< LMEM_PCCCR: PUSHW0 Position             */
#define LMEM_PCCCR_INVW1_MASK                    (0x01UL << LMEM_PCCCR_INVW1_SHIFT)                  /*!< LMEM_PCCCR: INVW1 Mask                  */
#define LMEM_PCCCR_INVW1_SHIFT                   26                                                  /*!< LMEM_PCCCR: INVW1 Position              */
#define LMEM_PCCCR_PUSHW1_MASK                   (0x01UL << LMEM_PCCCR_PUSHW1_SHIFT)                 /*!< LMEM_PCCCR: PUSHW1 Mask                 */
#define LMEM_PCCCR_PUSHW1_SHIFT                  27                                                  /*!< LMEM_PCCCR: PUSHW1 Position             */
#define LMEM_PCCCR_GO_MASK                       (0x01UL << LMEM_PCCCR_GO_SHIFT)                     /*!< LMEM_PCCCR: GO Mask                     */
#define LMEM_PCCCR_GO_SHIFT                      31                                                  /*!< LMEM_PCCCR: GO Position                 */
/* ------- PCCLCR Bit Fields                        ------ */
#define LMEM_PCCLCR_LGO_MASK                     (0x01UL << LMEM_PCCLCR_LGO_SHIFT)                   /*!< LMEM_PCCLCR: LGO Mask                   */
#define LMEM_PCCLCR_LGO_SHIFT                    0                                                   /*!< LMEM_PCCLCR: LGO Position               */
#define LMEM_PCCLCR_CACHEADDR_MASK               (0x3FFUL << LMEM_PCCLCR_CACHEADDR_SHIFT)            /*!< LMEM_PCCLCR: CACHEADDR Mask             */
#define LMEM_PCCLCR_CACHEADDR_SHIFT              2                                                   /*!< LMEM_PCCLCR: CACHEADDR Position         */
#define LMEM_PCCLCR_CACHEADDR(x)                 (((uint32_t)(((uint32_t)(x))<<LMEM_PCCLCR_CACHEADDR_SHIFT))&LMEM_PCCLCR_CACHEADDR_MASK) /*!< LMEM_PCCLCR                             */
#define LMEM_PCCLCR_WSEL_MASK                    (0x01UL << LMEM_PCCLCR_WSEL_SHIFT)                  /*!< LMEM_PCCLCR: WSEL Mask                  */
#define LMEM_PCCLCR_WSEL_SHIFT                   14                                                  /*!< LMEM_PCCLCR: WSEL Position              */
#define LMEM_PCCLCR_TDSEL_MASK                   (0x01UL << LMEM_PCCLCR_TDSEL_SHIFT)                 /*!< LMEM_PCCLCR: TDSEL Mask                 */
#define LMEM_PCCLCR_TDSEL_SHIFT                  16                                                  /*!< LMEM_PCCLCR: TDSEL Position             */
#define LMEM_PCCLCR_LCIVB_MASK                   (0x01UL << LMEM_PCCLCR_LCIVB_SHIFT)                 /*!< LMEM_PCCLCR: LCIVB Mask                 */
#define LMEM_PCCLCR_LCIVB_SHIFT                  20                                                  /*!< LMEM_PCCLCR: LCIVB Position             */
#define LMEM_PCCLCR_LCIMB_MASK                   (0x01UL << LMEM_PCCLCR_LCIMB_SHIFT)                 /*!< LMEM_PCCLCR: LCIMB Mask                 */
#define LMEM_PCCLCR_LCIMB_SHIFT                  21                                                  /*!< LMEM_PCCLCR: LCIMB Position             */
#define LMEM_PCCLCR_LCWAY_MASK                   (0x01UL << LMEM_PCCLCR_LCWAY_SHIFT)                 /*!< LMEM_PCCLCR: LCWAY Mask                 */
#define LMEM_PCCLCR_LCWAY_SHIFT                  22                                                  /*!< LMEM_PCCLCR: LCWAY Position             */
#define LMEM_PCCLCR_LCMD_MASK                    (0x03UL << LMEM_PCCLCR_LCMD_SHIFT)                  /*!< LMEM_PCCLCR: LCMD Mask                  */
#define LMEM_PCCLCR_LCMD_SHIFT                   24                                                  /*!< LMEM_PCCLCR: LCMD Position              */
#define LMEM_PCCLCR_LCMD(x)                      (((uint32_t)(((uint32_t)(x))<<LMEM_PCCLCR_LCMD_SHIFT))&LMEM_PCCLCR_LCMD_MASK) /*!< LMEM_PCCLCR                             */
#define LMEM_PCCLCR_LADSEL_MASK                  (0x01UL << LMEM_PCCLCR_LADSEL_SHIFT)                /*!< LMEM_PCCLCR: LADSEL Mask                */
#define LMEM_PCCLCR_LADSEL_SHIFT                 26                                                  /*!< LMEM_PCCLCR: LADSEL Position            */
#define LMEM_PCCLCR_LACC_MASK                    (0x01UL << LMEM_PCCLCR_LACC_SHIFT)                  /*!< LMEM_PCCLCR: LACC Mask                  */
#define LMEM_PCCLCR_LACC_SHIFT                   27                                                  /*!< LMEM_PCCLCR: LACC Position              */
/* ------- PCCSAR Bit Fields                        ------ */
#define LMEM_PCCSAR_LGO_MASK                     (0x01UL << LMEM_PCCSAR_LGO_SHIFT)                   /*!< LMEM_PCCSAR: LGO Mask                   */
#define LMEM_PCCSAR_LGO_SHIFT                    0                                                   /*!< LMEM_PCCSAR: LGO Position               */
#define LMEM_PCCSAR_PHYADDR_MASK                 (0x3FFFFFFFUL << LMEM_PCCSAR_PHYADDR_SHIFT)         /*!< LMEM_PCCSAR: PHYADDR Mask               */
#define LMEM_PCCSAR_PHYADDR_SHIFT                2                                                   /*!< LMEM_PCCSAR: PHYADDR Position           */
#define LMEM_PCCSAR_PHYADDR(x)                   (((uint32_t)(((uint32_t)(x))<<LMEM_PCCSAR_PHYADDR_SHIFT))&LMEM_PCCSAR_PHYADDR_MASK) /*!< LMEM_PCCSAR                             */
/* ------- PCCCVR Bit Fields                        ------ */
#define LMEM_PCCCVR_DATA_MASK                    (0xFFFFFFFFUL << LMEM_PCCCVR_DATA_SHIFT)            /*!< LMEM_PCCCVR: DATA Mask                  */
#define LMEM_PCCCVR_DATA_SHIFT                   0                                                   /*!< LMEM_PCCCVR: DATA Position              */
#define LMEM_PCCCVR_DATA(x)                      (((uint32_t)(((uint32_t)(x))<<LMEM_PCCCVR_DATA_SHIFT))&LMEM_PCCCVR_DATA_MASK) /*!< LMEM_PCCCVR                             */
/* ------- PCCRMR Bit Fields                        ------ */
#define LMEM_PCCRMR_R15_MASK                     (0x03UL << LMEM_PCCRMR_R15_SHIFT)                   /*!< LMEM_PCCRMR: R15 Mask                   */
#define LMEM_PCCRMR_R15_SHIFT                    0                                                   /*!< LMEM_PCCRMR: R15 Position               */
#define LMEM_PCCRMR_R15(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R15_SHIFT))&LMEM_PCCRMR_R15_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R14_MASK                     (0x03UL << LMEM_PCCRMR_R14_SHIFT)                   /*!< LMEM_PCCRMR: R14 Mask                   */
#define LMEM_PCCRMR_R14_SHIFT                    2                                                   /*!< LMEM_PCCRMR: R14 Position               */
#define LMEM_PCCRMR_R14(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R14_SHIFT))&LMEM_PCCRMR_R14_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R13_MASK                     (0x03UL << LMEM_PCCRMR_R13_SHIFT)                   /*!< LMEM_PCCRMR: R13 Mask                   */
#define LMEM_PCCRMR_R13_SHIFT                    4                                                   /*!< LMEM_PCCRMR: R13 Position               */
#define LMEM_PCCRMR_R13(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R13_SHIFT))&LMEM_PCCRMR_R13_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R12_MASK                     (0x03UL << LMEM_PCCRMR_R12_SHIFT)                   /*!< LMEM_PCCRMR: R12 Mask                   */
#define LMEM_PCCRMR_R12_SHIFT                    6                                                   /*!< LMEM_PCCRMR: R12 Position               */
#define LMEM_PCCRMR_R12(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R12_SHIFT))&LMEM_PCCRMR_R12_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R11_MASK                     (0x03UL << LMEM_PCCRMR_R11_SHIFT)                   /*!< LMEM_PCCRMR: R11 Mask                   */
#define LMEM_PCCRMR_R11_SHIFT                    8                                                   /*!< LMEM_PCCRMR: R11 Position               */
#define LMEM_PCCRMR_R11(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R11_SHIFT))&LMEM_PCCRMR_R11_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R10_MASK                     (0x03UL << LMEM_PCCRMR_R10_SHIFT)                   /*!< LMEM_PCCRMR: R10 Mask                   */
#define LMEM_PCCRMR_R10_SHIFT                    10                                                  /*!< LMEM_PCCRMR: R10 Position               */
#define LMEM_PCCRMR_R10(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R10_SHIFT))&LMEM_PCCRMR_R10_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R9_MASK                      (0x03UL << LMEM_PCCRMR_R9_SHIFT)                    /*!< LMEM_PCCRMR: R9 Mask                    */
#define LMEM_PCCRMR_R9_SHIFT                     12                                                  /*!< LMEM_PCCRMR: R9 Position                */
#define LMEM_PCCRMR_R9(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R9_SHIFT))&LMEM_PCCRMR_R9_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R8_MASK                      (0x03UL << LMEM_PCCRMR_R8_SHIFT)                    /*!< LMEM_PCCRMR: R8 Mask                    */
#define LMEM_PCCRMR_R8_SHIFT                     14                                                  /*!< LMEM_PCCRMR: R8 Position                */
#define LMEM_PCCRMR_R8(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R8_SHIFT))&LMEM_PCCRMR_R8_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R7_MASK                      (0x03UL << LMEM_PCCRMR_R7_SHIFT)                    /*!< LMEM_PCCRMR: R7 Mask                    */
#define LMEM_PCCRMR_R7_SHIFT                     16                                                  /*!< LMEM_PCCRMR: R7 Position                */
#define LMEM_PCCRMR_R7(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R7_SHIFT))&LMEM_PCCRMR_R7_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R6_MASK                      (0x03UL << LMEM_PCCRMR_R6_SHIFT)                    /*!< LMEM_PCCRMR: R6 Mask                    */
#define LMEM_PCCRMR_R6_SHIFT                     18                                                  /*!< LMEM_PCCRMR: R6 Position                */
#define LMEM_PCCRMR_R6(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R6_SHIFT))&LMEM_PCCRMR_R6_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R5_MASK                      (0x03UL << LMEM_PCCRMR_R5_SHIFT)                    /*!< LMEM_PCCRMR: R5 Mask                    */
#define LMEM_PCCRMR_R5_SHIFT                     20                                                  /*!< LMEM_PCCRMR: R5 Position                */
#define LMEM_PCCRMR_R5(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R5_SHIFT))&LMEM_PCCRMR_R5_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R4_MASK                      (0x03UL << LMEM_PCCRMR_R4_SHIFT)                    /*!< LMEM_PCCRMR: R4 Mask                    */
#define LMEM_PCCRMR_R4_SHIFT                     22                                                  /*!< LMEM_PCCRMR: R4 Position                */
#define LMEM_PCCRMR_R4(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R4_SHIFT))&LMEM_PCCRMR_R4_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R3_MASK                      (0x03UL << LMEM_PCCRMR_R3_SHIFT)                    /*!< LMEM_PCCRMR: R3 Mask                    */
#define LMEM_PCCRMR_R3_SHIFT                     24                                                  /*!< LMEM_PCCRMR: R3 Position                */
#define LMEM_PCCRMR_R3(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R3_SHIFT))&LMEM_PCCRMR_R3_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R2_MASK                      (0x03UL << LMEM_PCCRMR_R2_SHIFT)                    /*!< LMEM_PCCRMR: R2 Mask                    */
#define LMEM_PCCRMR_R2_SHIFT                     26                                                  /*!< LMEM_PCCRMR: R2 Position                */
#define LMEM_PCCRMR_R2(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R2_SHIFT))&LMEM_PCCRMR_R2_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R1_MASK                      (0x03UL << LMEM_PCCRMR_R1_SHIFT)                    /*!< LMEM_PCCRMR: R1 Mask                    */
#define LMEM_PCCRMR_R1_SHIFT                     28                                                  /*!< LMEM_PCCRMR: R1 Position                */
#define LMEM_PCCRMR_R1(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R1_SHIFT))&LMEM_PCCRMR_R1_MASK) /*!< LMEM_PCCRMR                             */
#define LMEM_PCCRMR_R0_MASK                      (0x03UL << LMEM_PCCRMR_R0_SHIFT)                    /*!< LMEM_PCCRMR: R0 Mask                    */
#define LMEM_PCCRMR_R0_SHIFT                     30                                                  /*!< LMEM_PCCRMR: R0 Position                */
#define LMEM_PCCRMR_R0(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PCCRMR_R0_SHIFT))&LMEM_PCCRMR_R0_MASK) /*!< LMEM_PCCRMR                             */
/* ------- PSCCR Bit Fields                         ------ */
#define LMEM_PSCCR_ENCACHE_MASK                  (0x01UL << LMEM_PSCCR_ENCACHE_SHIFT)                /*!< LMEM_PSCCR: ENCACHE Mask                */
#define LMEM_PSCCR_ENCACHE_SHIFT                 0                                                   /*!< LMEM_PSCCR: ENCACHE Position            */
#define LMEM_PSCCR_ENWRBUF_MASK                  (0x01UL << LMEM_PSCCR_ENWRBUF_SHIFT)                /*!< LMEM_PSCCR: ENWRBUF Mask                */
#define LMEM_PSCCR_ENWRBUF_SHIFT                 1                                                   /*!< LMEM_PSCCR: ENWRBUF Position            */
#define LMEM_PSCCR_INVW0_MASK                    (0x01UL << LMEM_PSCCR_INVW0_SHIFT)                  /*!< LMEM_PSCCR: INVW0 Mask                  */
#define LMEM_PSCCR_INVW0_SHIFT                   24                                                  /*!< LMEM_PSCCR: INVW0 Position              */
#define LMEM_PSCCR_PUSHW0_MASK                   (0x01UL << LMEM_PSCCR_PUSHW0_SHIFT)                 /*!< LMEM_PSCCR: PUSHW0 Mask                 */
#define LMEM_PSCCR_PUSHW0_SHIFT                  25                                                  /*!< LMEM_PSCCR: PUSHW0 Position             */
#define LMEM_PSCCR_INVW1_MASK                    (0x01UL << LMEM_PSCCR_INVW1_SHIFT)                  /*!< LMEM_PSCCR: INVW1 Mask                  */
#define LMEM_PSCCR_INVW1_SHIFT                   26                                                  /*!< LMEM_PSCCR: INVW1 Position              */
#define LMEM_PSCCR_PUSHW1_MASK                   (0x01UL << LMEM_PSCCR_PUSHW1_SHIFT)                 /*!< LMEM_PSCCR: PUSHW1 Mask                 */
#define LMEM_PSCCR_PUSHW1_SHIFT                  27                                                  /*!< LMEM_PSCCR: PUSHW1 Position             */
#define LMEM_PSCCR_GO_MASK                       (0x01UL << LMEM_PSCCR_GO_SHIFT)                     /*!< LMEM_PSCCR: GO Mask                     */
#define LMEM_PSCCR_GO_SHIFT                      31                                                  /*!< LMEM_PSCCR: GO Position                 */
/* ------- PSCLCR Bit Fields                        ------ */
#define LMEM_PSCLCR_LGO_MASK                     (0x01UL << LMEM_PSCLCR_LGO_SHIFT)                   /*!< LMEM_PSCLCR: LGO Mask                   */
#define LMEM_PSCLCR_LGO_SHIFT                    0                                                   /*!< LMEM_PSCLCR: LGO Position               */
#define LMEM_PSCLCR_CACHEADDR_MASK               (0x3FFUL << LMEM_PSCLCR_CACHEADDR_SHIFT)            /*!< LMEM_PSCLCR: CACHEADDR Mask             */
#define LMEM_PSCLCR_CACHEADDR_SHIFT              2                                                   /*!< LMEM_PSCLCR: CACHEADDR Position         */
#define LMEM_PSCLCR_CACHEADDR(x)                 (((uint32_t)(((uint32_t)(x))<<LMEM_PSCLCR_CACHEADDR_SHIFT))&LMEM_PSCLCR_CACHEADDR_MASK) /*!< LMEM_PSCLCR                             */
#define LMEM_PSCLCR_WSEL_MASK                    (0x01UL << LMEM_PSCLCR_WSEL_SHIFT)                  /*!< LMEM_PSCLCR: WSEL Mask                  */
#define LMEM_PSCLCR_WSEL_SHIFT                   14                                                  /*!< LMEM_PSCLCR: WSEL Position              */
#define LMEM_PSCLCR_TDSEL_MASK                   (0x01UL << LMEM_PSCLCR_TDSEL_SHIFT)                 /*!< LMEM_PSCLCR: TDSEL Mask                 */
#define LMEM_PSCLCR_TDSEL_SHIFT                  16                                                  /*!< LMEM_PSCLCR: TDSEL Position             */
#define LMEM_PSCLCR_LCIVB_MASK                   (0x01UL << LMEM_PSCLCR_LCIVB_SHIFT)                 /*!< LMEM_PSCLCR: LCIVB Mask                 */
#define LMEM_PSCLCR_LCIVB_SHIFT                  20                                                  /*!< LMEM_PSCLCR: LCIVB Position             */
#define LMEM_PSCLCR_LCIMB_MASK                   (0x01UL << LMEM_PSCLCR_LCIMB_SHIFT)                 /*!< LMEM_PSCLCR: LCIMB Mask                 */
#define LMEM_PSCLCR_LCIMB_SHIFT                  21                                                  /*!< LMEM_PSCLCR: LCIMB Position             */
#define LMEM_PSCLCR_LCWAY_MASK                   (0x01UL << LMEM_PSCLCR_LCWAY_SHIFT)                 /*!< LMEM_PSCLCR: LCWAY Mask                 */
#define LMEM_PSCLCR_LCWAY_SHIFT                  22                                                  /*!< LMEM_PSCLCR: LCWAY Position             */
#define LMEM_PSCLCR_LCMD_MASK                    (0x03UL << LMEM_PSCLCR_LCMD_SHIFT)                  /*!< LMEM_PSCLCR: LCMD Mask                  */
#define LMEM_PSCLCR_LCMD_SHIFT                   24                                                  /*!< LMEM_PSCLCR: LCMD Position              */
#define LMEM_PSCLCR_LCMD(x)                      (((uint32_t)(((uint32_t)(x))<<LMEM_PSCLCR_LCMD_SHIFT))&LMEM_PSCLCR_LCMD_MASK) /*!< LMEM_PSCLCR                             */
#define LMEM_PSCLCR_LADSEL_MASK                  (0x01UL << LMEM_PSCLCR_LADSEL_SHIFT)                /*!< LMEM_PSCLCR: LADSEL Mask                */
#define LMEM_PSCLCR_LADSEL_SHIFT                 26                                                  /*!< LMEM_PSCLCR: LADSEL Position            */
#define LMEM_PSCLCR_LACC_MASK                    (0x01UL << LMEM_PSCLCR_LACC_SHIFT)                  /*!< LMEM_PSCLCR: LACC Mask                  */
#define LMEM_PSCLCR_LACC_SHIFT                   27                                                  /*!< LMEM_PSCLCR: LACC Position              */
/* ------- PSCSAR Bit Fields                        ------ */
#define LMEM_PSCSAR_LGO_MASK                     (0x01UL << LMEM_PSCSAR_LGO_SHIFT)                   /*!< LMEM_PSCSAR: LGO Mask                   */
#define LMEM_PSCSAR_LGO_SHIFT                    0                                                   /*!< LMEM_PSCSAR: LGO Position               */
#define LMEM_PSCSAR_PHYADDR_MASK                 (0x3FFFFFFFUL << LMEM_PSCSAR_PHYADDR_SHIFT)         /*!< LMEM_PSCSAR: PHYADDR Mask               */
#define LMEM_PSCSAR_PHYADDR_SHIFT                2                                                   /*!< LMEM_PSCSAR: PHYADDR Position           */
#define LMEM_PSCSAR_PHYADDR(x)                   (((uint32_t)(((uint32_t)(x))<<LMEM_PSCSAR_PHYADDR_SHIFT))&LMEM_PSCSAR_PHYADDR_MASK) /*!< LMEM_PSCSAR                             */
/* ------- PSCCVR Bit Fields                        ------ */
#define LMEM_PSCCVR_DATA_MASK                    (0xFFFFFFFFUL << LMEM_PSCCVR_DATA_SHIFT)            /*!< LMEM_PSCCVR: DATA Mask                  */
#define LMEM_PSCCVR_DATA_SHIFT                   0                                                   /*!< LMEM_PSCCVR: DATA Position              */
#define LMEM_PSCCVR_DATA(x)                      (((uint32_t)(((uint32_t)(x))<<LMEM_PSCCVR_DATA_SHIFT))&LMEM_PSCCVR_DATA_MASK) /*!< LMEM_PSCCVR                             */
/* ------- PSCRMR Bit Fields                        ------ */
#define LMEM_PSCRMR_R15_MASK                     (0x03UL << LMEM_PSCRMR_R15_SHIFT)                   /*!< LMEM_PSCRMR: R15 Mask                   */
