podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define LMEM_PSCRMR_R15_SHIFT                    0                                                   /*!< LMEM_PSCRMR: R15 Position               */
#define LMEM_PSCRMR_R15(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R15_SHIFT))&LMEM_PSCRMR_R15_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R14_MASK                     (0x03UL << LMEM_PSCRMR_R14_SHIFT)                   /*!< LMEM_PSCRMR: R14 Mask                   */
#define LMEM_PSCRMR_R14_SHIFT                    2                                                   /*!< LMEM_PSCRMR: R14 Position               */
#define LMEM_PSCRMR_R14(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R14_SHIFT))&LMEM_PSCRMR_R14_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R13_MASK                     (0x03UL << LMEM_PSCRMR_R13_SHIFT)                   /*!< LMEM_PSCRMR: R13 Mask                   */
#define LMEM_PSCRMR_R13_SHIFT                    4                                                   /*!< LMEM_PSCRMR: R13 Position               */
#define LMEM_PSCRMR_R13(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R13_SHIFT))&LMEM_PSCRMR_R13_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R12_MASK                     (0x03UL << LMEM_PSCRMR_R12_SHIFT)                   /*!< LMEM_PSCRMR: R12 Mask                   */
#define LMEM_PSCRMR_R12_SHIFT                    6                                                   /*!< LMEM_PSCRMR: R12 Position               */
#define LMEM_PSCRMR_R12(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R12_SHIFT))&LMEM_PSCRMR_R12_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R11_MASK                     (0x03UL << LMEM_PSCRMR_R11_SHIFT)                   /*!< LMEM_PSCRMR: R11 Mask                   */
#define LMEM_PSCRMR_R11_SHIFT                    8                                                   /*!< LMEM_PSCRMR: R11 Position               */
#define LMEM_PSCRMR_R11(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R11_SHIFT))&LMEM_PSCRMR_R11_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R10_MASK                     (0x03UL << LMEM_PSCRMR_R10_SHIFT)                   /*!< LMEM_PSCRMR: R10 Mask                   */
#define LMEM_PSCRMR_R10_SHIFT                    10                                                  /*!< LMEM_PSCRMR: R10 Position               */
#define LMEM_PSCRMR_R10(x)                       (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R10_SHIFT))&LMEM_PSCRMR_R10_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R9_MASK                      (0x03UL << LMEM_PSCRMR_R9_SHIFT)                    /*!< LMEM_PSCRMR: R9 Mask                    */
#define LMEM_PSCRMR_R9_SHIFT                     12                                                  /*!< LMEM_PSCRMR: R9 Position                */
#define LMEM_PSCRMR_R9(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R9_SHIFT))&LMEM_PSCRMR_R9_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R8_MASK                      (0x03UL << LMEM_PSCRMR_R8_SHIFT)                    /*!< LMEM_PSCRMR: R8 Mask                    */
#define LMEM_PSCRMR_R8_SHIFT                     14                                                  /*!< LMEM_PSCRMR: R8 Position                */
#define LMEM_PSCRMR_R8(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R8_SHIFT))&LMEM_PSCRMR_R8_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R7_MASK                      (0x03UL << LMEM_PSCRMR_R7_SHIFT)                    /*!< LMEM_PSCRMR: R7 Mask                    */
#define LMEM_PSCRMR_R7_SHIFT                     16                                                  /*!< LMEM_PSCRMR: R7 Position                */
#define LMEM_PSCRMR_R7(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R7_SHIFT))&LMEM_PSCRMR_R7_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R6_MASK                      (0x03UL << LMEM_PSCRMR_R6_SHIFT)                    /*!< LMEM_PSCRMR: R6 Mask                    */
#define LMEM_PSCRMR_R6_SHIFT                     18                                                  /*!< LMEM_PSCRMR: R6 Position                */
#define LMEM_PSCRMR_R6(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R6_SHIFT))&LMEM_PSCRMR_R6_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R5_MASK                      (0x03UL << LMEM_PSCRMR_R5_SHIFT)                    /*!< LMEM_PSCRMR: R5 Mask                    */
#define LMEM_PSCRMR_R5_SHIFT                     20                                                  /*!< LMEM_PSCRMR: R5 Position                */
#define LMEM_PSCRMR_R5(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R5_SHIFT))&LMEM_PSCRMR_R5_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R4_MASK                      (0x03UL << LMEM_PSCRMR_R4_SHIFT)                    /*!< LMEM_PSCRMR: R4 Mask                    */
#define LMEM_PSCRMR_R4_SHIFT                     22                                                  /*!< LMEM_PSCRMR: R4 Position                */
#define LMEM_PSCRMR_R4(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R4_SHIFT))&LMEM_PSCRMR_R4_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R3_MASK                      (0x03UL << LMEM_PSCRMR_R3_SHIFT)                    /*!< LMEM_PSCRMR: R3 Mask                    */
#define LMEM_PSCRMR_R3_SHIFT                     24                                                  /*!< LMEM_PSCRMR: R3 Position                */
#define LMEM_PSCRMR_R3(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R3_SHIFT))&LMEM_PSCRMR_R3_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R2_MASK                      (0x03UL << LMEM_PSCRMR_R2_SHIFT)                    /*!< LMEM_PSCRMR: R2 Mask                    */
#define LMEM_PSCRMR_R2_SHIFT                     26                                                  /*!< LMEM_PSCRMR: R2 Position                */
#define LMEM_PSCRMR_R2(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R2_SHIFT))&LMEM_PSCRMR_R2_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R1_MASK                      (0x03UL << LMEM_PSCRMR_R1_SHIFT)                    /*!< LMEM_PSCRMR: R1 Mask                    */
#define LMEM_PSCRMR_R1_SHIFT                     28                                                  /*!< LMEM_PSCRMR: R1 Position                */
#define LMEM_PSCRMR_R1(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R1_SHIFT))&LMEM_PSCRMR_R1_MASK) /*!< LMEM_PSCRMR                             */
#define LMEM_PSCRMR_R0_MASK                      (0x03UL << LMEM_PSCRMR_R0_SHIFT)                    /*!< LMEM_PSCRMR: R0 Mask                    */
#define LMEM_PSCRMR_R0_SHIFT                     30                                                  /*!< LMEM_PSCRMR: R0 Position                */
#define LMEM_PSCRMR_R0(x)                        (((uint32_t)(((uint32_t)(x))<<LMEM_PSCRMR_R0_SHIFT))&LMEM_PSCRMR_R0_MASK) /*!< LMEM_PSCRMR                             */
/**
 * @} */ /* End group LMEM_Register_Masks_GROUP 
 */

/* LMEM - Peripheral instance base addresses */
#define LMEM_BasePtr                   0xE0082000UL //!< Peripheral base address
#define LMEM                           ((LMEM_Type *) LMEM_BasePtr) //!< Freescale base pointer
#define LMEM_BASE_PTR                  (LMEM) //!< Freescale style base pointer
/**
 * @} */ /* End group LMEM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup LPTMR_Peripheral_access_layer_GROUP LPTMR Peripheral Access Layer
* @brief C Struct for LPTMR
* @{
*/

/* ================================================================================ */
/* ================           LPTMR0 (file:LPTMR0_0)               ================ */
/* ================================================================================ */

/**
 * @brief Low Power Timer
 */
/**
* @addtogroup LPTMR_structs_GROUP LPTMR struct
* @brief Struct for LPTMR
* @{
*/
typedef struct {                                /*       LPTMR0 Structure                                             */
   __IO uint32_t  CSR;                          /**< 0000: Control Status Register                                      */
   __IO uint32_t  PSR;                          /**< 0004: Prescale Register                                            */
   __IO uint32_t  CMR;                          /**< 0008: Compare Register                                             */
   __IO uint32_t  CNR;                          /**< 000C: Counter Register                                             */
} LPTMR_Type;

/**
 * @} */ /* End group LPTMR_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'LPTMR0' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup LPTMR_Register_Masks_GROUP LPTMR Register Masks
* @brief Register Masks for LPTMR
* @{
*/
/* ------- CSR Bit Fields                           ------ */
#define LPTMR_CSR_TEN_MASK                       (0x01UL << LPTMR_CSR_TEN_SHIFT)                     /*!< LPTMR0_CSR: TEN Mask                    */
#define LPTMR_CSR_TEN_SHIFT                      0                                                   /*!< LPTMR0_CSR: TEN Position                */
#define LPTMR_CSR_TMS_MASK                       (0x01UL << LPTMR_CSR_TMS_SHIFT)                     /*!< LPTMR0_CSR: TMS Mask                    */
#define LPTMR_CSR_TMS_SHIFT                      1                                                   /*!< LPTMR0_CSR: TMS Position                */
#define LPTMR_CSR_TFC_MASK                       (0x01UL << LPTMR_CSR_TFC_SHIFT)                     /*!< LPTMR0_CSR: TFC Mask                    */
#define LPTMR_CSR_TFC_SHIFT                      2                                                   /*!< LPTMR0_CSR: TFC Position                */
#define LPTMR_CSR_TPP_MASK                       (0x01UL << LPTMR_CSR_TPP_SHIFT)                     /*!< LPTMR0_CSR: TPP Mask                    */
#define LPTMR_CSR_TPP_SHIFT                      3                                                   /*!< LPTMR0_CSR: TPP Position                */
#define LPTMR_CSR_TPS_MASK                       (0x03UL << LPTMR_CSR_TPS_SHIFT)                     /*!< LPTMR0_CSR: TPS Mask                    */
#define LPTMR_CSR_TPS_SHIFT                      4                                                   /*!< LPTMR0_CSR: TPS Position                */
#define LPTMR_CSR_TPS(x)                         (((uint32_t)(((uint32_t)(x))<<LPTMR_CSR_TPS_SHIFT))&LPTMR_CSR_TPS_MASK) /*!< LPTMR0_CSR                              */
#define LPTMR_CSR_TIE_MASK                       (0x01UL << LPTMR_CSR_TIE_SHIFT)                     /*!< LPTMR0_CSR: TIE Mask                    */
#define LPTMR_CSR_TIE_SHIFT                      6                                                   /*!< LPTMR0_CSR: TIE Position                */
#define LPTMR_CSR_TCF_MASK                       (0x01UL << LPTMR_CSR_TCF_SHIFT)                     /*!< LPTMR0_CSR: TCF Mask                    */
#define LPTMR_CSR_TCF_SHIFT                      7                                                   /*!< LPTMR0_CSR: TCF Position                */
/* ------- PSR Bit Fields                           ------ */
#define LPTMR_PSR_PCS_MASK                       (0x03UL << LPTMR_PSR_PCS_SHIFT)                     /*!< LPTMR0_PSR: PCS Mask                    */
#define LPTMR_PSR_PCS_SHIFT                      0                                                   /*!< LPTMR0_PSR: PCS Position                */
#define LPTMR_PSR_PCS(x)                         (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PCS_SHIFT))&LPTMR_PSR_PCS_MASK) /*!< LPTMR0_PSR                              */
#define LPTMR_PSR_PBYP_MASK                      (0x01UL << LPTMR_PSR_PBYP_SHIFT)                    /*!< LPTMR0_PSR: PBYP Mask                   */
#define LPTMR_PSR_PBYP_SHIFT                     2                                                   /*!< LPTMR0_PSR: PBYP Position               */
#define LPTMR_PSR_PRESCALE_MASK                  (0x0FUL << LPTMR_PSR_PRESCALE_SHIFT)                /*!< LPTMR0_PSR: PRESCALE Mask               */
#define LPTMR_PSR_PRESCALE_SHIFT                 3                                                   /*!< LPTMR0_PSR: PRESCALE Position           */
#define LPTMR_PSR_PRESCALE(x)                    (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PRESCALE_SHIFT))&LPTMR_PSR_PRESCALE_MASK) /*!< LPTMR0_PSR                              */
/* ------- CMR Bit Fields                           ------ */
#define LPTMR_CMR_COMPARE_MASK                   (0xFFFFUL << LPTMR_CMR_COMPARE_SHIFT)               /*!< LPTMR0_CMR: COMPARE Mask                */
#define LPTMR_CMR_COMPARE_SHIFT                  0                                                   /*!< LPTMR0_CMR: COMPARE Position            */
#define LPTMR_CMR_COMPARE(x)                     (((uint32_t)(((uint32_t)(x))<<LPTMR_CMR_COMPARE_SHIFT))&LPTMR_CMR_COMPARE_MASK) /*!< LPTMR0_CMR                              */
/* ------- CNR Bit Fields                           ------ */
#define LPTMR_CNR_COUNTER_MASK                   (0xFFFFUL << LPTMR_CNR_COUNTER_SHIFT)               /*!< LPTMR0_CNR: COUNTER Mask                */
#define LPTMR_CNR_COUNTER_SHIFT                  0                                                   /*!< LPTMR0_CNR: COUNTER Position            */
#define LPTMR_CNR_COUNTER(x)                     (((uint32_t)(((uint32_t)(x))<<LPTMR_CNR_COUNTER_SHIFT))&LPTMR_CNR_COUNTER_MASK) /*!< LPTMR0_CNR                              */
/**
 * @} */ /* End group LPTMR_Register_Masks_GROUP 
 */

/* LPTMR0 - Peripheral instance base addresses */
#define LPTMR0_BasePtr                 0x40040000UL //!< Peripheral base address
#define LPTMR0                         ((LPTMR_Type *) LPTMR0_BasePtr) //!< Freescale base pointer
#define LPTMR0_BASE_PTR                (LPTMR0) //!< Freescale style base pointer
/**
 * @} */ /* End group LPTMR_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MCG_Peripheral_access_layer_GROUP MCG Peripheral Access Layer
* @brief C Struct for MCG
* @{
*/

/* ================================================================================ */
/* ================           MCG (file:MCG_MKF12)                 ================ */
/* ================================================================================ */

/**
 * @brief Multipurpose Clock Generator module (3 OSC, 2 PLL)
 */
/**
* @addtogroup MCG_structs_GROUP MCG struct
* @brief Struct for MCG
* @{
*/
typedef struct {                                /*       MCG Structure                                                */
   __IO uint8_t   C1;                           /**< 0000: Control 1 Register                                           */
   __IO uint8_t   C2;                           /**< 0001: Control 2 Register                                           */
   __IO uint8_t   C3;                           /**< 0002: Control 3 Register                                           */
   __IO uint8_t   C4;                           /**< 0003: Control 4 Register                                           */
   __IO uint8_t   C5;                           /**< 0004: Control 5 Register                                           */
   __IO uint8_t   C6;                           /**< 0005: Control 6 Register                                           */
   __IO uint8_t   S;                            /**< 0006: Status Register                                              */
   __I  uint8_t   RESERVED0;                   
   __IO uint8_t   SC;                           /**< 0008: Status and Control Register                                  */
   __I  uint8_t   RESERVED1;                   
   __IO uint8_t   ATCVH;                        /**< 000A: ATM Compare Value High                                       */
   __IO uint8_t   ATCVL;                        /**< 000B: ATM Compare Value Low                                        */
   __IO uint8_t   C7;                           /**< 000C: Control 7 Register                                           */
   __IO uint8_t   C8;                           /**< 000D: Control 8 Register                                           */
   __I  uint8_t   RESERVED2;                   
   __IO uint8_t   C10;                          /**< 000F: Control 10 Register                                          */
   __IO uint8_t   C11;                          /**< 0010: Control 11 Register                                          */
   __IO uint8_t   C12;                          /**< 0011: Control 12 Register                                          */
   __I  uint8_t   S2;                           /**< 0012: Status 2 Register                                            */
} MCG_Type;

/**
 * @} */ /* End group MCG_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MCG' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

