podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
 * @brief Core Platform Miscellaneous Control Module
 */
/**
* @addtogroup MCM_structs_GROUP MCM struct
* @brief Struct for MCM
* @{
*/
typedef struct {                                /*       MCM Structure                                                */
   __I  uint32_t  RESERVED0[2];                
   __I  uint16_t  PLASC;                        /**< 0008: Crossbar Switch (AXBS) Slave Configuration                   */
   __I  uint16_t  PLAMC;                        /**< 000A: Crossbar Switch (AXBS) Master Configuration                  */
   __IO uint32_t  CR;                           /**< 000C: Control Register                                             */
   __IO uint32_t  ISCR;                         /**< 0010: Interrupt Status Register                                    */
   __IO uint32_t  ETBCC;                        /**< 0014: ETB Counter Control register                                 */
   __IO uint32_t  ETBRL;                        /**< 0018: ETB Reload register                                          */
   __I  uint32_t  ETBCNT;                       /**< 001C: ETB Counter Value register                                   */
   __I  uint32_t  FADR;                         /**< 0020: Fault address register                                       */
   __I  uint32_t  FATR;                         /**< 0024: Fault attributes register                                    */
   __I  uint32_t  FDR;                          /**< 0028: Fault data register                                          */
   __I  uint32_t  RESERVED1;                   
   __IO uint32_t  PID;                          /**< 0030: Process ID register                                          */
} MCM_Type;

/**
 * @} */ /* End group MCM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MCM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup MCM_Register_Masks_GROUP MCM Register Masks
* @brief Register Masks for MCM
* @{
*/
/* ------- PLASC Bit Fields                         ------ */
#define MCM_PLASC_ASC_MASK                       (0xFFUL << MCM_PLASC_ASC_SHIFT)                     /*!< MCM_PLASC: ASC Mask                     */
#define MCM_PLASC_ASC_SHIFT                      0                                                   /*!< MCM_PLASC: ASC Position                 */
#define MCM_PLASC_ASC(x)                         (((uint16_t)(((uint16_t)(x))<<MCM_PLASC_ASC_SHIFT))&MCM_PLASC_ASC_MASK) /*!< MCM_PLASC                               */
/* ------- PLAMC Bit Fields                         ------ */
#define MCM_PLAMC_AMC_MASK                       (0xFFUL << MCM_PLAMC_AMC_SHIFT)                     /*!< MCM_PLAMC: AMC Mask                     */
#define MCM_PLAMC_AMC_SHIFT                      0                                                   /*!< MCM_PLAMC: AMC Position                 */
#define MCM_PLAMC_AMC(x)                         (((uint16_t)(((uint16_t)(x))<<MCM_PLAMC_AMC_SHIFT))&MCM_PLAMC_AMC_MASK) /*!< MCM_PLAMC                               */
/* ------- CR Bit Fields                            ------ */
#define MCM_CR_DDRSIZE_MASK                      (0x03UL << MCM_CR_DDRSIZE_SHIFT)                    /*!< MCM_CR: DDRSIZE Mask                    */
#define MCM_CR_DDRSIZE_SHIFT                     20                                                  /*!< MCM_CR: DDRSIZE Position                */
#define MCM_CR_DDRSIZE(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_CR_DDRSIZE_SHIFT))&MCM_CR_DDRSIZE_MASK) /*!< MCM_CR                                  */
#define MCM_CR_SRAMUAP_MASK                      (0x03UL << MCM_CR_SRAMUAP_SHIFT)                    /*!< MCM_CR: SRAMUAP Mask                    */
#define MCM_CR_SRAMUAP_SHIFT                     24                                                  /*!< MCM_CR: SRAMUAP Position                */
#define MCM_CR_SRAMUAP(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_CR_SRAMUAP_SHIFT))&MCM_CR_SRAMUAP_MASK) /*!< MCM_CR                                  */
#define MCM_CR_SRAMUWP_MASK                      (0x01UL << MCM_CR_SRAMUWP_SHIFT)                    /*!< MCM_CR: SRAMUWP Mask                    */
#define MCM_CR_SRAMUWP_SHIFT                     26                                                  /*!< MCM_CR: SRAMUWP Position                */
#define MCM_CR_SRAMLAP_MASK                      (0x03UL << MCM_CR_SRAMLAP_SHIFT)                    /*!< MCM_CR: SRAMLAP Mask                    */
#define MCM_CR_SRAMLAP_SHIFT                     28                                                  /*!< MCM_CR: SRAMLAP Position                */
#define MCM_CR_SRAMLAP(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_CR_SRAMLAP_SHIFT))&MCM_CR_SRAMLAP_MASK) /*!< MCM_CR                                  */
#define MCM_CR_SRAMLWP_MASK                      (0x01UL << MCM_CR_SRAMLWP_SHIFT)                    /*!< MCM_CR: SRAMLWP Mask                    */
#define MCM_CR_SRAMLWP_SHIFT                     30                                                  /*!< MCM_CR: SRAMLWP Position                */
/* ------- ISCR Bit Fields                          ------ */
#define MCM_ISCR_IRQ_MASK                        (0x01UL << MCM_ISCR_IRQ_SHIFT)                      /*!< MCM_ISCR: IRQ Mask                      */
#define MCM_ISCR_IRQ_SHIFT                       1                                                   /*!< MCM_ISCR: IRQ Position                  */
#define MCM_ISCR_NMI_MASK                        (0x01UL << MCM_ISCR_NMI_SHIFT)                      /*!< MCM_ISCR: NMI Mask                      */
#define MCM_ISCR_NMI_SHIFT                       2                                                   /*!< MCM_ISCR: NMI Position                  */
#define MCM_ISCR_DHREQ_MASK                      (0x01UL << MCM_ISCR_DHREQ_SHIFT)                    /*!< MCM_ISCR: DHREQ Mask                    */
#define MCM_ISCR_DHREQ_SHIFT                     3                                                   /*!< MCM_ISCR: DHREQ Position                */
#define MCM_ISCR_CWBER_MASK                      (0x01UL << MCM_ISCR_CWBER_SHIFT)                    /*!< MCM_ISCR: CWBER Mask                    */
#define MCM_ISCR_CWBER_SHIFT                     4                                                   /*!< MCM_ISCR: CWBER Position                */
#define MCM_ISCR_FIOC_MASK                       (0x01UL << MCM_ISCR_FIOC_SHIFT)                     /*!< MCM_ISCR: FIOC Mask                     */
#define MCM_ISCR_FIOC_SHIFT                      8                                                   /*!< MCM_ISCR: FIOC Position                 */
#define MCM_ISCR_FDZC_MASK                       (0x01UL << MCM_ISCR_FDZC_SHIFT)                     /*!< MCM_ISCR: FDZC Mask                     */
#define MCM_ISCR_FDZC_SHIFT                      9                                                   /*!< MCM_ISCR: FDZC Position                 */
#define MCM_ISCR_FOFC_MASK                       (0x01UL << MCM_ISCR_FOFC_SHIFT)                     /*!< MCM_ISCR: FOFC Mask                     */
#define MCM_ISCR_FOFC_SHIFT                      10                                                  /*!< MCM_ISCR: FOFC Position                 */
#define MCM_ISCR_FUFC_MASK                       (0x01UL << MCM_ISCR_FUFC_SHIFT)                     /*!< MCM_ISCR: FUFC Mask                     */
#define MCM_ISCR_FUFC_SHIFT                      11                                                  /*!< MCM_ISCR: FUFC Position                 */
#define MCM_ISCR_FIXC_MASK                       (0x01UL << MCM_ISCR_FIXC_SHIFT)                     /*!< MCM_ISCR: FIXC Mask                     */
#define MCM_ISCR_FIXC_SHIFT                      12                                                  /*!< MCM_ISCR: FIXC Position                 */
#define MCM_ISCR_FIDC_MASK                       (0x01UL << MCM_ISCR_FIDC_SHIFT)                     /*!< MCM_ISCR: FIDC Mask                     */
#define MCM_ISCR_FIDC_SHIFT                      15                                                  /*!< MCM_ISCR: FIDC Position                 */
#define MCM_ISCR_CWBEE_MASK                      (0x01UL << MCM_ISCR_CWBEE_SHIFT)                    /*!< MCM_ISCR: CWBEE Mask                    */
#define MCM_ISCR_CWBEE_SHIFT                     20                                                  /*!< MCM_ISCR: CWBEE Position                */
#define MCM_ISCR_FIOCE_MASK                      (0x01UL << MCM_ISCR_FIOCE_SHIFT)                    /*!< MCM_ISCR: FIOCE Mask                    */
#define MCM_ISCR_FIOCE_SHIFT                     24                                                  /*!< MCM_ISCR: FIOCE Position                */
#define MCM_ISCR_FDZCE_MASK                      (0x01UL << MCM_ISCR_FDZCE_SHIFT)                    /*!< MCM_ISCR: FDZCE Mask                    */
#define MCM_ISCR_FDZCE_SHIFT                     25                                                  /*!< MCM_ISCR: FDZCE Position                */
#define MCM_ISCR_FOFCE_MASK                      (0x01UL << MCM_ISCR_FOFCE_SHIFT)                    /*!< MCM_ISCR: FOFCE Mask                    */
#define MCM_ISCR_FOFCE_SHIFT                     26                                                  /*!< MCM_ISCR: FOFCE Position                */
#define MCM_ISCR_FUFCE_MASK                      (0x01UL << MCM_ISCR_FUFCE_SHIFT)                    /*!< MCM_ISCR: FUFCE Mask                    */
#define MCM_ISCR_FUFCE_SHIFT                     27                                                  /*!< MCM_ISCR: FUFCE Position                */
#define MCM_ISCR_FIXCE_MASK                      (0x01UL << MCM_ISCR_FIXCE_SHIFT)                    /*!< MCM_ISCR: FIXCE Mask                    */
#define MCM_ISCR_FIXCE_SHIFT                     28                                                  /*!< MCM_ISCR: FIXCE Position                */
#define MCM_ISCR_FIDCE_MASK                      (0x01UL << MCM_ISCR_FIDCE_SHIFT)                    /*!< MCM_ISCR: FIDCE Mask                    */
#define MCM_ISCR_FIDCE_SHIFT                     31                                                  /*!< MCM_ISCR: FIDCE Position                */
/* ------- ETBCC Bit Fields                         ------ */
#define MCM_ETBCC_CNTEN_MASK                     (0x01UL << MCM_ETBCC_CNTEN_SHIFT)                   /*!< MCM_ETBCC: CNTEN Mask                   */
#define MCM_ETBCC_CNTEN_SHIFT                    0                                                   /*!< MCM_ETBCC: CNTEN Position               */
#define MCM_ETBCC_RSPT_MASK                      (0x03UL << MCM_ETBCC_RSPT_SHIFT)                    /*!< MCM_ETBCC: RSPT Mask                    */
#define MCM_ETBCC_RSPT_SHIFT                     1                                                   /*!< MCM_ETBCC: RSPT Position                */
#define MCM_ETBCC_RSPT(x)                        (((uint32_t)(((uint32_t)(x))<<MCM_ETBCC_RSPT_SHIFT))&MCM_ETBCC_RSPT_MASK) /*!< MCM_ETBCC                               */
#define MCM_ETBCC_RLRQ_MASK                      (0x01UL << MCM_ETBCC_RLRQ_SHIFT)                    /*!< MCM_ETBCC: RLRQ Mask                    */
#define MCM_ETBCC_RLRQ_SHIFT                     3                                                   /*!< MCM_ETBCC: RLRQ Position                */
#define MCM_ETBCC_ETDIS_MASK                     (0x01UL << MCM_ETBCC_ETDIS_SHIFT)                   /*!< MCM_ETBCC: ETDIS Mask                   */
#define MCM_ETBCC_ETDIS_SHIFT                    4                                                   /*!< MCM_ETBCC: ETDIS Position               */
#define MCM_ETBCC_ITDIS_MASK                     (0x01UL << MCM_ETBCC_ITDIS_SHIFT)                   /*!< MCM_ETBCC: ITDIS Mask                   */
#define MCM_ETBCC_ITDIS_SHIFT                    5                                                   /*!< MCM_ETBCC: ITDIS Position               */
/* ------- ETBRL Bit Fields                         ------ */
#define MCM_ETBRL_RELOAD_MASK                    (0x7FFUL << MCM_ETBRL_RELOAD_SHIFT)                 /*!< MCM_ETBRL: RELOAD Mask                  */
#define MCM_ETBRL_RELOAD_SHIFT                   0                                                   /*!< MCM_ETBRL: RELOAD Position              */
#define MCM_ETBRL_RELOAD(x)                      (((uint32_t)(((uint32_t)(x))<<MCM_ETBRL_RELOAD_SHIFT))&MCM_ETBRL_RELOAD_MASK) /*!< MCM_ETBRL                               */
/* ------- ETBCNT Bit Fields                        ------ */
#define MCM_ETBCNT_COUNTER_MASK                  (0x7FFUL << MCM_ETBCNT_COUNTER_SHIFT)               /*!< MCM_ETBCNT: COUNTER Mask                */
#define MCM_ETBCNT_COUNTER_SHIFT                 0                                                   /*!< MCM_ETBCNT: COUNTER Position            */
#define MCM_ETBCNT_COUNTER(x)                    (((uint32_t)(((uint32_t)(x))<<MCM_ETBCNT_COUNTER_SHIFT))&MCM_ETBCNT_COUNTER_MASK) /*!< MCM_ETBCNT                              */
/* ------- FADR Bit Fields                          ------ */
#define MCM_FADR_ADDRESS_MASK                    (0xFFFFFFFFUL << MCM_FADR_ADDRESS_SHIFT)            /*!< MCM_FADR: ADDRESS Mask                  */
#define MCM_FADR_ADDRESS_SHIFT                   0                                                   /*!< MCM_FADR: ADDRESS Position              */
#define MCM_FADR_ADDRESS(x)                      (((uint32_t)(((uint32_t)(x))<<MCM_FADR_ADDRESS_SHIFT))&MCM_FADR_ADDRESS_MASK) /*!< MCM_FADR                                */
/* ------- FATR Bit Fields                          ------ */
#define MCM_FATR_BEDA_MASK                       (0x01UL << MCM_FATR_BEDA_SHIFT)                     /*!< MCM_FATR: BEDA Mask                     */
#define MCM_FATR_BEDA_SHIFT                      0                                                   /*!< MCM_FATR: BEDA Position                 */
#define MCM_FATR_BEMD_MASK                       (0x01UL << MCM_FATR_BEMD_SHIFT)                     /*!< MCM_FATR: BEMD Mask                     */
#define MCM_FATR_BEMD_SHIFT                      1                                                   /*!< MCM_FATR: BEMD Position                 */
#define MCM_FATR_BESZ_MASK                       (0x03UL << MCM_FATR_BESZ_SHIFT)                     /*!< MCM_FATR: BESZ Mask                     */
#define MCM_FATR_BESZ_SHIFT                      4                                                   /*!< MCM_FATR: BESZ Position                 */
#define MCM_FATR_BESZ(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_FATR_BESZ_SHIFT))&MCM_FATR_BESZ_MASK) /*!< MCM_FATR                                */
#define MCM_FATR_BEWT_MASK                       (0x01UL << MCM_FATR_BEWT_SHIFT)                     /*!< MCM_FATR: BEWT Mask                     */
#define MCM_FATR_BEWT_SHIFT                      7                                                   /*!< MCM_FATR: BEWT Position                 */
#define MCM_FATR_BEMN_MASK                       (0x0FUL << MCM_FATR_BEMN_SHIFT)                     /*!< MCM_FATR: BEMN Mask                     */
#define MCM_FATR_BEMN_SHIFT                      8                                                   /*!< MCM_FATR: BEMN Position                 */
#define MCM_FATR_BEMN(x)                         (((uint32_t)(((uint32_t)(x))<<MCM_FATR_BEMN_SHIFT))&MCM_FATR_BEMN_MASK) /*!< MCM_FATR                                */
#define MCM_FATR_BEOVR_MASK                      (0x01UL << MCM_FATR_BEOVR_SHIFT)                    /*!< MCM_FATR: BEOVR Mask                    */
#define MCM_FATR_BEOVR_SHIFT                     31                                                  /*!< MCM_FATR: BEOVR Position                */
/* ------- FDR Bit Fields                           ------ */
#define MCM_FDR_DATA_MASK                        (0xFFFFFFFFUL << MCM_FDR_DATA_SHIFT)                /*!< MCM_FDR: DATA Mask                      */
#define MCM_FDR_DATA_SHIFT                       0                                                   /*!< MCM_FDR: DATA Position                  */
#define MCM_FDR_DATA(x)                          (((uint32_t)(((uint32_t)(x))<<MCM_FDR_DATA_SHIFT))&MCM_FDR_DATA_MASK) /*!< MCM_FDR                                 */
/* ------- PID Bit Fields                           ------ */
#define MCM_PID_PID_MASK                         (0xFFUL << MCM_PID_PID_SHIFT)                       /*!< MCM_PID: PID Mask                       */
#define MCM_PID_PID_SHIFT                        0                                                   /*!< MCM_PID: PID Position                   */
#define MCM_PID_PID(x)                           (((uint32_t)(((uint32_t)(x))<<MCM_PID_PID_SHIFT))&MCM_PID_PID_MASK) /*!< MCM_PID                                 */
/**
 * @} */ /* End group MCM_Register_Masks_GROUP 
 */

/* MCM - Peripheral instance base addresses */
#define MCM_BasePtr                    0xE0080000UL //!< Peripheral base address
#define MCM                            ((MCM_Type *) MCM_BasePtr) //!< Freescale base pointer
#define MCM_BASE_PTR                   (MCM) //!< Freescale style base pointer
/**
 * @} */ /* End group MCM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup MPU_Peripheral_access_layer_GROUP MPU Peripheral Access Layer
* @brief C Struct for MPU
* @{
*/

/* ================================================================================ */
/* ================           MPU (file:MPU_MK10F12_16R)           ================ */
/* ================================================================================ */

/**
 * @brief Memory protection unit
 */
/**
* @addtogroup MPU_structs_GROUP MPU struct
* @brief Struct for MPU
* @{
*/
typedef struct {                                /*       MPU Structure                                                */
   __IO uint32_t  CESR;                         /**< 0000: Control/Error Status Register                                */
   __I  uint32_t  RESERVED0[3];                
   struct {
      __I  uint32_t  EAR;                       /**< 0010: Error Address Register, Slave Port n                         */
      __I  uint32_t  EDR;                       /**< 0014: Error Detail Register, Slave Port n                          */
   } SP[5];                                     /**< 0010: (cluster: size=0x0028, 40)                                   */
   __I  uint32_t  RESERVED1[242];              
   struct {
      __IO uint32_t  WORD0;                     /**< 0400: Region Descriptor n, Word 0                                  */
      __IO uint32_t  WORD1;                     /**< 0404: Region Descriptor n, Word 1                                  */
      __IO uint32_t  WORD2;                     /**< 0408: Region Descriptor n, Word 2                                  */
      __IO uint32_t  WORD3;                     /**< 040C: Region Descriptor n, Word 3                                  */
   } RGD[16];                                   /**< 0400: (cluster: size=0x0100, 256)                                  */
   __I  uint32_t  RESERVED2[192];              
   __IO uint32_t  RGDAAC[16];                   /**< 0800: Region Descriptor Alternate Access Control n                 */
} MPU_Type;

/**
 * @} */ /* End group MPU_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'MPU' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

