podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/* MPU - Peripheral instance base addresses */
#define MPU_BasePtr                    0x4000D000UL //!< Peripheral base address
#define MPU                            ((MPU_Type *) MPU_BasePtr) //!< Freescale base pointer
#define MPU_BASE_PTR                   (MPU) //!< Freescale style base pointer
/**
 * @} */ /* End group MPU_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup NFC_Peripheral_access_layer_GROUP NFC Peripheral Access Layer
* @brief C Struct for NFC
* @{
*/

/* ================================================================================ */
/* ================           NFC (file:NFC_0)                     ================ */
/* ================================================================================ */

/**
 * @brief NAND flash controller
 */
/**
* @addtogroup NFC_structs_GROUP NFC struct
* @brief Struct for NFC
* @{
*/
typedef struct {                                /*       NFC Structure                                                */
   __I  uint32_t  RESERVED0[4032];             
   __IO uint32_t  CMD1;                         /**< 3F00: Flash command 1                                              */
   __IO uint32_t  CMD2;                         /**< 3F04: Flash command 2                                              */
   __IO uint32_t  CAR;                          /**< 3F08: Column address                                               */
   __IO uint32_t  RAR;                          /**< 3F0C: Row address                                                  */
   __IO uint32_t  RPT;                          /**< 3F10: Flash command repeat                                         */
   __IO uint32_t  RAI;                          /**< 3F14: Row address increment                                        */
   __I  uint32_t  SR1;                          /**< 3F18: Flash status 1                                               */
   __I  uint32_t  SR2;                          /**< 3F1C: Flash status 2                                               */
   __IO uint32_t  DMA1;                         /**< 3F20: DMA channel 1 address                                        */
   __IO uint32_t  DMACFG;                       /**< 3F24: DMA configuration                                            */
   __IO uint32_t  SWAP;                         /**< 3F28: Cach swap                                                    */
   __IO uint32_t  SECSZ;                        /**< 3F2C: Sector size                                                  */
   __IO uint32_t  CFG;                          /**< 3F30: Flash configuration                                          */
   __IO uint32_t  DMA2;                         /**< 3F34: DMA channel 2 address                                        */
   __IO uint32_t  ISR;                          /**< 3F38: Interrupt status                                             */
} NFC_Type;

/**
 * @} */ /* End group NFC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'NFC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup NFC_Register_Masks_GROUP NFC Register Masks
* @brief Register Masks for NFC
* @{
*/
/* ------- CMD1 Bit Fields                          ------ */
#define NFC_CMD1_BYTE3_MASK                      (0xFFUL << NFC_CMD1_BYTE3_SHIFT)                    /*!< NFC_CMD1: BYTE3 Mask                    */
#define NFC_CMD1_BYTE3_SHIFT                     16                                                  /*!< NFC_CMD1: BYTE3 Position                */
#define NFC_CMD1_BYTE3(x)                        (((uint32_t)(((uint32_t)(x))<<NFC_CMD1_BYTE3_SHIFT))&NFC_CMD1_BYTE3_MASK) /*!< NFC_CMD1                                */
#define NFC_CMD1_BYTE2_MASK                      (0xFFUL << NFC_CMD1_BYTE2_SHIFT)                    /*!< NFC_CMD1: BYTE2 Mask                    */
#define NFC_CMD1_BYTE2_SHIFT                     24                                                  /*!< NFC_CMD1: BYTE2 Position                */
#define NFC_CMD1_BYTE2(x)                        (((uint32_t)(((uint32_t)(x))<<NFC_CMD1_BYTE2_SHIFT))&NFC_CMD1_BYTE2_MASK) /*!< NFC_CMD1                                */
/* ------- CMD2 Bit Fields                          ------ */
#define NFC_CMD2_BUSY_START_MASK                 (0x01UL << NFC_CMD2_BUSY_START_SHIFT)               /*!< NFC_CMD2: BUSY_START Mask               */
#define NFC_CMD2_BUSY_START_SHIFT                0                                                   /*!< NFC_CMD2: BUSY_START Position           */
#define NFC_CMD2_BUFNO_MASK                      (0x03UL << NFC_CMD2_BUFNO_SHIFT)                    /*!< NFC_CMD2: BUFNO Mask                    */
#define NFC_CMD2_BUFNO_SHIFT                     1                                                   /*!< NFC_CMD2: BUFNO Position                */
#define NFC_CMD2_BUFNO(x)                        (((uint32_t)(((uint32_t)(x))<<NFC_CMD2_BUFNO_SHIFT))&NFC_CMD2_BUFNO_MASK) /*!< NFC_CMD2                                */
#define NFC_CMD2_CODE_MASK                       (0xFFFFUL << NFC_CMD2_CODE_SHIFT)                   /*!< NFC_CMD2: CODE Mask                     */
#define NFC_CMD2_CODE_SHIFT                      8                                                   /*!< NFC_CMD2: CODE Position                 */
#define NFC_CMD2_CODE(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_CMD2_CODE_SHIFT))&NFC_CMD2_CODE_MASK) /*!< NFC_CMD2                                */
#define NFC_CMD2_BYTE1_MASK                      (0xFFUL << NFC_CMD2_BYTE1_SHIFT)                    /*!< NFC_CMD2: BYTE1 Mask                    */
#define NFC_CMD2_BYTE1_SHIFT                     24                                                  /*!< NFC_CMD2: BYTE1 Position                */
#define NFC_CMD2_BYTE1(x)                        (((uint32_t)(((uint32_t)(x))<<NFC_CMD2_BYTE1_SHIFT))&NFC_CMD2_BYTE1_MASK) /*!< NFC_CMD2                                */
/* ------- CAR Bit Fields                           ------ */
#define NFC_CAR_BYTE1_MASK                       (0xFFUL << NFC_CAR_BYTE1_SHIFT)                     /*!< NFC_CAR: BYTE1 Mask                     */
#define NFC_CAR_BYTE1_SHIFT                      0                                                   /*!< NFC_CAR: BYTE1 Position                 */
#define NFC_CAR_BYTE1(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_CAR_BYTE1_SHIFT))&NFC_CAR_BYTE1_MASK) /*!< NFC_CAR                                 */
#define NFC_CAR_BYTE2_MASK                       (0xFFUL << NFC_CAR_BYTE2_SHIFT)                     /*!< NFC_CAR: BYTE2 Mask                     */
#define NFC_CAR_BYTE2_SHIFT                      8                                                   /*!< NFC_CAR: BYTE2 Position                 */
#define NFC_CAR_BYTE2(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_CAR_BYTE2_SHIFT))&NFC_CAR_BYTE2_MASK) /*!< NFC_CAR                                 */
/* ------- RAR Bit Fields                           ------ */
#define NFC_RAR_BYTE1_MASK                       (0xFFUL << NFC_RAR_BYTE1_SHIFT)                     /*!< NFC_RAR: BYTE1 Mask                     */
#define NFC_RAR_BYTE1_SHIFT                      0                                                   /*!< NFC_RAR: BYTE1 Position                 */
#define NFC_RAR_BYTE1(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_RAR_BYTE1_SHIFT))&NFC_RAR_BYTE1_MASK) /*!< NFC_RAR                                 */
#define NFC_RAR_BYTE2_MASK                       (0xFFUL << NFC_RAR_BYTE2_SHIFT)                     /*!< NFC_RAR: BYTE2 Mask                     */
#define NFC_RAR_BYTE2_SHIFT                      8                                                   /*!< NFC_RAR: BYTE2 Position                 */
#define NFC_RAR_BYTE2(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_RAR_BYTE2_SHIFT))&NFC_RAR_BYTE2_MASK) /*!< NFC_RAR                                 */
#define NFC_RAR_BYTE3_MASK                       (0xFFUL << NFC_RAR_BYTE3_SHIFT)                     /*!< NFC_RAR: BYTE3 Mask                     */
#define NFC_RAR_BYTE3_SHIFT                      16                                                  /*!< NFC_RAR: BYTE3 Position                 */
#define NFC_RAR_BYTE3(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_RAR_BYTE3_SHIFT))&NFC_RAR_BYTE3_MASK) /*!< NFC_RAR                                 */
#define NFC_RAR_RB0_MASK                         (0x01UL << NFC_RAR_RB0_SHIFT)                       /*!< NFC_RAR: RB0 Mask                       */
#define NFC_RAR_RB0_SHIFT                        24                                                  /*!< NFC_RAR: RB0 Position                   */
#define NFC_RAR_RB1_MASK                         (0x01UL << NFC_RAR_RB1_SHIFT)                       /*!< NFC_RAR: RB1 Mask                       */
#define NFC_RAR_RB1_SHIFT                        25                                                  /*!< NFC_RAR: RB1 Position                   */
#define NFC_RAR_CS0_MASK                         (0x01UL << NFC_RAR_CS0_SHIFT)                       /*!< NFC_RAR: CS0 Mask                       */
#define NFC_RAR_CS0_SHIFT                        28                                                  /*!< NFC_RAR: CS0 Position                   */
#define NFC_RAR_CS1_MASK                         (0x01UL << NFC_RAR_CS1_SHIFT)                       /*!< NFC_RAR: CS1 Mask                       */
#define NFC_RAR_CS1_SHIFT                        29                                                  /*!< NFC_RAR: CS1 Position                   */
/* ------- RPT Bit Fields                           ------ */
#define NFC_RPT_COUNT_MASK                       (0xFFFFUL << NFC_RPT_COUNT_SHIFT)                   /*!< NFC_RPT: COUNT Mask                     */
#define NFC_RPT_COUNT_SHIFT                      0                                                   /*!< NFC_RPT: COUNT Position                 */
#define NFC_RPT_COUNT(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_RPT_COUNT_SHIFT))&NFC_RPT_COUNT_MASK) /*!< NFC_RPT                                 */
/* ------- RAI Bit Fields                           ------ */
#define NFC_RAI_INC1_MASK                        (0xFFUL << NFC_RAI_INC1_SHIFT)                      /*!< NFC_RAI: INC1 Mask                      */
#define NFC_RAI_INC1_SHIFT                       0                                                   /*!< NFC_RAI: INC1 Position                  */
#define NFC_RAI_INC1(x)                          (((uint32_t)(((uint32_t)(x))<<NFC_RAI_INC1_SHIFT))&NFC_RAI_INC1_MASK) /*!< NFC_RAI                                 */
#define NFC_RAI_INC2_MASK                        (0xFFUL << NFC_RAI_INC2_SHIFT)                      /*!< NFC_RAI: INC2 Mask                      */
#define NFC_RAI_INC2_SHIFT                       8                                                   /*!< NFC_RAI: INC2 Position                  */
#define NFC_RAI_INC2(x)                          (((uint32_t)(((uint32_t)(x))<<NFC_RAI_INC2_SHIFT))&NFC_RAI_INC2_MASK) /*!< NFC_RAI                                 */
#define NFC_RAI_INC3_MASK                        (0xFFUL << NFC_RAI_INC3_SHIFT)                      /*!< NFC_RAI: INC3 Mask                      */
#define NFC_RAI_INC3_SHIFT                       16                                                  /*!< NFC_RAI: INC3 Position                  */
#define NFC_RAI_INC3(x)                          (((uint32_t)(((uint32_t)(x))<<NFC_RAI_INC3_SHIFT))&NFC_RAI_INC3_MASK) /*!< NFC_RAI                                 */
/* ------- SR1 Bit Fields                           ------ */
#define NFC_SR1_ID4_MASK                         (0xFFUL << NFC_SR1_ID4_SHIFT)                       /*!< NFC_SR1: ID4 Mask                       */
#define NFC_SR1_ID4_SHIFT                        0                                                   /*!< NFC_SR1: ID4 Position                   */
#define NFC_SR1_ID4(x)                           (((uint32_t)(((uint32_t)(x))<<NFC_SR1_ID4_SHIFT))&NFC_SR1_ID4_MASK) /*!< NFC_SR1                                 */
#define NFC_SR1_ID3_MASK                         (0xFFUL << NFC_SR1_ID3_SHIFT)                       /*!< NFC_SR1: ID3 Mask                       */
#define NFC_SR1_ID3_SHIFT                        8                                                   /*!< NFC_SR1: ID3 Position                   */
#define NFC_SR1_ID3(x)                           (((uint32_t)(((uint32_t)(x))<<NFC_SR1_ID3_SHIFT))&NFC_SR1_ID3_MASK) /*!< NFC_SR1                                 */
#define NFC_SR1_ID2_MASK                         (0xFFUL << NFC_SR1_ID2_SHIFT)                       /*!< NFC_SR1: ID2 Mask                       */
#define NFC_SR1_ID2_SHIFT                        16                                                  /*!< NFC_SR1: ID2 Position                   */
#define NFC_SR1_ID2(x)                           (((uint32_t)(((uint32_t)(x))<<NFC_SR1_ID2_SHIFT))&NFC_SR1_ID2_MASK) /*!< NFC_SR1                                 */
#define NFC_SR1_ID1_MASK                         (0xFFUL << NFC_SR1_ID1_SHIFT)                       /*!< NFC_SR1: ID1 Mask                       */
#define NFC_SR1_ID1_SHIFT                        24                                                  /*!< NFC_SR1: ID1 Position                   */
#define NFC_SR1_ID1(x)                           (((uint32_t)(((uint32_t)(x))<<NFC_SR1_ID1_SHIFT))&NFC_SR1_ID1_MASK) /*!< NFC_SR1                                 */
/* ------- SR2 Bit Fields                           ------ */
#define NFC_SR2_STATUS1_MASK                     (0xFFUL << NFC_SR2_STATUS1_SHIFT)                   /*!< NFC_SR2: STATUS1 Mask                   */
#define NFC_SR2_STATUS1_SHIFT                    0                                                   /*!< NFC_SR2: STATUS1 Position               */
#define NFC_SR2_STATUS1(x)                       (((uint32_t)(((uint32_t)(x))<<NFC_SR2_STATUS1_SHIFT))&NFC_SR2_STATUS1_MASK) /*!< NFC_SR2                                 */
#define NFC_SR2_ID5_MASK                         (0xFFUL << NFC_SR2_ID5_SHIFT)                       /*!< NFC_SR2: ID5 Mask                       */
#define NFC_SR2_ID5_SHIFT                        24                                                  /*!< NFC_SR2: ID5 Position                   */
#define NFC_SR2_ID5(x)                           (((uint32_t)(((uint32_t)(x))<<NFC_SR2_ID5_SHIFT))&NFC_SR2_ID5_MASK) /*!< NFC_SR2                                 */
/* ------- DMA1 Bit Fields                          ------ */
#define NFC_DMA1_ADDRESS_MASK                    (0xFFFFFFFFUL << NFC_DMA1_ADDRESS_SHIFT)            /*!< NFC_DMA1: ADDRESS Mask                  */
#define NFC_DMA1_ADDRESS_SHIFT                   0                                                   /*!< NFC_DMA1: ADDRESS Position              */
#define NFC_DMA1_ADDRESS(x)                      (((uint32_t)(((uint32_t)(x))<<NFC_DMA1_ADDRESS_SHIFT))&NFC_DMA1_ADDRESS_MASK) /*!< NFC_DMA1                                */
/* ------- DMACFG Bit Fields                        ------ */
#define NFC_DMACFG_ACT2_MASK                     (0x01UL << NFC_DMACFG_ACT2_SHIFT)                   /*!< NFC_DMACFG: ACT2 Mask                   */
#define NFC_DMACFG_ACT2_SHIFT                    0                                                   /*!< NFC_DMACFG: ACT2 Position               */
#define NFC_DMACFG_ACT1_MASK                     (0x01UL << NFC_DMACFG_ACT1_SHIFT)                   /*!< NFC_DMACFG: ACT1 Mask                   */
#define NFC_DMACFG_ACT1_SHIFT                    1                                                   /*!< NFC_DMACFG: ACT1 Position               */
#define NFC_DMACFG_OFFSET2_MASK                  (0x0FUL << NFC_DMACFG_OFFSET2_SHIFT)                /*!< NFC_DMACFG: OFFSET2 Mask                */
#define NFC_DMACFG_OFFSET2_SHIFT                 9                                                   /*!< NFC_DMACFG: OFFSET2 Position            */
#define NFC_DMACFG_OFFSET2(x)                    (((uint32_t)(((uint32_t)(x))<<NFC_DMACFG_OFFSET2_SHIFT))&NFC_DMACFG_OFFSET2_MASK) /*!< NFC_DMACFG                              */
#define NFC_DMACFG_COUNT2_MASK                   (0x7FUL << NFC_DMACFG_COUNT2_SHIFT)                 /*!< NFC_DMACFG: COUNT2 Mask                 */
#define NFC_DMACFG_COUNT2_SHIFT                  13                                                  /*!< NFC_DMACFG: COUNT2 Position             */
#define NFC_DMACFG_COUNT2(x)                     (((uint32_t)(((uint32_t)(x))<<NFC_DMACFG_COUNT2_SHIFT))&NFC_DMACFG_COUNT2_MASK) /*!< NFC_DMACFG                              */
#define NFC_DMACFG_COUNT1_MASK                   (0xFFFUL << NFC_DMACFG_COUNT1_SHIFT)                /*!< NFC_DMACFG: COUNT1 Mask                 */
#define NFC_DMACFG_COUNT1_SHIFT                  20                                                  /*!< NFC_DMACFG: COUNT1 Position             */
#define NFC_DMACFG_COUNT1(x)                     (((uint32_t)(((uint32_t)(x))<<NFC_DMACFG_COUNT1_SHIFT))&NFC_DMACFG_COUNT1_MASK) /*!< NFC_DMACFG                              */
/* ------- SWAP Bit Fields                          ------ */
#define NFC_SWAP_ADDR2_MASK                      (0x7FFUL << NFC_SWAP_ADDR2_SHIFT)                   /*!< NFC_SWAP: ADDR2 Mask                    */
#define NFC_SWAP_ADDR2_SHIFT                     1                                                   /*!< NFC_SWAP: ADDR2 Position                */
#define NFC_SWAP_ADDR2(x)                        (((uint32_t)(((uint32_t)(x))<<NFC_SWAP_ADDR2_SHIFT))&NFC_SWAP_ADDR2_MASK) /*!< NFC_SWAP                                */
#define NFC_SWAP_ADDR1_MASK                      (0x7FFUL << NFC_SWAP_ADDR1_SHIFT)                   /*!< NFC_SWAP: ADDR1 Mask                    */
#define NFC_SWAP_ADDR1_SHIFT                     17                                                  /*!< NFC_SWAP: ADDR1 Position                */
#define NFC_SWAP_ADDR1(x)                        (((uint32_t)(((uint32_t)(x))<<NFC_SWAP_ADDR1_SHIFT))&NFC_SWAP_ADDR1_MASK) /*!< NFC_SWAP                                */
/* ------- SECSZ Bit Fields                         ------ */
#define NFC_SECSZ_SIZE_MASK                      (0x1FFFUL << NFC_SECSZ_SIZE_SHIFT)                  /*!< NFC_SECSZ: SIZE Mask                    */
#define NFC_SECSZ_SIZE_SHIFT                     0                                                   /*!< NFC_SECSZ: SIZE Position                */
#define NFC_SECSZ_SIZE(x)                        (((uint32_t)(((uint32_t)(x))<<NFC_SECSZ_SIZE_SHIFT))&NFC_SECSZ_SIZE_MASK) /*!< NFC_SECSZ                               */
/* ------- CFG Bit Fields                           ------ */
#define NFC_CFG_PAGECNT_MASK                     (0x0FUL << NFC_CFG_PAGECNT_SHIFT)                   /*!< NFC_CFG: PAGECNT Mask                   */
#define NFC_CFG_PAGECNT_SHIFT                    0                                                   /*!< NFC_CFG: PAGECNT Position               */
#define NFC_CFG_PAGECNT(x)                       (((uint32_t)(((uint32_t)(x))<<NFC_CFG_PAGECNT_SHIFT))&NFC_CFG_PAGECNT_MASK) /*!< NFC_CFG                                 */
#define NFC_CFG_AIBN_MASK                        (0x01UL << NFC_CFG_AIBN_SHIFT)                      /*!< NFC_CFG: AIBN Mask                      */
#define NFC_CFG_AIBN_SHIFT                       4                                                   /*!< NFC_CFG: AIBN Position                  */
#define NFC_CFG_AIAD_MASK                        (0x01UL << NFC_CFG_AIAD_SHIFT)                      /*!< NFC_CFG: AIAD Mask                      */
#define NFC_CFG_AIAD_SHIFT                       5                                                   /*!< NFC_CFG: AIAD Position                  */
#define NFC_CFG_BITWIDTH_MASK                    (0x01UL << NFC_CFG_BITWIDTH_SHIFT)                  /*!< NFC_CFG: BITWIDTH Mask                  */
#define NFC_CFG_BITWIDTH_SHIFT                   7                                                   /*!< NFC_CFG: BITWIDTH Position              */
#define NFC_CFG_TIMEOUT_MASK                     (0x1FUL << NFC_CFG_TIMEOUT_SHIFT)                   /*!< NFC_CFG: TIMEOUT Mask                   */
#define NFC_CFG_TIMEOUT_SHIFT                    8                                                   /*!< NFC_CFG: TIMEOUT Position               */
#define NFC_CFG_TIMEOUT(x)                       (((uint32_t)(((uint32_t)(x))<<NFC_CFG_TIMEOUT_SHIFT))&NFC_CFG_TIMEOUT_MASK) /*!< NFC_CFG                                 */
#define NFC_CFG_IDCNT_MASK                       (0x07UL << NFC_CFG_IDCNT_SHIFT)                     /*!< NFC_CFG: IDCNT Mask                     */
#define NFC_CFG_IDCNT_SHIFT                      13                                                  /*!< NFC_CFG: IDCNT Position                 */
#define NFC_CFG_IDCNT(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_CFG_IDCNT_SHIFT))&NFC_CFG_IDCNT_MASK) /*!< NFC_CFG                                 */
#define NFC_CFG_FAST_MASK                        (0x01UL << NFC_CFG_FAST_SHIFT)                      /*!< NFC_CFG: FAST Mask                      */
#define NFC_CFG_FAST_SHIFT                       16                                                  /*!< NFC_CFG: FAST Position                  */
#define NFC_CFG_ECCMODE_MASK                     (0x07UL << NFC_CFG_ECCMODE_SHIFT)                   /*!< NFC_CFG: ECCMODE Mask                   */
#define NFC_CFG_ECCMODE_SHIFT                    17                                                  /*!< NFC_CFG: ECCMODE Position               */
#define NFC_CFG_ECCMODE(x)                       (((uint32_t)(((uint32_t)(x))<<NFC_CFG_ECCMODE_SHIFT))&NFC_CFG_ECCMODE_MASK) /*!< NFC_CFG                                 */
#define NFC_CFG_DMAREQ_MASK                      (0x01UL << NFC_CFG_DMAREQ_SHIFT)                    /*!< NFC_CFG: DMAREQ Mask                    */
#define NFC_CFG_DMAREQ_SHIFT                     20                                                  /*!< NFC_CFG: DMAREQ Position                */
#define NFC_CFG_ECCSRAM_MASK                     (0x01UL << NFC_CFG_ECCSRAM_SHIFT)                   /*!< NFC_CFG: ECCSRAM Mask                   */
#define NFC_CFG_ECCSRAM_SHIFT                    21                                                  /*!< NFC_CFG: ECCSRAM Position               */
#define NFC_CFG_ECCAD_MASK                       (0x1FFUL << NFC_CFG_ECCAD_SHIFT)                    /*!< NFC_CFG: ECCAD Mask                     */
#define NFC_CFG_ECCAD_SHIFT                      22                                                  /*!< NFC_CFG: ECCAD Position                 */
#define NFC_CFG_ECCAD(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_CFG_ECCAD_SHIFT))&NFC_CFG_ECCAD_MASK) /*!< NFC_CFG                                 */
#define NFC_CFG_STOPWERR_MASK                    (0x01UL << NFC_CFG_STOPWERR_SHIFT)                  /*!< NFC_CFG: STOPWERR Mask                  */
#define NFC_CFG_STOPWERR_SHIFT                   31                                                  /*!< NFC_CFG: STOPWERR Position              */
/* ------- DMA2 Bit Fields                          ------ */
#define NFC_DMA2_ADDRESS_MASK                    (0xFFFFFFFFUL << NFC_DMA2_ADDRESS_SHIFT)            /*!< NFC_DMA2: ADDRESS Mask                  */
#define NFC_DMA2_ADDRESS_SHIFT                   0                                                   /*!< NFC_DMA2: ADDRESS Position              */
#define NFC_DMA2_ADDRESS(x)                      (((uint32_t)(((uint32_t)(x))<<NFC_DMA2_ADDRESS_SHIFT))&NFC_DMA2_ADDRESS_MASK) /*!< NFC_DMA2                                */
/* ------- ISR Bit Fields                           ------ */
