podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define NFC_ISR_DMABN_MASK                       (0x03UL << NFC_ISR_DMABN_SHIFT)                     /*!< NFC_ISR: DMABN Mask                     */
#define NFC_ISR_DMABN_SHIFT                      0                                                   /*!< NFC_ISR: DMABN Position                 */
#define NFC_ISR_DMABN(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_ISR_DMABN_SHIFT))&NFC_ISR_DMABN_MASK) /*!< NFC_ISR                                 */
#define NFC_ISR_ECCBN_MASK                       (0x03UL << NFC_ISR_ECCBN_SHIFT)                     /*!< NFC_ISR: ECCBN Mask                     */
#define NFC_ISR_ECCBN_SHIFT                      2                                                   /*!< NFC_ISR: ECCBN Position                 */
#define NFC_ISR_ECCBN(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_ISR_ECCBN_SHIFT))&NFC_ISR_ECCBN_MASK) /*!< NFC_ISR                                 */
#define NFC_ISR_RESBN_MASK                       (0x03UL << NFC_ISR_RESBN_SHIFT)                     /*!< NFC_ISR: RESBN Mask                     */
#define NFC_ISR_RESBN_SHIFT                      4                                                   /*!< NFC_ISR: RESBN Position                 */
#define NFC_ISR_RESBN(x)                         (((uint32_t)(((uint32_t)(x))<<NFC_ISR_RESBN_SHIFT))&NFC_ISR_RESBN_MASK) /*!< NFC_ISR                                 */
#define NFC_ISR_IDLECLR_MASK                     (0x01UL << NFC_ISR_IDLECLR_SHIFT)                   /*!< NFC_ISR: IDLECLR Mask                   */
#define NFC_ISR_IDLECLR_SHIFT                    17                                                  /*!< NFC_ISR: IDLECLR Position               */
#define NFC_ISR_DONECLR_MASK                     (0x01UL << NFC_ISR_DONECLR_SHIFT)                   /*!< NFC_ISR: DONECLR Mask                   */
#define NFC_ISR_DONECLR_SHIFT                    18                                                  /*!< NFC_ISR: DONECLR Position               */
#define NFC_ISR_WERRCLR_MASK                     (0x01UL << NFC_ISR_WERRCLR_SHIFT)                   /*!< NFC_ISR: WERRCLR Mask                   */
#define NFC_ISR_WERRCLR_SHIFT                    19                                                  /*!< NFC_ISR: WERRCLR Position               */
#define NFC_ISR_IDLEEN_MASK                      (0x01UL << NFC_ISR_IDLEEN_SHIFT)                    /*!< NFC_ISR: IDLEEN Mask                    */
#define NFC_ISR_IDLEEN_SHIFT                     20                                                  /*!< NFC_ISR: IDLEEN Position                */
#define NFC_ISR_DONEEN_MASK                      (0x01UL << NFC_ISR_DONEEN_SHIFT)                    /*!< NFC_ISR: DONEEN Mask                    */
#define NFC_ISR_DONEEN_SHIFT                     21                                                  /*!< NFC_ISR: DONEEN Position                */
#define NFC_ISR_WERREN_MASK                      (0x01UL << NFC_ISR_WERREN_SHIFT)                    /*!< NFC_ISR: WERREN Mask                    */
#define NFC_ISR_WERREN_SHIFT                     22                                                  /*!< NFC_ISR: WERREN Position                */
#define NFC_ISR_DMABUSY_MASK                     (0x01UL << NFC_ISR_DMABUSY_SHIFT)                   /*!< NFC_ISR: DMABUSY Mask                   */
#define NFC_ISR_DMABUSY_SHIFT                    23                                                  /*!< NFC_ISR: DMABUSY Position               */
#define NFC_ISR_ECCBUSY_MASK                     (0x01UL << NFC_ISR_ECCBUSY_SHIFT)                   /*!< NFC_ISR: ECCBUSY Mask                   */
#define NFC_ISR_ECCBUSY_SHIFT                    24                                                  /*!< NFC_ISR: ECCBUSY Position               */
#define NFC_ISR_RESBUSY_MASK                     (0x01UL << NFC_ISR_RESBUSY_SHIFT)                   /*!< NFC_ISR: RESBUSY Mask                   */
#define NFC_ISR_RESBUSY_SHIFT                    25                                                  /*!< NFC_ISR: RESBUSY Position               */
#define NFC_ISR_CMDBUSY_MASK                     (0x01UL << NFC_ISR_CMDBUSY_SHIFT)                   /*!< NFC_ISR: CMDBUSY Mask                   */
#define NFC_ISR_CMDBUSY_SHIFT                    26                                                  /*!< NFC_ISR: CMDBUSY Position               */
#define NFC_ISR_WERRNS_MASK                      (0x01UL << NFC_ISR_WERRNS_SHIFT)                    /*!< NFC_ISR: WERRNS Mask                    */
#define NFC_ISR_WERRNS_SHIFT                     27                                                  /*!< NFC_ISR: WERRNS Position                */
#define NFC_ISR_IDLE_MASK                        (0x01UL << NFC_ISR_IDLE_SHIFT)                      /*!< NFC_ISR: IDLE Mask                      */
#define NFC_ISR_IDLE_SHIFT                       29                                                  /*!< NFC_ISR: IDLE Position                  */
#define NFC_ISR_DONE_MASK                        (0x01UL << NFC_ISR_DONE_SHIFT)                      /*!< NFC_ISR: DONE Mask                      */
#define NFC_ISR_DONE_SHIFT                       30                                                  /*!< NFC_ISR: DONE Position                  */
#define NFC_ISR_WERR_MASK                        (0x01UL << NFC_ISR_WERR_SHIFT)                      /*!< NFC_ISR: WERR Mask                      */
#define NFC_ISR_WERR_SHIFT                       31                                                  /*!< NFC_ISR: WERR Position                  */
/**
 * @} */ /* End group NFC_Register_Masks_GROUP 
 */

/* NFC - Peripheral instance base addresses */
#define NFC_BasePtr                    0x400A8000UL //!< Peripheral base address
#define NFC                            ((NFC_Type *) NFC_BasePtr) //!< Freescale base pointer
#define NFC_BASE_PTR                   (NFC) //!< Freescale style base pointer
/**
 * @} */ /* End group NFC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup NV_Peripheral_access_layer_GROUP NV Peripheral Access Layer
* @brief C Struct for NV
* @{
*/

/* ================================================================================ */
/* ================           NV (file:NV_MK2)                     ================ */
/* ================================================================================ */

/**
 * @brief Flash configuration field
 */
/**
* @addtogroup NV_structs_GROUP NV struct
* @brief Struct for NV
* @{
*/
typedef struct {                                /*       NV Structure                                                 */
   __I  uint8_t   BACKKEY3;                     /**< 0000: Backdoor Comparison Key 3                                    */
   __I  uint8_t   BACKKEY2;                     /**< 0001: Backdoor Comparison Key 2                                    */
   __I  uint8_t   BACKKEY1;                     /**< 0002: Backdoor Comparison Key 1                                    */
   __I  uint8_t   BACKKEY0;                     /**< 0003: Backdoor Comparison Key 0                                    */
   __I  uint8_t   BACKKEY7;                     /**< 0004: Backdoor Comparison Key 7                                    */
   __I  uint8_t   BACKKEY6;                     /**< 0005: Backdoor Comparison Key 6                                    */
   __I  uint8_t   BACKKEY5;                     /**< 0006: Backdoor Comparison Key 5                                    */
   __I  uint8_t   BACKKEY4;                     /**< 0007: Backdoor Comparison Key 4                                    */
   __I  uint8_t   FPROT3;                       /**< 0008: Non-volatile P-Flash Protection Register                     */
   __I  uint8_t   FPROT2;                       /**< 0009: Non-volatile P-Flash Protection Register                     */
   __I  uint8_t   FPROT1;                       /**< 000A: Non-volatile P-Flash Protection Register                     */
   __I  uint8_t   FPROT0;                       /**< 000B: Non-volatile P-Flash Protection Register                     */
   __I  uint8_t   FSEC;                         /**< 000C: Non-volatile Flash Security Register                         */
   __I  uint8_t   FOPT;                         /**< 000D: Non-volatile Flash Option Register                           */
   __I  uint8_t   FEPROT;                       /**< 000E: Non-volatile EEPROM Protection Register                      */
   __I  uint8_t   FDPROT;                       /**< 000F: Non-volatile D-Flash Protection Register                     */
} NV_Type;

/**
 * @} */ /* End group NV_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'NV' Position & Mask macros                          ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup NV_Register_Masks_GROUP NV Register Masks
* @brief Register Masks for NV
* @{
*/
/* ------- BACKKEY Bit Fields                       ------ */
#define NV_BACKKEY_KEY_MASK                      (0xFFUL << NV_BACKKEY_KEY_SHIFT)                    /*!< NV_BACKKEY: KEY Mask                    */
#define NV_BACKKEY_KEY_SHIFT                     0                                                   /*!< NV_BACKKEY: KEY Position                */
#define NV_BACKKEY_KEY(x)                        (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY_KEY_SHIFT))&NV_BACKKEY_KEY_MASK) /*!< NV_BACKKEY                              */
/* ------- FPROT Bit Fields                         ------ */
#define NV_FPROT_PROT_MASK                       (0xFFUL << NV_FPROT_PROT_SHIFT)                     /*!< NV_FPROT: PROT Mask                     */
#define NV_FPROT_PROT_SHIFT                      0                                                   /*!< NV_FPROT: PROT Position                 */
#define NV_FPROT_PROT(x)                         (((uint8_t)(((uint8_t)(x))<<NV_FPROT_PROT_SHIFT))&NV_FPROT_PROT_MASK) /*!< NV_FPROT                                */
/* ------- FSEC Bit Fields                          ------ */
#define NV_FSEC_SEC_MASK                         (0x03UL << NV_FSEC_SEC_SHIFT)                       /*!< NV_FSEC: SEC Mask                       */
#define NV_FSEC_SEC_SHIFT                        0                                                   /*!< NV_FSEC: SEC Position                   */
#define NV_FSEC_SEC(x)                           (((uint8_t)(((uint8_t)(x))<<NV_FSEC_SEC_SHIFT))&NV_FSEC_SEC_MASK) /*!< NV_FSEC                                 */
#define NV_FSEC_FSLACC_MASK                      (0x03UL << NV_FSEC_FSLACC_SHIFT)                    /*!< NV_FSEC: FSLACC Mask                    */
#define NV_FSEC_FSLACC_SHIFT                     2                                                   /*!< NV_FSEC: FSLACC Position                */
#define NV_FSEC_FSLACC(x)                        (((uint8_t)(((uint8_t)(x))<<NV_FSEC_FSLACC_SHIFT))&NV_FSEC_FSLACC_MASK) /*!< NV_FSEC                                 */
#define NV_FSEC_MEEN_MASK                        (0x03UL << NV_FSEC_MEEN_SHIFT)                      /*!< NV_FSEC: MEEN Mask                      */
#define NV_FSEC_MEEN_SHIFT                       4                                                   /*!< NV_FSEC: MEEN Position                  */
#define NV_FSEC_MEEN(x)                          (((uint8_t)(((uint8_t)(x))<<NV_FSEC_MEEN_SHIFT))&NV_FSEC_MEEN_MASK) /*!< NV_FSEC                                 */
#define NV_FSEC_KEYEN_MASK                       (0x03UL << NV_FSEC_KEYEN_SHIFT)                     /*!< NV_FSEC: KEYEN Mask                     */
#define NV_FSEC_KEYEN_SHIFT                      6                                                   /*!< NV_FSEC: KEYEN Position                 */
#define NV_FSEC_KEYEN(x)                         (((uint8_t)(((uint8_t)(x))<<NV_FSEC_KEYEN_SHIFT))&NV_FSEC_KEYEN_MASK) /*!< NV_FSEC                                 */
/* ------- FOPT Bit Fields                          ------ */
#define NV_FOPT_LPBOOT_MASK                      (0x01UL << NV_FOPT_LPBOOT_SHIFT)                    /*!< NV_FOPT: LPBOOT Mask                    */
#define NV_FOPT_LPBOOT_SHIFT                     0                                                   /*!< NV_FOPT: LPBOOT Position                */
#define NV_FOPT_EZPORT_DIS_MASK                  (0x01UL << NV_FOPT_EZPORT_DIS_SHIFT)                /*!< NV_FOPT: EZPORT_DIS Mask                */
#define NV_FOPT_EZPORT_DIS_SHIFT                 1                                                   /*!< NV_FOPT: EZPORT_DIS Position            */
/* ------- FEPROT Bit Fields                        ------ */
#define NV_FEPROT_EPROT_MASK                     (0xFFUL << NV_FEPROT_EPROT_SHIFT)                   /*!< NV_FEPROT: EPROT Mask                   */
#define NV_FEPROT_EPROT_SHIFT                    0                                                   /*!< NV_FEPROT: EPROT Position               */
#define NV_FEPROT_EPROT(x)                       (((uint8_t)(((uint8_t)(x))<<NV_FEPROT_EPROT_SHIFT))&NV_FEPROT_EPROT_MASK) /*!< NV_FEPROT                               */
/* ------- FDPROT Bit Fields                        ------ */
#define NV_FDPROT_DPROT_MASK                     (0xFFUL << NV_FDPROT_DPROT_SHIFT)                   /*!< NV_FDPROT: DPROT Mask                   */
#define NV_FDPROT_DPROT_SHIFT                    0                                                   /*!< NV_FDPROT: DPROT Position               */
#define NV_FDPROT_DPROT(x)                       (((uint8_t)(((uint8_t)(x))<<NV_FDPROT_DPROT_SHIFT))&NV_FDPROT_DPROT_MASK) /*!< NV_FDPROT                               */
/**
 * @} */ /* End group NV_Register_Masks_GROUP 
 */

