podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup RTC_Register_Masks_GROUP RTC Register Masks
* @brief Register Masks for RTC
* @{
*/
/* ------- TSR Bit Fields                           ------ */
#define RTC_TSR_TSR_MASK                         (0xFFFFFFFFUL << RTC_TSR_TSR_SHIFT)                 /*!< RTC_TSR: TSR Mask                       */
#define RTC_TSR_TSR_SHIFT                        0                                                   /*!< RTC_TSR: TSR Position                   */
#define RTC_TSR_TSR(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_TSR_TSR_SHIFT))&RTC_TSR_TSR_MASK) /*!< RTC_TSR                                 */
/* ------- TPR Bit Fields                           ------ */
#define RTC_TPR_TPR_MASK                         (0xFFFFUL << RTC_TPR_TPR_SHIFT)                     /*!< RTC_TPR: TPR Mask                       */
#define RTC_TPR_TPR_SHIFT                        0                                                   /*!< RTC_TPR: TPR Position                   */
#define RTC_TPR_TPR(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_TPR_TPR_SHIFT))&RTC_TPR_TPR_MASK) /*!< RTC_TPR                                 */
/* ------- TAR Bit Fields                           ------ */
#define RTC_TAR_TAR_MASK                         (0xFFFFFFFFUL << RTC_TAR_TAR_SHIFT)                 /*!< RTC_TAR: TAR Mask                       */
#define RTC_TAR_TAR_SHIFT                        0                                                   /*!< RTC_TAR: TAR Position                   */
#define RTC_TAR_TAR(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_TAR_TAR_SHIFT))&RTC_TAR_TAR_MASK) /*!< RTC_TAR                                 */
/* ------- TCR Bit Fields                           ------ */
#define RTC_TCR_TCR_MASK                         (0xFFUL << RTC_TCR_TCR_SHIFT)                       /*!< RTC_TCR: TCR Mask                       */
#define RTC_TCR_TCR_SHIFT                        0                                                   /*!< RTC_TCR: TCR Position                   */
#define RTC_TCR_TCR(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_TCR_TCR_SHIFT))&RTC_TCR_TCR_MASK) /*!< RTC_TCR                                 */
#define RTC_TCR_CIR_MASK                         (0xFFUL << RTC_TCR_CIR_SHIFT)                       /*!< RTC_TCR: CIR Mask                       */
#define RTC_TCR_CIR_SHIFT                        8                                                   /*!< RTC_TCR: CIR Position                   */
#define RTC_TCR_CIR(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_TCR_CIR_SHIFT))&RTC_TCR_CIR_MASK) /*!< RTC_TCR                                 */
#define RTC_TCR_TCV_MASK                         (0xFFUL << RTC_TCR_TCV_SHIFT)                       /*!< RTC_TCR: TCV Mask                       */
#define RTC_TCR_TCV_SHIFT                        16                                                  /*!< RTC_TCR: TCV Position                   */
#define RTC_TCR_TCV(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_TCR_TCV_SHIFT))&RTC_TCR_TCV_MASK) /*!< RTC_TCR                                 */
#define RTC_TCR_CIC_MASK                         (0xFFUL << RTC_TCR_CIC_SHIFT)                       /*!< RTC_TCR: CIC Mask                       */
#define RTC_TCR_CIC_SHIFT                        24                                                  /*!< RTC_TCR: CIC Position                   */
#define RTC_TCR_CIC(x)                           (((uint32_t)(((uint32_t)(x))<<RTC_TCR_CIC_SHIFT))&RTC_TCR_CIC_MASK) /*!< RTC_TCR                                 */
/* ------- CR Bit Fields                            ------ */
#define RTC_CR_SWR_MASK                          (0x01UL << RTC_CR_SWR_SHIFT)                        /*!< RTC_CR: SWR Mask                        */
#define RTC_CR_SWR_SHIFT                         0                                                   /*!< RTC_CR: SWR Position                    */
#define RTC_CR_WPE_MASK                          (0x01UL << RTC_CR_WPE_SHIFT)                        /*!< RTC_CR: WPE Mask                        */
#define RTC_CR_WPE_SHIFT                         1                                                   /*!< RTC_CR: WPE Position                    */
#define RTC_CR_SUP_MASK                          (0x01UL << RTC_CR_SUP_SHIFT)                        /*!< RTC_CR: SUP Mask                        */
#define RTC_CR_SUP_SHIFT                         2                                                   /*!< RTC_CR: SUP Position                    */
#define RTC_CR_UM_MASK                           (0x01UL << RTC_CR_UM_SHIFT)                         /*!< RTC_CR: UM Mask                         */
#define RTC_CR_UM_SHIFT                          3                                                   /*!< RTC_CR: UM Position                     */
#define RTC_CR_OSCE_MASK                         (0x01UL << RTC_CR_OSCE_SHIFT)                       /*!< RTC_CR: OSCE Mask                       */
#define RTC_CR_OSCE_SHIFT                        8                                                   /*!< RTC_CR: OSCE Position                   */
#define RTC_CR_CLKO_MASK                         (0x01UL << RTC_CR_CLKO_SHIFT)                       /*!< RTC_CR: CLKO Mask                       */
#define RTC_CR_CLKO_SHIFT                        9                                                   /*!< RTC_CR: CLKO Position                   */
#define RTC_CR_SC16P_MASK                        (0x01UL << RTC_CR_SC16P_SHIFT)                      /*!< RTC_CR: SC16P Mask                      */
#define RTC_CR_SC16P_SHIFT                       10                                                  /*!< RTC_CR: SC16P Position                  */
#define RTC_CR_SC8P_MASK                         (0x01UL << RTC_CR_SC8P_SHIFT)                       /*!< RTC_CR: SC8P Mask                       */
#define RTC_CR_SC8P_SHIFT                        11                                                  /*!< RTC_CR: SC8P Position                   */
#define RTC_CR_SC4P_MASK                         (0x01UL << RTC_CR_SC4P_SHIFT)                       /*!< RTC_CR: SC4P Mask                       */
#define RTC_CR_SC4P_SHIFT                        12                                                  /*!< RTC_CR: SC4P Position                   */
#define RTC_CR_SC2P_MASK                         (0x01UL << RTC_CR_SC2P_SHIFT)                       /*!< RTC_CR: SC2P Mask                       */
#define RTC_CR_SC2P_SHIFT                        13                                                  /*!< RTC_CR: SC2P Position                   */
/* ------- SR Bit Fields                            ------ */
#define RTC_SR_TIF_MASK                          (0x01UL << RTC_SR_TIF_SHIFT)                        /*!< RTC_SR: TIF Mask                        */
#define RTC_SR_TIF_SHIFT                         0                                                   /*!< RTC_SR: TIF Position                    */
#define RTC_SR_TOF_MASK                          (0x01UL << RTC_SR_TOF_SHIFT)                        /*!< RTC_SR: TOF Mask                        */
#define RTC_SR_TOF_SHIFT                         1                                                   /*!< RTC_SR: TOF Position                    */
#define RTC_SR_TAF_MASK                          (0x01UL << RTC_SR_TAF_SHIFT)                        /*!< RTC_SR: TAF Mask                        */
#define RTC_SR_TAF_SHIFT                         2                                                   /*!< RTC_SR: TAF Position                    */
#define RTC_SR_MOF_MASK                          (0x01UL << RTC_SR_MOF_SHIFT)                        /*!< RTC_SR: MOF Mask                        */
#define RTC_SR_MOF_SHIFT                         3                                                   /*!< RTC_SR: MOF Position                    */
#define RTC_SR_TCE_MASK                          (0x01UL << RTC_SR_TCE_SHIFT)                        /*!< RTC_SR: TCE Mask                        */
#define RTC_SR_TCE_SHIFT                         4                                                   /*!< RTC_SR: TCE Position                    */
/* ------- LR Bit Fields                            ------ */
#define RTC_LR_TCL_MASK                          (0x01UL << RTC_LR_TCL_SHIFT)                        /*!< RTC_LR: TCL Mask                        */
#define RTC_LR_TCL_SHIFT                         3                                                   /*!< RTC_LR: TCL Position                    */
#define RTC_LR_CRL_MASK                          (0x01UL << RTC_LR_CRL_SHIFT)                        /*!< RTC_LR: CRL Mask                        */
#define RTC_LR_CRL_SHIFT                         4                                                   /*!< RTC_LR: CRL Position                    */
#define RTC_LR_SRL_MASK                          (0x01UL << RTC_LR_SRL_SHIFT)                        /*!< RTC_LR: SRL Mask                        */
#define RTC_LR_SRL_SHIFT                         5                                                   /*!< RTC_LR: SRL Position                    */
#define RTC_LR_LRL_MASK                          (0x01UL << RTC_LR_LRL_SHIFT)                        /*!< RTC_LR: LRL Mask                        */
#define RTC_LR_LRL_SHIFT                         6                                                   /*!< RTC_LR: LRL Position                    */
#define RTC_LR_TTSL_MASK                         (0x01UL << RTC_LR_TTSL_SHIFT)                       /*!< RTC_LR: TTSL Mask                       */
#define RTC_LR_TTSL_SHIFT                        8                                                   /*!< RTC_LR: TTSL Position                   */
#define RTC_LR_MEL_MASK                          (0x01UL << RTC_LR_MEL_SHIFT)                        /*!< RTC_LR: MEL Mask                        */
#define RTC_LR_MEL_SHIFT                         9                                                   /*!< RTC_LR: MEL Position                    */
#define RTC_LR_MCLL_MASK                         (0x01UL << RTC_LR_MCLL_SHIFT)                       /*!< RTC_LR: MCLL Mask                       */
#define RTC_LR_MCLL_SHIFT                        10                                                  /*!< RTC_LR: MCLL Position                   */
#define RTC_LR_MCHL_MASK                         (0x01UL << RTC_LR_MCHL_SHIFT)                       /*!< RTC_LR: MCHL Mask                       */
#define RTC_LR_MCHL_SHIFT                        11                                                  /*!< RTC_LR: MCHL Position                   */
#define RTC_LR_TEL_MASK                          (0x01UL << RTC_LR_TEL_SHIFT)                        /*!< RTC_LR: TEL Mask                        */
#define RTC_LR_TEL_SHIFT                         12                                                  /*!< RTC_LR: TEL Position                    */
#define RTC_LR_TDL_MASK                          (0x01UL << RTC_LR_TDL_SHIFT)                        /*!< RTC_LR: TDL Mask                        */
#define RTC_LR_TDL_SHIFT                         13                                                  /*!< RTC_LR: TDL Position                    */
#define RTC_LR_TTL_MASK                          (0x01UL << RTC_LR_TTL_SHIFT)                        /*!< RTC_LR: TTL Mask                        */
#define RTC_LR_TTL_SHIFT                         14                                                  /*!< RTC_LR: TTL Position                    */
#define RTC_LR_TIL_MASK                          (0x01UL << RTC_LR_TIL_SHIFT)                        /*!< RTC_LR: TIL Mask                        */
#define RTC_LR_TIL_SHIFT                         15                                                  /*!< RTC_LR: TIL Position                    */
/* ------- IER Bit Fields                           ------ */
#define RTC_IER_TIIE_MASK                        (0x01UL << RTC_IER_TIIE_SHIFT)                      /*!< RTC_IER: TIIE Mask                      */
#define RTC_IER_TIIE_SHIFT                       0                                                   /*!< RTC_IER: TIIE Position                  */
#define RTC_IER_TOIE_MASK                        (0x01UL << RTC_IER_TOIE_SHIFT)                      /*!< RTC_IER: TOIE Mask                      */
#define RTC_IER_TOIE_SHIFT                       1                                                   /*!< RTC_IER: TOIE Position                  */
#define RTC_IER_TAIE_MASK                        (0x01UL << RTC_IER_TAIE_SHIFT)                      /*!< RTC_IER: TAIE Mask                      */
#define RTC_IER_TAIE_SHIFT                       2                                                   /*!< RTC_IER: TAIE Position                  */
#define RTC_IER_MOIE_MASK                        (0x01UL << RTC_IER_MOIE_SHIFT)                      /*!< RTC_IER: MOIE Mask                      */
#define RTC_IER_MOIE_SHIFT                       3                                                   /*!< RTC_IER: MOIE Position                  */
#define RTC_IER_TSIE_MASK                        (0x01UL << RTC_IER_TSIE_SHIFT)                      /*!< RTC_IER: TSIE Mask                      */
#define RTC_IER_TSIE_SHIFT                       4                                                   /*!< RTC_IER: TSIE Position                  */
/* ------- TTSR Bit Fields                          ------ */
#define RTC_TTSR_TTS_MASK                        (0xFFFFFFFFUL << RTC_TTSR_TTS_SHIFT)                /*!< RTC_TTSR: TTS Mask                      */
#define RTC_TTSR_TTS_SHIFT                       0                                                   /*!< RTC_TTSR: TTS Position                  */
#define RTC_TTSR_TTS(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_TTSR_TTS_SHIFT))&RTC_TTSR_TTS_MASK) /*!< RTC_TTSR                                */
/* ------- MER Bit Fields                           ------ */
#define RTC_MER_MCE_MASK                         (0x01UL << RTC_MER_MCE_SHIFT)                       /*!< RTC_MER: MCE Mask                       */
#define RTC_MER_MCE_SHIFT                        4                                                   /*!< RTC_MER: MCE Position                   */
/* ------- MCLR Bit Fields                          ------ */
#define RTC_MCLR_MCL_MASK                        (0xFFFFFFFFUL << RTC_MCLR_MCL_SHIFT)                /*!< RTC_MCLR: MCL Mask                      */
#define RTC_MCLR_MCL_SHIFT                       0                                                   /*!< RTC_MCLR: MCL Position                  */
#define RTC_MCLR_MCL(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_MCLR_MCL_SHIFT))&RTC_MCLR_MCL_MASK) /*!< RTC_MCLR                                */
/* ------- MCHR Bit Fields                          ------ */
#define RTC_MCHR_MCH_MASK                        (0xFFFFFFFFUL << RTC_MCHR_MCH_SHIFT)                /*!< RTC_MCHR: MCH Mask                      */
#define RTC_MCHR_MCH_SHIFT                       0                                                   /*!< RTC_MCHR: MCH Position                  */
#define RTC_MCHR_MCH(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_MCHR_MCH_SHIFT))&RTC_MCHR_MCH_MASK) /*!< RTC_MCHR                                */
/* ------- TER Bit Fields                           ------ */
#define RTC_TER_DTE_MASK                         (0x01UL << RTC_TER_DTE_SHIFT)                       /*!< RTC_TER: DTE Mask                       */
#define RTC_TER_DTE_SHIFT                        0                                                   /*!< RTC_TER: DTE Position                   */
#define RTC_TER_VTE_MASK                         (0x01UL << RTC_TER_VTE_SHIFT)                       /*!< RTC_TER: VTE Mask                       */
#define RTC_TER_VTE_SHIFT                        1                                                   /*!< RTC_TER: VTE Position                   */
#define RTC_TER_CTE_MASK                         (0x01UL << RTC_TER_CTE_SHIFT)                       /*!< RTC_TER: CTE Mask                       */
#define RTC_TER_CTE_SHIFT                        2                                                   /*!< RTC_TER: CTE Position                   */
#define RTC_TER_TTE_MASK                         (0x01UL << RTC_TER_TTE_SHIFT)                       /*!< RTC_TER: TTE Mask                       */
#define RTC_TER_TTE_SHIFT                        3                                                   /*!< RTC_TER: TTE Position                   */
#define RTC_TER_FSE_MASK                         (0x01UL << RTC_TER_FSE_SHIFT)                       /*!< RTC_TER: FSE Mask                       */
#define RTC_TER_FSE_SHIFT                        4                                                   /*!< RTC_TER: FSE Position                   */
#define RTC_TER_TME_MASK                         (0x01UL << RTC_TER_TME_SHIFT)                       /*!< RTC_TER: TME Mask                       */
#define RTC_TER_TME_SHIFT                        5                                                   /*!< RTC_TER: TME Position                   */
/* ------- TDR Bit Fields                           ------ */
#define RTC_TDR_DTF_MASK                         (0x01UL << RTC_TDR_DTF_SHIFT)                       /*!< RTC_TDR: DTF Mask                       */
#define RTC_TDR_DTF_SHIFT                        0                                                   /*!< RTC_TDR: DTF Position                   */
#define RTC_TDR_VTF_MASK                         (0x01UL << RTC_TDR_VTF_SHIFT)                       /*!< RTC_TDR: VTF Mask                       */
#define RTC_TDR_VTF_SHIFT                        1                                                   /*!< RTC_TDR: VTF Position                   */
#define RTC_TDR_CTF_MASK                         (0x01UL << RTC_TDR_CTF_SHIFT)                       /*!< RTC_TDR: CTF Mask                       */
#define RTC_TDR_CTF_SHIFT                        2                                                   /*!< RTC_TDR: CTF Position                   */
#define RTC_TDR_TTF_MASK                         (0x01UL << RTC_TDR_TTF_SHIFT)                       /*!< RTC_TDR: TTF Mask                       */
#define RTC_TDR_TTF_SHIFT                        3                                                   /*!< RTC_TDR: TTF Position                   */
#define RTC_TDR_FSF_MASK                         (0x01UL << RTC_TDR_FSF_SHIFT)                       /*!< RTC_TDR: FSF Mask                       */
#define RTC_TDR_FSF_SHIFT                        4                                                   /*!< RTC_TDR: FSF Position                   */
#define RTC_TDR_TMF_MASK                         (0x01UL << RTC_TDR_TMF_SHIFT)                       /*!< RTC_TDR: TMF Mask                       */
#define RTC_TDR_TMF_SHIFT                        5                                                   /*!< RTC_TDR: TMF Position                   */
/* ------- TTR Bit Fields                           ------ */
#define RTC_TTR_VDTL_MASK                        (0x07UL << RTC_TTR_VDTL_SHIFT)                      /*!< RTC_TTR: VDTL Mask                      */
#define RTC_TTR_VDTL_SHIFT                       0                                                   /*!< RTC_TTR: VDTL Position                  */
#define RTC_TTR_VDTL(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_TTR_VDTL_SHIFT))&RTC_TTR_VDTL_MASK) /*!< RTC_TTR                                 */
#define RTC_TTR_VDTH_MASK                        (0x07UL << RTC_TTR_VDTH_SHIFT)                      /*!< RTC_TTR: VDTH Mask                      */
#define RTC_TTR_VDTH_SHIFT                       3                                                   /*!< RTC_TTR: VDTH Position                  */
#define RTC_TTR_VDTH(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_TTR_VDTH_SHIFT))&RTC_TTR_VDTH_MASK) /*!< RTC_TTR                                 */
#define RTC_TTR_CDTL_MASK                        (0x07UL << RTC_TTR_CDTL_SHIFT)                      /*!< RTC_TTR: CDTL Mask                      */
#define RTC_TTR_CDTL_SHIFT                       6                                                   /*!< RTC_TTR: CDTL Position                  */
#define RTC_TTR_CDTL(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_TTR_CDTL_SHIFT))&RTC_TTR_CDTL_MASK) /*!< RTC_TTR                                 */
#define RTC_TTR_CDTH_MASK                        (0x07UL << RTC_TTR_CDTH_SHIFT)                      /*!< RTC_TTR: CDTH Mask                      */
#define RTC_TTR_CDTH_SHIFT                       9                                                   /*!< RTC_TTR: CDTH Position                  */
#define RTC_TTR_CDTH(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_TTR_CDTH_SHIFT))&RTC_TTR_CDTH_MASK) /*!< RTC_TTR                                 */
#define RTC_TTR_TDTH_MASK                        (0x07UL << RTC_TTR_TDTH_SHIFT)                      /*!< RTC_TTR: TDTH Mask                      */
#define RTC_TTR_TDTH_SHIFT                       12                                                  /*!< RTC_TTR: TDTH Position                  */
#define RTC_TTR_TDTH(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_TTR_TDTH_SHIFT))&RTC_TTR_TDTH_MASK) /*!< RTC_TTR                                 */
#define RTC_TTR_TDTL_MASK                        (0x07UL << RTC_TTR_TDTL_SHIFT)                      /*!< RTC_TTR: TDTL Mask                      */
#define RTC_TTR_TDTL_SHIFT                       15                                                  /*!< RTC_TTR: TDTL Position                  */
#define RTC_TTR_TDTL(x)                          (((uint32_t)(((uint32_t)(x))<<RTC_TTR_TDTL_SHIFT))&RTC_TTR_TDTL_MASK) /*!< RTC_TTR                                 */
/* ------- TIR Bit Fields                           ------ */
#define RTC_TIR_DTIE_MASK                        (0x01UL << RTC_TIR_DTIE_SHIFT)                      /*!< RTC_TIR: DTIE Mask                      */
#define RTC_TIR_DTIE_SHIFT                       0                                                   /*!< RTC_TIR: DTIE Position                  */
#define RTC_TIR_VTIE_MASK                        (0x01UL << RTC_TIR_VTIE_SHIFT)                      /*!< RTC_TIR: VTIE Mask                      */
#define RTC_TIR_VTIE_SHIFT                       1                                                   /*!< RTC_TIR: VTIE Position                  */
#define RTC_TIR_CTIE_MASK                        (0x01UL << RTC_TIR_CTIE_SHIFT)                      /*!< RTC_TIR: CTIE Mask                      */
#define RTC_TIR_CTIE_SHIFT                       2                                                   /*!< RTC_TIR: CTIE Position                  */
#define RTC_TIR_TTIE_MASK                        (0x01UL << RTC_TIR_TTIE_SHIFT)                      /*!< RTC_TIR: TTIE Mask                      */
#define RTC_TIR_TTIE_SHIFT                       3                                                   /*!< RTC_TIR: TTIE Position                  */
#define RTC_TIR_FSIE_MASK                        (0x01UL << RTC_TIR_FSIE_SHIFT)                      /*!< RTC_TIR: FSIE Mask                      */
#define RTC_TIR_FSIE_SHIFT                       4                                                   /*!< RTC_TIR: FSIE Position                  */
#define RTC_TIR_TMIE_MASK                        (0x01UL << RTC_TIR_TMIE_SHIFT)                      /*!< RTC_TIR: TMIE Mask                      */
#define RTC_TIR_TMIE_SHIFT                       5                                                   /*!< RTC_TIR: TMIE Position                  */
/* ------- WAR Bit Fields                           ------ */
#define RTC_WAR_TSRW_MASK                        (0x01UL << RTC_WAR_TSRW_SHIFT)                      /*!< RTC_WAR: TSRW Mask                      */
