podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define RTC_WAR_TSRW_SHIFT                       0                                                   /*!< RTC_WAR: TSRW Position                  */
#define RTC_WAR_TPRW_MASK                        (0x01UL << RTC_WAR_TPRW_SHIFT)                      /*!< RTC_WAR: TPRW Mask                      */
#define RTC_WAR_TPRW_SHIFT                       1                                                   /*!< RTC_WAR: TPRW Position                  */
#define RTC_WAR_TARW_MASK                        (0x01UL << RTC_WAR_TARW_SHIFT)                      /*!< RTC_WAR: TARW Mask                      */
#define RTC_WAR_TARW_SHIFT                       2                                                   /*!< RTC_WAR: TARW Position                  */
#define RTC_WAR_TCRW_MASK                        (0x01UL << RTC_WAR_TCRW_SHIFT)                      /*!< RTC_WAR: TCRW Mask                      */
#define RTC_WAR_TCRW_SHIFT                       3                                                   /*!< RTC_WAR: TCRW Position                  */
#define RTC_WAR_CRW_MASK                         (0x01UL << RTC_WAR_CRW_SHIFT)                       /*!< RTC_WAR: CRW Mask                       */
#define RTC_WAR_CRW_SHIFT                        4                                                   /*!< RTC_WAR: CRW Position                   */
#define RTC_WAR_SRW_MASK                         (0x01UL << RTC_WAR_SRW_SHIFT)                       /*!< RTC_WAR: SRW Mask                       */
#define RTC_WAR_SRW_SHIFT                        5                                                   /*!< RTC_WAR: SRW Position                   */
#define RTC_WAR_LRW_MASK                         (0x01UL << RTC_WAR_LRW_SHIFT)                       /*!< RTC_WAR: LRW Mask                       */
#define RTC_WAR_LRW_SHIFT                        6                                                   /*!< RTC_WAR: LRW Position                   */
#define RTC_WAR_IERW_MASK                        (0x01UL << RTC_WAR_IERW_SHIFT)                      /*!< RTC_WAR: IERW Mask                      */
#define RTC_WAR_IERW_SHIFT                       7                                                   /*!< RTC_WAR: IERW Position                  */
#define RTC_WAR_TTSW_MASK                        (0x01UL << RTC_WAR_TTSW_SHIFT)                      /*!< RTC_WAR: TTSW Mask                      */
#define RTC_WAR_TTSW_SHIFT                       8                                                   /*!< RTC_WAR: TTSW Position                  */
#define RTC_WAR_MERW_MASK                        (0x01UL << RTC_WAR_MERW_SHIFT)                      /*!< RTC_WAR: MERW Mask                      */
#define RTC_WAR_MERW_SHIFT                       9                                                   /*!< RTC_WAR: MERW Position                  */
#define RTC_WAR_MCLW_MASK                        (0x01UL << RTC_WAR_MCLW_SHIFT)                      /*!< RTC_WAR: MCLW Mask                      */
#define RTC_WAR_MCLW_SHIFT                       10                                                  /*!< RTC_WAR: MCLW Position                  */
#define RTC_WAR_MCHW_MASK                        (0x01UL << RTC_WAR_MCHW_SHIFT)                      /*!< RTC_WAR: MCHW Mask                      */
#define RTC_WAR_MCHW_SHIFT                       11                                                  /*!< RTC_WAR: MCHW Position                  */
#define RTC_WAR_TERW_MASK                        (0x01UL << RTC_WAR_TERW_SHIFT)                      /*!< RTC_WAR: TERW Mask                      */
#define RTC_WAR_TERW_SHIFT                       12                                                  /*!< RTC_WAR: TERW Position                  */
#define RTC_WAR_TDRW_MASK                        (0x01UL << RTC_WAR_TDRW_SHIFT)                      /*!< RTC_WAR: TDRW Mask                      */
#define RTC_WAR_TDRW_SHIFT                       13                                                  /*!< RTC_WAR: TDRW Position                  */
#define RTC_WAR_TTRW_MASK                        (0x01UL << RTC_WAR_TTRW_SHIFT)                      /*!< RTC_WAR: TTRW Mask                      */
#define RTC_WAR_TTRW_SHIFT                       14                                                  /*!< RTC_WAR: TTRW Position                  */
#define RTC_WAR_TIRW_MASK                        (0x01UL << RTC_WAR_TIRW_SHIFT)                      /*!< RTC_WAR: TIRW Mask                      */
#define RTC_WAR_TIRW_SHIFT                       15                                                  /*!< RTC_WAR: TIRW Position                  */
/* ------- RAR Bit Fields                           ------ */
#define RTC_RAR_TSRR_MASK                        (0x01UL << RTC_RAR_TSRR_SHIFT)                      /*!< RTC_RAR: TSRR Mask                      */
#define RTC_RAR_TSRR_SHIFT                       0                                                   /*!< RTC_RAR: TSRR Position                  */
#define RTC_RAR_TPRR_MASK                        (0x01UL << RTC_RAR_TPRR_SHIFT)                      /*!< RTC_RAR: TPRR Mask                      */
#define RTC_RAR_TPRR_SHIFT                       1                                                   /*!< RTC_RAR: TPRR Position                  */
#define RTC_RAR_TARR_MASK                        (0x01UL << RTC_RAR_TARR_SHIFT)                      /*!< RTC_RAR: TARR Mask                      */
#define RTC_RAR_TARR_SHIFT                       2                                                   /*!< RTC_RAR: TARR Position                  */
#define RTC_RAR_TCRR_MASK                        (0x01UL << RTC_RAR_TCRR_SHIFT)                      /*!< RTC_RAR: TCRR Mask                      */
#define RTC_RAR_TCRR_SHIFT                       3                                                   /*!< RTC_RAR: TCRR Position                  */
#define RTC_RAR_CRR_MASK                         (0x01UL << RTC_RAR_CRR_SHIFT)                       /*!< RTC_RAR: CRR Mask                       */
#define RTC_RAR_CRR_SHIFT                        4                                                   /*!< RTC_RAR: CRR Position                   */
#define RTC_RAR_SRR_MASK                         (0x01UL << RTC_RAR_SRR_SHIFT)                       /*!< RTC_RAR: SRR Mask                       */
#define RTC_RAR_SRR_SHIFT                        5                                                   /*!< RTC_RAR: SRR Position                   */
#define RTC_RAR_LRR_MASK                         (0x01UL << RTC_RAR_LRR_SHIFT)                       /*!< RTC_RAR: LRR Mask                       */
#define RTC_RAR_LRR_SHIFT                        6                                                   /*!< RTC_RAR: LRR Position                   */
#define RTC_RAR_IERR_MASK                        (0x01UL << RTC_RAR_IERR_SHIFT)                      /*!< RTC_RAR: IERR Mask                      */
#define RTC_RAR_IERR_SHIFT                       7                                                   /*!< RTC_RAR: IERR Position                  */
#define RTC_RAR_TTSR_MASK                        (0x01UL << RTC_RAR_TTSR_SHIFT)                      /*!< RTC_RAR: TTSR Mask                      */
#define RTC_RAR_TTSR_SHIFT                       8                                                   /*!< RTC_RAR: TTSR Position                  */
#define RTC_RAR_MERR_MASK                        (0x01UL << RTC_RAR_MERR_SHIFT)                      /*!< RTC_RAR: MERR Mask                      */
#define RTC_RAR_MERR_SHIFT                       9                                                   /*!< RTC_RAR: MERR Position                  */
#define RTC_RAR_MCLR_MASK                        (0x01UL << RTC_RAR_MCLR_SHIFT)                      /*!< RTC_RAR: MCLR Mask                      */
#define RTC_RAR_MCLR_SHIFT                       10                                                  /*!< RTC_RAR: MCLR Position                  */
#define RTC_RAR_MCHR_MASK                        (0x01UL << RTC_RAR_MCHR_SHIFT)                      /*!< RTC_RAR: MCHR Mask                      */
#define RTC_RAR_MCHR_SHIFT                       11                                                  /*!< RTC_RAR: MCHR Position                  */
#define RTC_RAR_TERR_MASK                        (0x01UL << RTC_RAR_TERR_SHIFT)                      /*!< RTC_RAR: TERR Mask                      */
#define RTC_RAR_TERR_SHIFT                       12                                                  /*!< RTC_RAR: TERR Position                  */
#define RTC_RAR_TDRR_MASK                        (0x01UL << RTC_RAR_TDRR_SHIFT)                      /*!< RTC_RAR: TDRR Mask                      */
#define RTC_RAR_TDRR_SHIFT                       13                                                  /*!< RTC_RAR: TDRR Position                  */
#define RTC_RAR_TTRR_MASK                        (0x01UL << RTC_RAR_TTRR_SHIFT)                      /*!< RTC_RAR: TTRR Mask                      */
#define RTC_RAR_TTRR_SHIFT                       14                                                  /*!< RTC_RAR: TTRR Position                  */
#define RTC_RAR_TIRR_MASK                        (0x01UL << RTC_RAR_TIRR_SHIFT)                      /*!< RTC_RAR: TIRR Mask                      */
#define RTC_RAR_TIRR_SHIFT                       15                                                  /*!< RTC_RAR: TIRR Position                  */
/**
 * @} */ /* End group RTC_Register_Masks_GROUP 
 */

/* RTC - Peripheral instance base addresses */
#define RTC_BasePtr                    0x4003D000UL //!< Peripheral base address
#define RTC                            ((RTC_Type *) RTC_BasePtr) //!< Freescale base pointer
#define RTC_BASE_PTR                   (RTC) //!< Freescale style base pointer
/**
 * @} */ /* End group RTC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SDHC_Peripheral_access_layer_GROUP SDHC Peripheral Access Layer
* @brief C Struct for SDHC
* @{
*/

/* ================================================================================ */
/* ================           SDHC (file:SDHC_MK10DZ10)            ================ */
/* ================================================================================ */

/**
 * @brief Secured Digital Host Controller
 */
/**
* @addtogroup SDHC_structs_GROUP SDHC struct
* @brief Struct for SDHC
* @{
*/
typedef struct {                                /*       SDHC Structure                                               */
   __IO uint32_t  DSADDR;                       /**< 0000: DMA System Address Register                                  */
   __IO uint32_t  BLKATTR;                      /**< 0004: Block Attributes Register                                    */
   __IO uint32_t  CMDARG;                       /**< 0008: Command Argument Register                                    */
   __IO uint32_t  XFERTYP;                      /**< 000C: Transfer Type Register                                       */
   __I  uint32_t  CMDRSP[4];                    /**< 0010: Command Response                                             */
   __IO uint32_t  DATPORT;                      /**< 0020: Buffer Data Port Register                                    */
   __I  uint32_t  PRSSTAT;                      /**< 0024: Present State Register                                       */
   __IO uint32_t  PROCTL;                       /**< 0028: Protocol Control Register                                    */
   __IO uint32_t  SYSCTL;                       /**< 002C: System Control Register                                      */
   __IO uint32_t  IRQSTAT;                      /**< 0030: Interrupt Status Register                                    */
   __IO uint32_t  IRQSTATEN;                    /**< 0034: Interrupt Status Enable Register                             */
   __IO uint32_t  IRQSIGEN;                     /**< 0038: Interrupt Signal Enable Register                             */
   __I  uint32_t  AC12ERR;                      /**< 003C: Auto CMD12 Error Status Register                             */
   __I  uint32_t  HTCAPBLT;                     /**< 0040: Host Controller Capabilities                                 */
   __IO uint32_t  WML;                          /**< 0044: Watermark Level Register                                     */
   __I  uint32_t  RESERVED0[2];                
   __O  uint32_t  FEVT;                         /**< 0050: Force Event Register                                         */
   __I  uint32_t  ADMAES;                       /**< 0054: ADMA Error Status Register                                   */
   __IO uint32_t  ADSADDR;                      /**< 0058: ADMA System Address Register                                 */
   __I  uint32_t  RESERVED1[25];               
   __IO uint32_t  VENDOR;                       /**< 00C0: Vendor Specific Register                                     */
   __IO uint32_t  MMCBOOT;                      /**< 00C4: MMC Boot Register                                            */
   __I  uint32_t  RESERVED2[13];               
   __I  uint32_t  HOSTVER;                      /**< 00FC: Host Controller Version                                      */
} SDHC_Type;

/**
 * @} */ /* End group SDHC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SDHC' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

