podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup SDHC_Register_Masks_GROUP SDHC Register Masks
* @brief Register Masks for SDHC
* @{
*/
/* ------- DSADDR Bit Fields                        ------ */
#define SDHC_DSADDR_DSADDR_MASK                  (0x3FFFFFFFUL << SDHC_DSADDR_DSADDR_SHIFT)          /*!< SDHC_DSADDR: DSADDR Mask                */
#define SDHC_DSADDR_DSADDR_SHIFT                 2                                                   /*!< SDHC_DSADDR: DSADDR Position            */
#define SDHC_DSADDR_DSADDR(x)                    (((uint32_t)(((uint32_t)(x))<<SDHC_DSADDR_DSADDR_SHIFT))&SDHC_DSADDR_DSADDR_MASK) /*!< SDHC_DSADDR                             */
/* ------- BLKATTR Bit Fields                       ------ */
#define SDHC_BLKATTR_BLKSIZE_MASK                (0x1FFFUL << SDHC_BLKATTR_BLKSIZE_SHIFT)            /*!< SDHC_BLKATTR: BLKSIZE Mask              */
#define SDHC_BLKATTR_BLKSIZE_SHIFT               0                                                   /*!< SDHC_BLKATTR: BLKSIZE Position          */
#define SDHC_BLKATTR_BLKSIZE(x)                  (((uint32_t)(((uint32_t)(x))<<SDHC_BLKATTR_BLKSIZE_SHIFT))&SDHC_BLKATTR_BLKSIZE_MASK) /*!< SDHC_BLKATTR                            */
#define SDHC_BLKATTR_BLKCNT_MASK                 (0xFFFFUL << SDHC_BLKATTR_BLKCNT_SHIFT)             /*!< SDHC_BLKATTR: BLKCNT Mask               */
#define SDHC_BLKATTR_BLKCNT_SHIFT                16                                                  /*!< SDHC_BLKATTR: BLKCNT Position           */
#define SDHC_BLKATTR_BLKCNT(x)                   (((uint32_t)(((uint32_t)(x))<<SDHC_BLKATTR_BLKCNT_SHIFT))&SDHC_BLKATTR_BLKCNT_MASK) /*!< SDHC_BLKATTR                            */
/* ------- CMDARG Bit Fields                        ------ */
#define SDHC_CMDARG_CMDARG_MASK                  (0xFFFFFFFFUL << SDHC_CMDARG_CMDARG_SHIFT)          /*!< SDHC_CMDARG: CMDARG Mask                */
#define SDHC_CMDARG_CMDARG_SHIFT                 0                                                   /*!< SDHC_CMDARG: CMDARG Position            */
#define SDHC_CMDARG_CMDARG(x)                    (((uint32_t)(((uint32_t)(x))<<SDHC_CMDARG_CMDARG_SHIFT))&SDHC_CMDARG_CMDARG_MASK) /*!< SDHC_CMDARG                             */
/* ------- XFERTYP Bit Fields                       ------ */
#define SDHC_XFERTYP_DMAEN_MASK                  (0x01UL << SDHC_XFERTYP_DMAEN_SHIFT)                /*!< SDHC_XFERTYP: DMAEN Mask                */
#define SDHC_XFERTYP_DMAEN_SHIFT                 0                                                   /*!< SDHC_XFERTYP: DMAEN Position            */
#define SDHC_XFERTYP_BCEN_MASK                   (0x01UL << SDHC_XFERTYP_BCEN_SHIFT)                 /*!< SDHC_XFERTYP: BCEN Mask                 */
#define SDHC_XFERTYP_BCEN_SHIFT                  1                                                   /*!< SDHC_XFERTYP: BCEN Position             */
#define SDHC_XFERTYP_AC12EN_MASK                 (0x01UL << SDHC_XFERTYP_AC12EN_SHIFT)               /*!< SDHC_XFERTYP: AC12EN Mask               */
#define SDHC_XFERTYP_AC12EN_SHIFT                2                                                   /*!< SDHC_XFERTYP: AC12EN Position           */
#define SDHC_XFERTYP_DTDSEL_MASK                 (0x01UL << SDHC_XFERTYP_DTDSEL_SHIFT)               /*!< SDHC_XFERTYP: DTDSEL Mask               */
#define SDHC_XFERTYP_DTDSEL_SHIFT                4                                                   /*!< SDHC_XFERTYP: DTDSEL Position           */
#define SDHC_XFERTYP_MSBSEL_MASK                 (0x01UL << SDHC_XFERTYP_MSBSEL_SHIFT)               /*!< SDHC_XFERTYP: MSBSEL Mask               */
#define SDHC_XFERTYP_MSBSEL_SHIFT                5                                                   /*!< SDHC_XFERTYP: MSBSEL Position           */
#define SDHC_XFERTYP_RSPTYP_MASK                 (0x03UL << SDHC_XFERTYP_RSPTYP_SHIFT)               /*!< SDHC_XFERTYP: RSPTYP Mask               */
#define SDHC_XFERTYP_RSPTYP_SHIFT                16                                                  /*!< SDHC_XFERTYP: RSPTYP Position           */
#define SDHC_XFERTYP_RSPTYP(x)                   (((uint32_t)(((uint32_t)(x))<<SDHC_XFERTYP_RSPTYP_SHIFT))&SDHC_XFERTYP_RSPTYP_MASK) /*!< SDHC_XFERTYP                            */
#define SDHC_XFERTYP_CCCEN_MASK                  (0x01UL << SDHC_XFERTYP_CCCEN_SHIFT)                /*!< SDHC_XFERTYP: CCCEN Mask                */
#define SDHC_XFERTYP_CCCEN_SHIFT                 19                                                  /*!< SDHC_XFERTYP: CCCEN Position            */
#define SDHC_XFERTYP_CICEN_MASK                  (0x01UL << SDHC_XFERTYP_CICEN_SHIFT)                /*!< SDHC_XFERTYP: CICEN Mask                */
#define SDHC_XFERTYP_CICEN_SHIFT                 20                                                  /*!< SDHC_XFERTYP: CICEN Position            */
#define SDHC_XFERTYP_DPSEL_MASK                  (0x01UL << SDHC_XFERTYP_DPSEL_SHIFT)                /*!< SDHC_XFERTYP: DPSEL Mask                */
#define SDHC_XFERTYP_DPSEL_SHIFT                 21                                                  /*!< SDHC_XFERTYP: DPSEL Position            */
#define SDHC_XFERTYP_CMDTYP_MASK                 (0x03UL << SDHC_XFERTYP_CMDTYP_SHIFT)               /*!< SDHC_XFERTYP: CMDTYP Mask               */
#define SDHC_XFERTYP_CMDTYP_SHIFT                22                                                  /*!< SDHC_XFERTYP: CMDTYP Position           */
#define SDHC_XFERTYP_CMDTYP(x)                   (((uint32_t)(((uint32_t)(x))<<SDHC_XFERTYP_CMDTYP_SHIFT))&SDHC_XFERTYP_CMDTYP_MASK) /*!< SDHC_XFERTYP                            */
#define SDHC_XFERTYP_CMDINX_MASK                 (0x3FUL << SDHC_XFERTYP_CMDINX_SHIFT)               /*!< SDHC_XFERTYP: CMDINX Mask               */
#define SDHC_XFERTYP_CMDINX_SHIFT                24                                                  /*!< SDHC_XFERTYP: CMDINX Position           */
#define SDHC_XFERTYP_CMDINX(x)                   (((uint32_t)(((uint32_t)(x))<<SDHC_XFERTYP_CMDINX_SHIFT))&SDHC_XFERTYP_CMDINX_MASK) /*!< SDHC_XFERTYP                            */
/* ------- CMDRSP Bit Fields                        ------ */
#define SDHC_CMDRSP_CMDRSP0_MASK                 (0xFFFFFFFFUL << SDHC_CMDRSP_CMDRSP0_SHIFT)         /*!< SDHC_CMDRSP: CMDRSP0 Mask               */
#define SDHC_CMDRSP_CMDRSP0_SHIFT                0                                                   /*!< SDHC_CMDRSP: CMDRSP0 Position           */
#define SDHC_CMDRSP_CMDRSP0(x)                   (((uint32_t)(((uint32_t)(x))<<SDHC_CMDRSP_CMDRSP0_SHIFT))&SDHC_CMDRSP_CMDRSP0_MASK) /*!< SDHC_CMDRSP                             */
/* ------- DATPORT Bit Fields                       ------ */
#define SDHC_DATPORT_DATCONT_MASK                (0xFFFFFFFFUL << SDHC_DATPORT_DATCONT_SHIFT)        /*!< SDHC_DATPORT: DATCONT Mask              */
#define SDHC_DATPORT_DATCONT_SHIFT               0                                                   /*!< SDHC_DATPORT: DATCONT Position          */
#define SDHC_DATPORT_DATCONT(x)                  (((uint32_t)(((uint32_t)(x))<<SDHC_DATPORT_DATCONT_SHIFT))&SDHC_DATPORT_DATCONT_MASK) /*!< SDHC_DATPORT                            */
/* ------- PRSSTAT Bit Fields                       ------ */
#define SDHC_PRSSTAT_CIHB_MASK                   (0x01UL << SDHC_PRSSTAT_CIHB_SHIFT)                 /*!< SDHC_PRSSTAT: CIHB Mask                 */
#define SDHC_PRSSTAT_CIHB_SHIFT                  0                                                   /*!< SDHC_PRSSTAT: CIHB Position             */
#define SDHC_PRSSTAT_CDIHB_MASK                  (0x01UL << SDHC_PRSSTAT_CDIHB_SHIFT)                /*!< SDHC_PRSSTAT: CDIHB Mask                */
#define SDHC_PRSSTAT_CDIHB_SHIFT                 1                                                   /*!< SDHC_PRSSTAT: CDIHB Position            */
#define SDHC_PRSSTAT_DLA_MASK                    (0x01UL << SDHC_PRSSTAT_DLA_SHIFT)                  /*!< SDHC_PRSSTAT: DLA Mask                  */
#define SDHC_PRSSTAT_DLA_SHIFT                   2                                                   /*!< SDHC_PRSSTAT: DLA Position              */
#define SDHC_PRSSTAT_SDSTB_MASK                  (0x01UL << SDHC_PRSSTAT_SDSTB_SHIFT)                /*!< SDHC_PRSSTAT: SDSTB Mask                */
#define SDHC_PRSSTAT_SDSTB_SHIFT                 3                                                   /*!< SDHC_PRSSTAT: SDSTB Position            */
#define SDHC_PRSSTAT_IPGOFF_MASK                 (0x01UL << SDHC_PRSSTAT_IPGOFF_SHIFT)               /*!< SDHC_PRSSTAT: IPGOFF Mask               */
#define SDHC_PRSSTAT_IPGOFF_SHIFT                4                                                   /*!< SDHC_PRSSTAT: IPGOFF Position           */
#define SDHC_PRSSTAT_HCKOFF_MASK                 (0x01UL << SDHC_PRSSTAT_HCKOFF_SHIFT)               /*!< SDHC_PRSSTAT: HCKOFF Mask               */
#define SDHC_PRSSTAT_HCKOFF_SHIFT                5                                                   /*!< SDHC_PRSSTAT: HCKOFF Position           */
#define SDHC_PRSSTAT_PEROFF_MASK                 (0x01UL << SDHC_PRSSTAT_PEROFF_SHIFT)               /*!< SDHC_PRSSTAT: PEROFF Mask               */
#define SDHC_PRSSTAT_PEROFF_SHIFT                6                                                   /*!< SDHC_PRSSTAT: PEROFF Position           */
#define SDHC_PRSSTAT_SDOFF_MASK                  (0x01UL << SDHC_PRSSTAT_SDOFF_SHIFT)                /*!< SDHC_PRSSTAT: SDOFF Mask                */
#define SDHC_PRSSTAT_SDOFF_SHIFT                 7                                                   /*!< SDHC_PRSSTAT: SDOFF Position            */
#define SDHC_PRSSTAT_WTA_MASK                    (0x01UL << SDHC_PRSSTAT_WTA_SHIFT)                  /*!< SDHC_PRSSTAT: WTA Mask                  */
#define SDHC_PRSSTAT_WTA_SHIFT                   8                                                   /*!< SDHC_PRSSTAT: WTA Position              */
#define SDHC_PRSSTAT_RTA_MASK                    (0x01UL << SDHC_PRSSTAT_RTA_SHIFT)                  /*!< SDHC_PRSSTAT: RTA Mask                  */
#define SDHC_PRSSTAT_RTA_SHIFT                   9                                                   /*!< SDHC_PRSSTAT: RTA Position              */
#define SDHC_PRSSTAT_BWEN_MASK                   (0x01UL << SDHC_PRSSTAT_BWEN_SHIFT)                 /*!< SDHC_PRSSTAT: BWEN Mask                 */
#define SDHC_PRSSTAT_BWEN_SHIFT                  10                                                  /*!< SDHC_PRSSTAT: BWEN Position             */
#define SDHC_PRSSTAT_BREN_MASK                   (0x01UL << SDHC_PRSSTAT_BREN_SHIFT)                 /*!< SDHC_PRSSTAT: BREN Mask                 */
#define SDHC_PRSSTAT_BREN_SHIFT                  11                                                  /*!< SDHC_PRSSTAT: BREN Position             */
#define SDHC_PRSSTAT_CINS_MASK                   (0x01UL << SDHC_PRSSTAT_CINS_SHIFT)                 /*!< SDHC_PRSSTAT: CINS Mask                 */
#define SDHC_PRSSTAT_CINS_SHIFT                  16                                                  /*!< SDHC_PRSSTAT: CINS Position             */
#define SDHC_PRSSTAT_CLSL_MASK                   (0x01UL << SDHC_PRSSTAT_CLSL_SHIFT)                 /*!< SDHC_PRSSTAT: CLSL Mask                 */
#define SDHC_PRSSTAT_CLSL_SHIFT                  23                                                  /*!< SDHC_PRSSTAT: CLSL Position             */
#define SDHC_PRSSTAT_DLSL_MASK                   (0xFFUL << SDHC_PRSSTAT_DLSL_SHIFT)                 /*!< SDHC_PRSSTAT: DLSL Mask                 */
#define SDHC_PRSSTAT_DLSL_SHIFT                  24                                                  /*!< SDHC_PRSSTAT: DLSL Position             */
#define SDHC_PRSSTAT_DLSL(x)                     (((uint32_t)(((uint32_t)(x))<<SDHC_PRSSTAT_DLSL_SHIFT))&SDHC_PRSSTAT_DLSL_MASK) /*!< SDHC_PRSSTAT                            */
/* ------- PROCTL Bit Fields                        ------ */
#define SDHC_PROCTL_LCTL_MASK                    (0x01UL << SDHC_PROCTL_LCTL_SHIFT)                  /*!< SDHC_PROCTL: LCTL Mask                  */
#define SDHC_PROCTL_LCTL_SHIFT                   0                                                   /*!< SDHC_PROCTL: LCTL Position              */
#define SDHC_PROCTL_DTW_MASK                     (0x03UL << SDHC_PROCTL_DTW_SHIFT)                   /*!< SDHC_PROCTL: DTW Mask                   */
#define SDHC_PROCTL_DTW_SHIFT                    1                                                   /*!< SDHC_PROCTL: DTW Position               */
#define SDHC_PROCTL_DTW(x)                       (((uint32_t)(((uint32_t)(x))<<SDHC_PROCTL_DTW_SHIFT))&SDHC_PROCTL_DTW_MASK) /*!< SDHC_PROCTL                             */
#define SDHC_PROCTL_D3CD_MASK                    (0x01UL << SDHC_PROCTL_D3CD_SHIFT)                  /*!< SDHC_PROCTL: D3CD Mask                  */
#define SDHC_PROCTL_D3CD_SHIFT                   3                                                   /*!< SDHC_PROCTL: D3CD Position              */
#define SDHC_PROCTL_EMODE_MASK                   (0x03UL << SDHC_PROCTL_EMODE_SHIFT)                 /*!< SDHC_PROCTL: EMODE Mask                 */
#define SDHC_PROCTL_EMODE_SHIFT                  4                                                   /*!< SDHC_PROCTL: EMODE Position             */
#define SDHC_PROCTL_EMODE(x)                     (((uint32_t)(((uint32_t)(x))<<SDHC_PROCTL_EMODE_SHIFT))&SDHC_PROCTL_EMODE_MASK) /*!< SDHC_PROCTL                             */
#define SDHC_PROCTL_CDTL_MASK                    (0x01UL << SDHC_PROCTL_CDTL_SHIFT)                  /*!< SDHC_PROCTL: CDTL Mask                  */
#define SDHC_PROCTL_CDTL_SHIFT                   6                                                   /*!< SDHC_PROCTL: CDTL Position              */
#define SDHC_PROCTL_CDSS_MASK                    (0x01UL << SDHC_PROCTL_CDSS_SHIFT)                  /*!< SDHC_PROCTL: CDSS Mask                  */
#define SDHC_PROCTL_CDSS_SHIFT                   7                                                   /*!< SDHC_PROCTL: CDSS Position              */
#define SDHC_PROCTL_DMAS_MASK                    (0x03UL << SDHC_PROCTL_DMAS_SHIFT)                  /*!< SDHC_PROCTL: DMAS Mask                  */
#define SDHC_PROCTL_DMAS_SHIFT                   8                                                   /*!< SDHC_PROCTL: DMAS Position              */
#define SDHC_PROCTL_DMAS(x)                      (((uint32_t)(((uint32_t)(x))<<SDHC_PROCTL_DMAS_SHIFT))&SDHC_PROCTL_DMAS_MASK) /*!< SDHC_PROCTL                             */
#define SDHC_PROCTL_SABGREQ_MASK                 (0x01UL << SDHC_PROCTL_SABGREQ_SHIFT)               /*!< SDHC_PROCTL: SABGREQ Mask               */
#define SDHC_PROCTL_SABGREQ_SHIFT                16                                                  /*!< SDHC_PROCTL: SABGREQ Position           */
#define SDHC_PROCTL_CREQ_MASK                    (0x01UL << SDHC_PROCTL_CREQ_SHIFT)                  /*!< SDHC_PROCTL: CREQ Mask                  */
#define SDHC_PROCTL_CREQ_SHIFT                   17                                                  /*!< SDHC_PROCTL: CREQ Position              */
#define SDHC_PROCTL_RWCTL_MASK                   (0x01UL << SDHC_PROCTL_RWCTL_SHIFT)                 /*!< SDHC_PROCTL: RWCTL Mask                 */
#define SDHC_PROCTL_RWCTL_SHIFT                  18                                                  /*!< SDHC_PROCTL: RWCTL Position             */
#define SDHC_PROCTL_IABG_MASK                    (0x01UL << SDHC_PROCTL_IABG_SHIFT)                  /*!< SDHC_PROCTL: IABG Mask                  */
#define SDHC_PROCTL_IABG_SHIFT                   19                                                  /*!< SDHC_PROCTL: IABG Position              */
#define SDHC_PROCTL_WECINT_MASK                  (0x01UL << SDHC_PROCTL_WECINT_SHIFT)                /*!< SDHC_PROCTL: WECINT Mask                */
#define SDHC_PROCTL_WECINT_SHIFT                 24                                                  /*!< SDHC_PROCTL: WECINT Position            */
#define SDHC_PROCTL_WECINS_MASK                  (0x01UL << SDHC_PROCTL_WECINS_SHIFT)                /*!< SDHC_PROCTL: WECINS Mask                */
#define SDHC_PROCTL_WECINS_SHIFT                 25                                                  /*!< SDHC_PROCTL: WECINS Position            */
#define SDHC_PROCTL_WECRM_MASK                   (0x01UL << SDHC_PROCTL_WECRM_SHIFT)                 /*!< SDHC_PROCTL: WECRM Mask                 */
#define SDHC_PROCTL_WECRM_SHIFT                  26                                                  /*!< SDHC_PROCTL: WECRM Position             */
/* ------- SYSCTL Bit Fields                        ------ */
#define SDHC_SYSCTL_IPGEN_MASK                   (0x01UL << SDHC_SYSCTL_IPGEN_SHIFT)                 /*!< SDHC_SYSCTL: IPGEN Mask                 */
#define SDHC_SYSCTL_IPGEN_SHIFT                  0                                                   /*!< SDHC_SYSCTL: IPGEN Position             */
#define SDHC_SYSCTL_HCKEN_MASK                   (0x01UL << SDHC_SYSCTL_HCKEN_SHIFT)                 /*!< SDHC_SYSCTL: HCKEN Mask                 */
#define SDHC_SYSCTL_HCKEN_SHIFT                  1                                                   /*!< SDHC_SYSCTL: HCKEN Position             */
#define SDHC_SYSCTL_PEREN_MASK                   (0x01UL << SDHC_SYSCTL_PEREN_SHIFT)                 /*!< SDHC_SYSCTL: PEREN Mask                 */
#define SDHC_SYSCTL_PEREN_SHIFT                  2                                                   /*!< SDHC_SYSCTL: PEREN Position             */
#define SDHC_SYSCTL_SDCLKEN_MASK                 (0x01UL << SDHC_SYSCTL_SDCLKEN_SHIFT)               /*!< SDHC_SYSCTL: SDCLKEN Mask               */
#define SDHC_SYSCTL_SDCLKEN_SHIFT                3                                                   /*!< SDHC_SYSCTL: SDCLKEN Position           */
#define SDHC_SYSCTL_DVS_MASK                     (0x0FUL << SDHC_SYSCTL_DVS_SHIFT)                   /*!< SDHC_SYSCTL: DVS Mask                   */
#define SDHC_SYSCTL_DVS_SHIFT                    4                                                   /*!< SDHC_SYSCTL: DVS Position               */
#define SDHC_SYSCTL_DVS(x)                       (((uint32_t)(((uint32_t)(x))<<SDHC_SYSCTL_DVS_SHIFT))&SDHC_SYSCTL_DVS_MASK) /*!< SDHC_SYSCTL                             */
#define SDHC_SYSCTL_SDCLKFS_MASK                 (0xFFUL << SDHC_SYSCTL_SDCLKFS_SHIFT)               /*!< SDHC_SYSCTL: SDCLKFS Mask               */
#define SDHC_SYSCTL_SDCLKFS_SHIFT                8                                                   /*!< SDHC_SYSCTL: SDCLKFS Position           */
#define SDHC_SYSCTL_SDCLKFS(x)                   (((uint32_t)(((uint32_t)(x))<<SDHC_SYSCTL_SDCLKFS_SHIFT))&SDHC_SYSCTL_SDCLKFS_MASK) /*!< SDHC_SYSCTL                             */
#define SDHC_SYSCTL_DTOCV_MASK                   (0x0FUL << SDHC_SYSCTL_DTOCV_SHIFT)                 /*!< SDHC_SYSCTL: DTOCV Mask                 */
#define SDHC_SYSCTL_DTOCV_SHIFT                  16                                                  /*!< SDHC_SYSCTL: DTOCV Position             */
#define SDHC_SYSCTL_DTOCV(x)                     (((uint32_t)(((uint32_t)(x))<<SDHC_SYSCTL_DTOCV_SHIFT))&SDHC_SYSCTL_DTOCV_MASK) /*!< SDHC_SYSCTL                             */
#define SDHC_SYSCTL_RSTA_MASK                    (0x01UL << SDHC_SYSCTL_RSTA_SHIFT)                  /*!< SDHC_SYSCTL: RSTA Mask                  */
#define SDHC_SYSCTL_RSTA_SHIFT                   24                                                  /*!< SDHC_SYSCTL: RSTA Position              */
#define SDHC_SYSCTL_RSTC_MASK                    (0x01UL << SDHC_SYSCTL_RSTC_SHIFT)                  /*!< SDHC_SYSCTL: RSTC Mask                  */
#define SDHC_SYSCTL_RSTC_SHIFT                   25                                                  /*!< SDHC_SYSCTL: RSTC Position              */
#define SDHC_SYSCTL_RSTD_MASK                    (0x01UL << SDHC_SYSCTL_RSTD_SHIFT)                  /*!< SDHC_SYSCTL: RSTD Mask                  */
#define SDHC_SYSCTL_RSTD_SHIFT                   26                                                  /*!< SDHC_SYSCTL: RSTD Position              */
#define SDHC_SYSCTL_INITA_MASK                   (0x01UL << SDHC_SYSCTL_INITA_SHIFT)                 /*!< SDHC_SYSCTL: INITA Mask                 */
#define SDHC_SYSCTL_INITA_SHIFT                  27                                                  /*!< SDHC_SYSCTL: INITA Position             */
/* ------- IRQSTAT Bit Fields                       ------ */
#define SDHC_IRQSTAT_CC_MASK                     (0x01UL << SDHC_IRQSTAT_CC_SHIFT)                   /*!< SDHC_IRQSTAT: CC Mask                   */
#define SDHC_IRQSTAT_CC_SHIFT                    0                                                   /*!< SDHC_IRQSTAT: CC Position               */
#define SDHC_IRQSTAT_TC_MASK                     (0x01UL << SDHC_IRQSTAT_TC_SHIFT)                   /*!< SDHC_IRQSTAT: TC Mask                   */
#define SDHC_IRQSTAT_TC_SHIFT                    1                                                   /*!< SDHC_IRQSTAT: TC Position               */
#define SDHC_IRQSTAT_BGE_MASK                    (0x01UL << SDHC_IRQSTAT_BGE_SHIFT)                  /*!< SDHC_IRQSTAT: BGE Mask                  */
#define SDHC_IRQSTAT_BGE_SHIFT                   2                                                   /*!< SDHC_IRQSTAT: BGE Position              */
#define SDHC_IRQSTAT_DINT_MASK                   (0x01UL << SDHC_IRQSTAT_DINT_SHIFT)                 /*!< SDHC_IRQSTAT: DINT Mask                 */
#define SDHC_IRQSTAT_DINT_SHIFT                  3                                                   /*!< SDHC_IRQSTAT: DINT Position             */
#define SDHC_IRQSTAT_BWR_MASK                    (0x01UL << SDHC_IRQSTAT_BWR_SHIFT)                  /*!< SDHC_IRQSTAT: BWR Mask                  */
#define SDHC_IRQSTAT_BWR_SHIFT                   4                                                   /*!< SDHC_IRQSTAT: BWR Position              */
#define SDHC_IRQSTAT_BRR_MASK                    (0x01UL << SDHC_IRQSTAT_BRR_SHIFT)                  /*!< SDHC_IRQSTAT: BRR Mask                  */
#define SDHC_IRQSTAT_BRR_SHIFT                   5                                                   /*!< SDHC_IRQSTAT: BRR Position              */
#define SDHC_IRQSTAT_CINS_MASK                   (0x01UL << SDHC_IRQSTAT_CINS_SHIFT)                 /*!< SDHC_IRQSTAT: CINS Mask                 */
#define SDHC_IRQSTAT_CINS_SHIFT                  6                                                   /*!< SDHC_IRQSTAT: CINS Position             */
#define SDHC_IRQSTAT_CRM_MASK                    (0x01UL << SDHC_IRQSTAT_CRM_SHIFT)                  /*!< SDHC_IRQSTAT: CRM Mask                  */
#define SDHC_IRQSTAT_CRM_SHIFT                   7                                                   /*!< SDHC_IRQSTAT: CRM Position              */
#define SDHC_IRQSTAT_CINT_MASK                   (0x01UL << SDHC_IRQSTAT_CINT_SHIFT)                 /*!< SDHC_IRQSTAT: CINT Mask                 */
#define SDHC_IRQSTAT_CINT_SHIFT                  8                                                   /*!< SDHC_IRQSTAT: CINT Position             */
#define SDHC_IRQSTAT_CTOE_MASK                   (0x01UL << SDHC_IRQSTAT_CTOE_SHIFT)                 /*!< SDHC_IRQSTAT: CTOE Mask                 */
#define SDHC_IRQSTAT_CTOE_SHIFT                  16                                                  /*!< SDHC_IRQSTAT: CTOE Position             */
#define SDHC_IRQSTAT_CCE_MASK                    (0x01UL << SDHC_IRQSTAT_CCE_SHIFT)                  /*!< SDHC_IRQSTAT: CCE Mask                  */
#define SDHC_IRQSTAT_CCE_SHIFT                   17                                                  /*!< SDHC_IRQSTAT: CCE Position              */
#define SDHC_IRQSTAT_CEBE_MASK                   (0x01UL << SDHC_IRQSTAT_CEBE_SHIFT)                 /*!< SDHC_IRQSTAT: CEBE Mask                 */
