podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define SDHC_IRQSTAT_CEBE_SHIFT                  18                                                  /*!< SDHC_IRQSTAT: CEBE Position             */
#define SDHC_IRQSTAT_CIE_MASK                    (0x01UL << SDHC_IRQSTAT_CIE_SHIFT)                  /*!< SDHC_IRQSTAT: CIE Mask                  */
#define SDHC_IRQSTAT_CIE_SHIFT                   19                                                  /*!< SDHC_IRQSTAT: CIE Position              */
#define SDHC_IRQSTAT_DTOE_MASK                   (0x01UL << SDHC_IRQSTAT_DTOE_SHIFT)                 /*!< SDHC_IRQSTAT: DTOE Mask                 */
#define SDHC_IRQSTAT_DTOE_SHIFT                  20                                                  /*!< SDHC_IRQSTAT: DTOE Position             */
#define SDHC_IRQSTAT_DCE_MASK                    (0x01UL << SDHC_IRQSTAT_DCE_SHIFT)                  /*!< SDHC_IRQSTAT: DCE Mask                  */
#define SDHC_IRQSTAT_DCE_SHIFT                   21                                                  /*!< SDHC_IRQSTAT: DCE Position              */
#define SDHC_IRQSTAT_DEBE_MASK                   (0x01UL << SDHC_IRQSTAT_DEBE_SHIFT)                 /*!< SDHC_IRQSTAT: DEBE Mask                 */
#define SDHC_IRQSTAT_DEBE_SHIFT                  22                                                  /*!< SDHC_IRQSTAT: DEBE Position             */
#define SDHC_IRQSTAT_AC12E_MASK                  (0x01UL << SDHC_IRQSTAT_AC12E_SHIFT)                /*!< SDHC_IRQSTAT: AC12E Mask                */
#define SDHC_IRQSTAT_AC12E_SHIFT                 24                                                  /*!< SDHC_IRQSTAT: AC12E Position            */
#define SDHC_IRQSTAT_DMAE_MASK                   (0x01UL << SDHC_IRQSTAT_DMAE_SHIFT)                 /*!< SDHC_IRQSTAT: DMAE Mask                 */
#define SDHC_IRQSTAT_DMAE_SHIFT                  28                                                  /*!< SDHC_IRQSTAT: DMAE Position             */
/* ------- IRQSTATEN Bit Fields                     ------ */
#define SDHC_IRQSTATEN_CCSEN_MASK                (0x01UL << SDHC_IRQSTATEN_CCSEN_SHIFT)              /*!< SDHC_IRQSTATEN: CCSEN Mask              */
#define SDHC_IRQSTATEN_CCSEN_SHIFT               0                                                   /*!< SDHC_IRQSTATEN: CCSEN Position          */
#define SDHC_IRQSTATEN_TCSEN_MASK                (0x01UL << SDHC_IRQSTATEN_TCSEN_SHIFT)              /*!< SDHC_IRQSTATEN: TCSEN Mask              */
#define SDHC_IRQSTATEN_TCSEN_SHIFT               1                                                   /*!< SDHC_IRQSTATEN: TCSEN Position          */
#define SDHC_IRQSTATEN_BGESEN_MASK               (0x01UL << SDHC_IRQSTATEN_BGESEN_SHIFT)             /*!< SDHC_IRQSTATEN: BGESEN Mask             */
#define SDHC_IRQSTATEN_BGESEN_SHIFT              2                                                   /*!< SDHC_IRQSTATEN: BGESEN Position         */
#define SDHC_IRQSTATEN_DINTSEN_MASK              (0x01UL << SDHC_IRQSTATEN_DINTSEN_SHIFT)            /*!< SDHC_IRQSTATEN: DINTSEN Mask            */
#define SDHC_IRQSTATEN_DINTSEN_SHIFT             3                                                   /*!< SDHC_IRQSTATEN: DINTSEN Position        */
#define SDHC_IRQSTATEN_BWRSEN_MASK               (0x01UL << SDHC_IRQSTATEN_BWRSEN_SHIFT)             /*!< SDHC_IRQSTATEN: BWRSEN Mask             */
#define SDHC_IRQSTATEN_BWRSEN_SHIFT              4                                                   /*!< SDHC_IRQSTATEN: BWRSEN Position         */
#define SDHC_IRQSTATEN_BRRSEN_MASK               (0x01UL << SDHC_IRQSTATEN_BRRSEN_SHIFT)             /*!< SDHC_IRQSTATEN: BRRSEN Mask             */
#define SDHC_IRQSTATEN_BRRSEN_SHIFT              5                                                   /*!< SDHC_IRQSTATEN: BRRSEN Position         */
#define SDHC_IRQSTATEN_CINSEN_MASK               (0x01UL << SDHC_IRQSTATEN_CINSEN_SHIFT)             /*!< SDHC_IRQSTATEN: CINSEN Mask             */
#define SDHC_IRQSTATEN_CINSEN_SHIFT              6                                                   /*!< SDHC_IRQSTATEN: CINSEN Position         */
#define SDHC_IRQSTATEN_CRMSEN_MASK               (0x01UL << SDHC_IRQSTATEN_CRMSEN_SHIFT)             /*!< SDHC_IRQSTATEN: CRMSEN Mask             */
#define SDHC_IRQSTATEN_CRMSEN_SHIFT              7                                                   /*!< SDHC_IRQSTATEN: CRMSEN Position         */
#define SDHC_IRQSTATEN_CINTSEN_MASK              (0x01UL << SDHC_IRQSTATEN_CINTSEN_SHIFT)            /*!< SDHC_IRQSTATEN: CINTSEN Mask            */
#define SDHC_IRQSTATEN_CINTSEN_SHIFT             8                                                   /*!< SDHC_IRQSTATEN: CINTSEN Position        */
#define SDHC_IRQSTATEN_CTOESEN_MASK              (0x01UL << SDHC_IRQSTATEN_CTOESEN_SHIFT)            /*!< SDHC_IRQSTATEN: CTOESEN Mask            */
#define SDHC_IRQSTATEN_CTOESEN_SHIFT             16                                                  /*!< SDHC_IRQSTATEN: CTOESEN Position        */
#define SDHC_IRQSTATEN_CCESEN_MASK               (0x01UL << SDHC_IRQSTATEN_CCESEN_SHIFT)             /*!< SDHC_IRQSTATEN: CCESEN Mask             */
#define SDHC_IRQSTATEN_CCESEN_SHIFT              17                                                  /*!< SDHC_IRQSTATEN: CCESEN Position         */
#define SDHC_IRQSTATEN_CEBESEN_MASK              (0x01UL << SDHC_IRQSTATEN_CEBESEN_SHIFT)            /*!< SDHC_IRQSTATEN: CEBESEN Mask            */
#define SDHC_IRQSTATEN_CEBESEN_SHIFT             18                                                  /*!< SDHC_IRQSTATEN: CEBESEN Position        */
#define SDHC_IRQSTATEN_CIESEN_MASK               (0x01UL << SDHC_IRQSTATEN_CIESEN_SHIFT)             /*!< SDHC_IRQSTATEN: CIESEN Mask             */
#define SDHC_IRQSTATEN_CIESEN_SHIFT              19                                                  /*!< SDHC_IRQSTATEN: CIESEN Position         */
#define SDHC_IRQSTATEN_DTOESEN_MASK              (0x01UL << SDHC_IRQSTATEN_DTOESEN_SHIFT)            /*!< SDHC_IRQSTATEN: DTOESEN Mask            */
#define SDHC_IRQSTATEN_DTOESEN_SHIFT             20                                                  /*!< SDHC_IRQSTATEN: DTOESEN Position        */
#define SDHC_IRQSTATEN_DCESEN_MASK               (0x01UL << SDHC_IRQSTATEN_DCESEN_SHIFT)             /*!< SDHC_IRQSTATEN: DCESEN Mask             */
#define SDHC_IRQSTATEN_DCESEN_SHIFT              21                                                  /*!< SDHC_IRQSTATEN: DCESEN Position         */
#define SDHC_IRQSTATEN_DEBESEN_MASK              (0x01UL << SDHC_IRQSTATEN_DEBESEN_SHIFT)            /*!< SDHC_IRQSTATEN: DEBESEN Mask            */
#define SDHC_IRQSTATEN_DEBESEN_SHIFT             22                                                  /*!< SDHC_IRQSTATEN: DEBESEN Position        */
#define SDHC_IRQSTATEN_AC12ESEN_MASK             (0x01UL << SDHC_IRQSTATEN_AC12ESEN_SHIFT)           /*!< SDHC_IRQSTATEN: AC12ESEN Mask           */
#define SDHC_IRQSTATEN_AC12ESEN_SHIFT            24                                                  /*!< SDHC_IRQSTATEN: AC12ESEN Position       */
#define SDHC_IRQSTATEN_DMAESEN_MASK              (0x01UL << SDHC_IRQSTATEN_DMAESEN_SHIFT)            /*!< SDHC_IRQSTATEN: DMAESEN Mask            */
#define SDHC_IRQSTATEN_DMAESEN_SHIFT             28                                                  /*!< SDHC_IRQSTATEN: DMAESEN Position        */
/* ------- IRQSIGEN Bit Fields                      ------ */
#define SDHC_IRQSIGEN_CCIEN_MASK                 (0x01UL << SDHC_IRQSIGEN_CCIEN_SHIFT)               /*!< SDHC_IRQSIGEN: CCIEN Mask               */
#define SDHC_IRQSIGEN_CCIEN_SHIFT                0                                                   /*!< SDHC_IRQSIGEN: CCIEN Position           */
#define SDHC_IRQSIGEN_TCIEN_MASK                 (0x01UL << SDHC_IRQSIGEN_TCIEN_SHIFT)               /*!< SDHC_IRQSIGEN: TCIEN Mask               */
#define SDHC_IRQSIGEN_TCIEN_SHIFT                1                                                   /*!< SDHC_IRQSIGEN: TCIEN Position           */
#define SDHC_IRQSIGEN_BGEIEN_MASK                (0x01UL << SDHC_IRQSIGEN_BGEIEN_SHIFT)              /*!< SDHC_IRQSIGEN: BGEIEN Mask              */
#define SDHC_IRQSIGEN_BGEIEN_SHIFT               2                                                   /*!< SDHC_IRQSIGEN: BGEIEN Position          */
#define SDHC_IRQSIGEN_DINTIEN_MASK               (0x01UL << SDHC_IRQSIGEN_DINTIEN_SHIFT)             /*!< SDHC_IRQSIGEN: DINTIEN Mask             */
#define SDHC_IRQSIGEN_DINTIEN_SHIFT              3                                                   /*!< SDHC_IRQSIGEN: DINTIEN Position         */
#define SDHC_IRQSIGEN_BWRIEN_MASK                (0x01UL << SDHC_IRQSIGEN_BWRIEN_SHIFT)              /*!< SDHC_IRQSIGEN: BWRIEN Mask              */
#define SDHC_IRQSIGEN_BWRIEN_SHIFT               4                                                   /*!< SDHC_IRQSIGEN: BWRIEN Position          */
#define SDHC_IRQSIGEN_BRRIEN_MASK                (0x01UL << SDHC_IRQSIGEN_BRRIEN_SHIFT)              /*!< SDHC_IRQSIGEN: BRRIEN Mask              */
#define SDHC_IRQSIGEN_BRRIEN_SHIFT               5                                                   /*!< SDHC_IRQSIGEN: BRRIEN Position          */
#define SDHC_IRQSIGEN_CINSIEN_MASK               (0x01UL << SDHC_IRQSIGEN_CINSIEN_SHIFT)             /*!< SDHC_IRQSIGEN: CINSIEN Mask             */
#define SDHC_IRQSIGEN_CINSIEN_SHIFT              6                                                   /*!< SDHC_IRQSIGEN: CINSIEN Position         */
#define SDHC_IRQSIGEN_CRMIEN_MASK                (0x01UL << SDHC_IRQSIGEN_CRMIEN_SHIFT)              /*!< SDHC_IRQSIGEN: CRMIEN Mask              */
#define SDHC_IRQSIGEN_CRMIEN_SHIFT               7                                                   /*!< SDHC_IRQSIGEN: CRMIEN Position          */
#define SDHC_IRQSIGEN_CINTIEN_MASK               (0x01UL << SDHC_IRQSIGEN_CINTIEN_SHIFT)             /*!< SDHC_IRQSIGEN: CINTIEN Mask             */
#define SDHC_IRQSIGEN_CINTIEN_SHIFT              8                                                   /*!< SDHC_IRQSIGEN: CINTIEN Position         */
#define SDHC_IRQSIGEN_CTOEIEN_MASK               (0x01UL << SDHC_IRQSIGEN_CTOEIEN_SHIFT)             /*!< SDHC_IRQSIGEN: CTOEIEN Mask             */
#define SDHC_IRQSIGEN_CTOEIEN_SHIFT              16                                                  /*!< SDHC_IRQSIGEN: CTOEIEN Position         */
#define SDHC_IRQSIGEN_CCEIEN_MASK                (0x01UL << SDHC_IRQSIGEN_CCEIEN_SHIFT)              /*!< SDHC_IRQSIGEN: CCEIEN Mask              */
#define SDHC_IRQSIGEN_CCEIEN_SHIFT               17                                                  /*!< SDHC_IRQSIGEN: CCEIEN Position          */
#define SDHC_IRQSIGEN_CEBEIEN_MASK               (0x01UL << SDHC_IRQSIGEN_CEBEIEN_SHIFT)             /*!< SDHC_IRQSIGEN: CEBEIEN Mask             */
#define SDHC_IRQSIGEN_CEBEIEN_SHIFT              18                                                  /*!< SDHC_IRQSIGEN: CEBEIEN Position         */
#define SDHC_IRQSIGEN_CIEIEN_MASK                (0x01UL << SDHC_IRQSIGEN_CIEIEN_SHIFT)              /*!< SDHC_IRQSIGEN: CIEIEN Mask              */
#define SDHC_IRQSIGEN_CIEIEN_SHIFT               19                                                  /*!< SDHC_IRQSIGEN: CIEIEN Position          */
#define SDHC_IRQSIGEN_DTOEIEN_MASK               (0x01UL << SDHC_IRQSIGEN_DTOEIEN_SHIFT)             /*!< SDHC_IRQSIGEN: DTOEIEN Mask             */
#define SDHC_IRQSIGEN_DTOEIEN_SHIFT              20                                                  /*!< SDHC_IRQSIGEN: DTOEIEN Position         */
#define SDHC_IRQSIGEN_DCEIEN_MASK                (0x01UL << SDHC_IRQSIGEN_DCEIEN_SHIFT)              /*!< SDHC_IRQSIGEN: DCEIEN Mask              */
#define SDHC_IRQSIGEN_DCEIEN_SHIFT               21                                                  /*!< SDHC_IRQSIGEN: DCEIEN Position          */
#define SDHC_IRQSIGEN_DEBEIEN_MASK               (0x01UL << SDHC_IRQSIGEN_DEBEIEN_SHIFT)             /*!< SDHC_IRQSIGEN: DEBEIEN Mask             */
#define SDHC_IRQSIGEN_DEBEIEN_SHIFT              22                                                  /*!< SDHC_IRQSIGEN: DEBEIEN Position         */
#define SDHC_IRQSIGEN_AC12EIEN_MASK              (0x01UL << SDHC_IRQSIGEN_AC12EIEN_SHIFT)            /*!< SDHC_IRQSIGEN: AC12EIEN Mask            */
#define SDHC_IRQSIGEN_AC12EIEN_SHIFT             24                                                  /*!< SDHC_IRQSIGEN: AC12EIEN Position        */
#define SDHC_IRQSIGEN_DMAEIEN_MASK               (0x01UL << SDHC_IRQSIGEN_DMAEIEN_SHIFT)             /*!< SDHC_IRQSIGEN: DMAEIEN Mask             */
#define SDHC_IRQSIGEN_DMAEIEN_SHIFT              28                                                  /*!< SDHC_IRQSIGEN: DMAEIEN Position         */
/* ------- AC12ERR Bit Fields                       ------ */
#define SDHC_AC12ERR_AC12NE_MASK                 (0x01UL << SDHC_AC12ERR_AC12NE_SHIFT)               /*!< SDHC_AC12ERR: AC12NE Mask               */
#define SDHC_AC12ERR_AC12NE_SHIFT                0                                                   /*!< SDHC_AC12ERR: AC12NE Position           */
#define SDHC_AC12ERR_AC12TOE_MASK                (0x01UL << SDHC_AC12ERR_AC12TOE_SHIFT)              /*!< SDHC_AC12ERR: AC12TOE Mask              */
#define SDHC_AC12ERR_AC12TOE_SHIFT               1                                                   /*!< SDHC_AC12ERR: AC12TOE Position          */
#define SDHC_AC12ERR_AC12EBE_MASK                (0x01UL << SDHC_AC12ERR_AC12EBE_SHIFT)              /*!< SDHC_AC12ERR: AC12EBE Mask              */
#define SDHC_AC12ERR_AC12EBE_SHIFT               2                                                   /*!< SDHC_AC12ERR: AC12EBE Position          */
#define SDHC_AC12ERR_AC12CE_MASK                 (0x01UL << SDHC_AC12ERR_AC12CE_SHIFT)               /*!< SDHC_AC12ERR: AC12CE Mask               */
#define SDHC_AC12ERR_AC12CE_SHIFT                3                                                   /*!< SDHC_AC12ERR: AC12CE Position           */
#define SDHC_AC12ERR_AC12IE_MASK                 (0x01UL << SDHC_AC12ERR_AC12IE_SHIFT)               /*!< SDHC_AC12ERR: AC12IE Mask               */
#define SDHC_AC12ERR_AC12IE_SHIFT                4                                                   /*!< SDHC_AC12ERR: AC12IE Position           */
#define SDHC_AC12ERR_CNIBAC12E_MASK              (0x01UL << SDHC_AC12ERR_CNIBAC12E_SHIFT)            /*!< SDHC_AC12ERR: CNIBAC12E Mask            */
#define SDHC_AC12ERR_CNIBAC12E_SHIFT             7                                                   /*!< SDHC_AC12ERR: CNIBAC12E Position        */
/* ------- HTCAPBLT Bit Fields                      ------ */
#define SDHC_HTCAPBLT_MBL_MASK                   (0x07UL << SDHC_HTCAPBLT_MBL_SHIFT)                 /*!< SDHC_HTCAPBLT: MBL Mask                 */
#define SDHC_HTCAPBLT_MBL_SHIFT                  16                                                  /*!< SDHC_HTCAPBLT: MBL Position             */
#define SDHC_HTCAPBLT_MBL(x)                     (((uint32_t)(((uint32_t)(x))<<SDHC_HTCAPBLT_MBL_SHIFT))&SDHC_HTCAPBLT_MBL_MASK) /*!< SDHC_HTCAPBLT                           */
#define SDHC_HTCAPBLT_ADMAS_MASK                 (0x01UL << SDHC_HTCAPBLT_ADMAS_SHIFT)               /*!< SDHC_HTCAPBLT: ADMAS Mask               */
#define SDHC_HTCAPBLT_ADMAS_SHIFT                20                                                  /*!< SDHC_HTCAPBLT: ADMAS Position           */
#define SDHC_HTCAPBLT_HSS_MASK                   (0x01UL << SDHC_HTCAPBLT_HSS_SHIFT)                 /*!< SDHC_HTCAPBLT: HSS Mask                 */
#define SDHC_HTCAPBLT_HSS_SHIFT                  21                                                  /*!< SDHC_HTCAPBLT: HSS Position             */
#define SDHC_HTCAPBLT_DMAS_MASK                  (0x01UL << SDHC_HTCAPBLT_DMAS_SHIFT)                /*!< SDHC_HTCAPBLT: DMAS Mask                */
#define SDHC_HTCAPBLT_DMAS_SHIFT                 22                                                  /*!< SDHC_HTCAPBLT: DMAS Position            */
#define SDHC_HTCAPBLT_SRS_MASK                   (0x01UL << SDHC_HTCAPBLT_SRS_SHIFT)                 /*!< SDHC_HTCAPBLT: SRS Mask                 */
#define SDHC_HTCAPBLT_SRS_SHIFT                  23                                                  /*!< SDHC_HTCAPBLT: SRS Position             */
#define SDHC_HTCAPBLT_VS33_MASK                  (0x01UL << SDHC_HTCAPBLT_VS33_SHIFT)                /*!< SDHC_HTCAPBLT: VS33 Mask                */
#define SDHC_HTCAPBLT_VS33_SHIFT                 24                                                  /*!< SDHC_HTCAPBLT: VS33 Position            */
#define SDHC_HTCAPBLT_VS30_MASK                  (0x01UL << SDHC_HTCAPBLT_VS30_SHIFT)                /*!< SDHC_HTCAPBLT: VS30 Mask                */
#define SDHC_HTCAPBLT_VS30_SHIFT                 25                                                  /*!< SDHC_HTCAPBLT: VS30 Position            */
#define SDHC_HTCAPBLT_VS18_MASK                  (0x01UL << SDHC_HTCAPBLT_VS18_SHIFT)                /*!< SDHC_HTCAPBLT: VS18 Mask                */
#define SDHC_HTCAPBLT_VS18_SHIFT                 26                                                  /*!< SDHC_HTCAPBLT: VS18 Position            */
/* ------- WML Bit Fields                           ------ */
#define SDHC_WML_RDWML_MASK                      (0xFFUL << SDHC_WML_RDWML_SHIFT)                    /*!< SDHC_WML: RDWML Mask                    */
#define SDHC_WML_RDWML_SHIFT                     0                                                   /*!< SDHC_WML: RDWML Position                */
#define SDHC_WML_RDWML(x)                        (((uint32_t)(((uint32_t)(x))<<SDHC_WML_RDWML_SHIFT))&SDHC_WML_RDWML_MASK) /*!< SDHC_WML                                */
#define SDHC_WML_WRWML_MASK                      (0xFFUL << SDHC_WML_WRWML_SHIFT)                    /*!< SDHC_WML: WRWML Mask                    */
#define SDHC_WML_WRWML_SHIFT                     16                                                  /*!< SDHC_WML: WRWML Position                */
#define SDHC_WML_WRWML(x)                        (((uint32_t)(((uint32_t)(x))<<SDHC_WML_WRWML_SHIFT))&SDHC_WML_WRWML_MASK) /*!< SDHC_WML                                */
#define SDHC_WML_WRBRSTLEN_MASK                  (0x1FUL << SDHC_WML_WRBRSTLEN_SHIFT)                /*!< SDHC_WML: WRBRSTLEN Mask                */
#define SDHC_WML_WRBRSTLEN_SHIFT                 24                                                  /*!< SDHC_WML: WRBRSTLEN Position            */
#define SDHC_WML_WRBRSTLEN(x)                    (((uint32_t)(((uint32_t)(x))<<SDHC_WML_WRBRSTLEN_SHIFT))&SDHC_WML_WRBRSTLEN_MASK) /*!< SDHC_WML                                */
/* ------- FEVT Bit Fields                          ------ */
#define SDHC_FEVT_AC12NE_MASK                    (0x01UL << SDHC_FEVT_AC12NE_SHIFT)                  /*!< SDHC_FEVT: AC12NE Mask                  */
#define SDHC_FEVT_AC12NE_SHIFT                   0                                                   /*!< SDHC_FEVT: AC12NE Position              */
#define SDHC_FEVT_AC12TOE_MASK                   (0x01UL << SDHC_FEVT_AC12TOE_SHIFT)                 /*!< SDHC_FEVT: AC12TOE Mask                 */
#define SDHC_FEVT_AC12TOE_SHIFT                  1                                                   /*!< SDHC_FEVT: AC12TOE Position             */
#define SDHC_FEVT_AC12CE_MASK                    (0x01UL << SDHC_FEVT_AC12CE_SHIFT)                  /*!< SDHC_FEVT: AC12CE Mask                  */
#define SDHC_FEVT_AC12CE_SHIFT                   2                                                   /*!< SDHC_FEVT: AC12CE Position              */
#define SDHC_FEVT_AC12EBE_MASK                   (0x01UL << SDHC_FEVT_AC12EBE_SHIFT)                 /*!< SDHC_FEVT: AC12EBE Mask                 */
#define SDHC_FEVT_AC12EBE_SHIFT                  3                                                   /*!< SDHC_FEVT: AC12EBE Position             */
#define SDHC_FEVT_AC12IE_MASK                    (0x01UL << SDHC_FEVT_AC12IE_SHIFT)                  /*!< SDHC_FEVT: AC12IE Mask                  */
#define SDHC_FEVT_AC12IE_SHIFT                   4                                                   /*!< SDHC_FEVT: AC12IE Position              */
#define SDHC_FEVT_CNIBAC12E_MASK                 (0x01UL << SDHC_FEVT_CNIBAC12E_SHIFT)               /*!< SDHC_FEVT: CNIBAC12E Mask               */
#define SDHC_FEVT_CNIBAC12E_SHIFT                7                                                   /*!< SDHC_FEVT: CNIBAC12E Position           */
#define SDHC_FEVT_CTOE_MASK                      (0x01UL << SDHC_FEVT_CTOE_SHIFT)                    /*!< SDHC_FEVT: CTOE Mask                    */
#define SDHC_FEVT_CTOE_SHIFT                     16                                                  /*!< SDHC_FEVT: CTOE Position                */
#define SDHC_FEVT_CCE_MASK                       (0x01UL << SDHC_FEVT_CCE_SHIFT)                     /*!< SDHC_FEVT: CCE Mask                     */
#define SDHC_FEVT_CCE_SHIFT                      17                                                  /*!< SDHC_FEVT: CCE Position                 */
#define SDHC_FEVT_CEBE_MASK                      (0x01UL << SDHC_FEVT_CEBE_SHIFT)                    /*!< SDHC_FEVT: CEBE Mask                    */
#define SDHC_FEVT_CEBE_SHIFT                     18                                                  /*!< SDHC_FEVT: CEBE Position                */
#define SDHC_FEVT_CIE_MASK                       (0x01UL << SDHC_FEVT_CIE_SHIFT)                     /*!< SDHC_FEVT: CIE Mask                     */
#define SDHC_FEVT_CIE_SHIFT                      19                                                  /*!< SDHC_FEVT: CIE Position                 */
#define SDHC_FEVT_DTOE_MASK                      (0x01UL << SDHC_FEVT_DTOE_SHIFT)                    /*!< SDHC_FEVT: DTOE Mask                    */
#define SDHC_FEVT_DTOE_SHIFT                     20                                                  /*!< SDHC_FEVT: DTOE Position                */
#define SDHC_FEVT_DCE_MASK                       (0x01UL << SDHC_FEVT_DCE_SHIFT)                     /*!< SDHC_FEVT: DCE Mask                     */
#define SDHC_FEVT_DCE_SHIFT                      21                                                  /*!< SDHC_FEVT: DCE Position                 */
#define SDHC_FEVT_DEBE_MASK                      (0x01UL << SDHC_FEVT_DEBE_SHIFT)                    /*!< SDHC_FEVT: DEBE Mask                    */
#define SDHC_FEVT_DEBE_SHIFT                     22                                                  /*!< SDHC_FEVT: DEBE Position                */
#define SDHC_FEVT_AC12E_MASK                     (0x01UL << SDHC_FEVT_AC12E_SHIFT)                   /*!< SDHC_FEVT: AC12E Mask                   */
#define SDHC_FEVT_AC12E_SHIFT                    24                                                  /*!< SDHC_FEVT: AC12E Position               */
#define SDHC_FEVT_DMAE_MASK                      (0x01UL << SDHC_FEVT_DMAE_SHIFT)                    /*!< SDHC_FEVT: DMAE Mask                    */
#define SDHC_FEVT_DMAE_SHIFT                     28                                                  /*!< SDHC_FEVT: DMAE Position                */
#define SDHC_FEVT_CINT_MASK                      (0x01UL << SDHC_FEVT_CINT_SHIFT)                    /*!< SDHC_FEVT: CINT Mask                    */
#define SDHC_FEVT_CINT_SHIFT                     31                                                  /*!< SDHC_FEVT: CINT Position                */
/* ------- ADMAES Bit Fields                        ------ */
#define SDHC_ADMAES_ADMAES_MASK                  (0x03UL << SDHC_ADMAES_ADMAES_SHIFT)                /*!< SDHC_ADMAES: ADMAES Mask                */
#define SDHC_ADMAES_ADMAES_SHIFT                 0                                                   /*!< SDHC_ADMAES: ADMAES Position            */
