podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define SDHC_ADMAES_ADMAES(x)                    (((uint32_t)(((uint32_t)(x))<<SDHC_ADMAES_ADMAES_SHIFT))&SDHC_ADMAES_ADMAES_MASK) /*!< SDHC_ADMAES                             */
#define SDHC_ADMAES_ADMALME_MASK                 (0x01UL << SDHC_ADMAES_ADMALME_SHIFT)               /*!< SDHC_ADMAES: ADMALME Mask               */
#define SDHC_ADMAES_ADMALME_SHIFT                2                                                   /*!< SDHC_ADMAES: ADMALME Position           */
#define SDHC_ADMAES_ADMADCE_MASK                 (0x01UL << SDHC_ADMAES_ADMADCE_SHIFT)               /*!< SDHC_ADMAES: ADMADCE Mask               */
#define SDHC_ADMAES_ADMADCE_SHIFT                3                                                   /*!< SDHC_ADMAES: ADMADCE Position           */
/* ------- ADSADDR Bit Fields                       ------ */
#define SDHC_ADSADDR_ADSADDR_MASK                (0x3FFFFFFFUL << SDHC_ADSADDR_ADSADDR_SHIFT)        /*!< SDHC_ADSADDR: ADSADDR Mask              */
#define SDHC_ADSADDR_ADSADDR_SHIFT               2                                                   /*!< SDHC_ADSADDR: ADSADDR Position          */
#define SDHC_ADSADDR_ADSADDR(x)                  (((uint32_t)(((uint32_t)(x))<<SDHC_ADSADDR_ADSADDR_SHIFT))&SDHC_ADSADDR_ADSADDR_MASK) /*!< SDHC_ADSADDR                            */
/* ------- VENDOR Bit Fields                        ------ */
#define SDHC_VENDOR_EXTDMAEN_MASK                (0x01UL << SDHC_VENDOR_EXTDMAEN_SHIFT)              /*!< SDHC_VENDOR: EXTDMAEN Mask              */
#define SDHC_VENDOR_EXTDMAEN_SHIFT               0                                                   /*!< SDHC_VENDOR: EXTDMAEN Position          */
#define SDHC_VENDOR_EXBLKNU_MASK                 (0x01UL << SDHC_VENDOR_EXBLKNU_SHIFT)               /*!< SDHC_VENDOR: EXBLKNU Mask               */
#define SDHC_VENDOR_EXBLKNU_SHIFT                1                                                   /*!< SDHC_VENDOR: EXBLKNU Position           */
#define SDHC_VENDOR_INTSTVAL_MASK                (0xFFUL << SDHC_VENDOR_INTSTVAL_SHIFT)              /*!< SDHC_VENDOR: INTSTVAL Mask              */
#define SDHC_VENDOR_INTSTVAL_SHIFT               16                                                  /*!< SDHC_VENDOR: INTSTVAL Position          */
#define SDHC_VENDOR_INTSTVAL(x)                  (((uint32_t)(((uint32_t)(x))<<SDHC_VENDOR_INTSTVAL_SHIFT))&SDHC_VENDOR_INTSTVAL_MASK) /*!< SDHC_VENDOR                             */
/* ------- MMCBOOT Bit Fields                       ------ */
#define SDHC_MMCBOOT_DTOCVACK_MASK               (0x0FUL << SDHC_MMCBOOT_DTOCVACK_SHIFT)             /*!< SDHC_MMCBOOT: DTOCVACK Mask             */
#define SDHC_MMCBOOT_DTOCVACK_SHIFT              0                                                   /*!< SDHC_MMCBOOT: DTOCVACK Position         */
#define SDHC_MMCBOOT_DTOCVACK(x)                 (((uint32_t)(((uint32_t)(x))<<SDHC_MMCBOOT_DTOCVACK_SHIFT))&SDHC_MMCBOOT_DTOCVACK_MASK) /*!< SDHC_MMCBOOT                            */
#define SDHC_MMCBOOT_BOOTACK_MASK                (0x01UL << SDHC_MMCBOOT_BOOTACK_SHIFT)              /*!< SDHC_MMCBOOT: BOOTACK Mask              */
#define SDHC_MMCBOOT_BOOTACK_SHIFT               4                                                   /*!< SDHC_MMCBOOT: BOOTACK Position          */
#define SDHC_MMCBOOT_BOOTMODE_MASK               (0x01UL << SDHC_MMCBOOT_BOOTMODE_SHIFT)             /*!< SDHC_MMCBOOT: BOOTMODE Mask             */
#define SDHC_MMCBOOT_BOOTMODE_SHIFT              5                                                   /*!< SDHC_MMCBOOT: BOOTMODE Position         */
#define SDHC_MMCBOOT_BOOTEN_MASK                 (0x01UL << SDHC_MMCBOOT_BOOTEN_SHIFT)               /*!< SDHC_MMCBOOT: BOOTEN Mask               */
#define SDHC_MMCBOOT_BOOTEN_SHIFT                6                                                   /*!< SDHC_MMCBOOT: BOOTEN Position           */
#define SDHC_MMCBOOT_AUTOSABGEN_MASK             (0x01UL << SDHC_MMCBOOT_AUTOSABGEN_SHIFT)           /*!< SDHC_MMCBOOT: AUTOSABGEN Mask           */
#define SDHC_MMCBOOT_AUTOSABGEN_SHIFT            7                                                   /*!< SDHC_MMCBOOT: AUTOSABGEN Position       */
#define SDHC_MMCBOOT_BOOTBLKCNT_MASK             (0xFFFFUL << SDHC_MMCBOOT_BOOTBLKCNT_SHIFT)         /*!< SDHC_MMCBOOT: BOOTBLKCNT Mask           */
#define SDHC_MMCBOOT_BOOTBLKCNT_SHIFT            16                                                  /*!< SDHC_MMCBOOT: BOOTBLKCNT Position       */
#define SDHC_MMCBOOT_BOOTBLKCNT(x)               (((uint32_t)(((uint32_t)(x))<<SDHC_MMCBOOT_BOOTBLKCNT_SHIFT))&SDHC_MMCBOOT_BOOTBLKCNT_MASK) /*!< SDHC_MMCBOOT                            */
/* ------- HOSTVER Bit Fields                       ------ */
#define SDHC_HOSTVER_SVN_MASK                    (0xFFUL << SDHC_HOSTVER_SVN_SHIFT)                  /*!< SDHC_HOSTVER: SVN Mask                  */
#define SDHC_HOSTVER_SVN_SHIFT                   0                                                   /*!< SDHC_HOSTVER: SVN Position              */
#define SDHC_HOSTVER_SVN(x)                      (((uint32_t)(((uint32_t)(x))<<SDHC_HOSTVER_SVN_SHIFT))&SDHC_HOSTVER_SVN_MASK) /*!< SDHC_HOSTVER                            */
#define SDHC_HOSTVER_VVN_MASK                    (0xFFUL << SDHC_HOSTVER_VVN_SHIFT)                  /*!< SDHC_HOSTVER: VVN Mask                  */
#define SDHC_HOSTVER_VVN_SHIFT                   8                                                   /*!< SDHC_HOSTVER: VVN Position              */
#define SDHC_HOSTVER_VVN(x)                      (((uint32_t)(((uint32_t)(x))<<SDHC_HOSTVER_VVN_SHIFT))&SDHC_HOSTVER_VVN_MASK) /*!< SDHC_HOSTVER                            */
/**
 * @} */ /* End group SDHC_Register_Masks_GROUP 
 */

/* SDHC - Peripheral instance base addresses */
#define SDHC_BasePtr                   0x400B1000UL //!< Peripheral base address
#define SDHC                           ((SDHC_Type *) SDHC_BasePtr) //!< Freescale base pointer
#define SDHC_BASE_PTR                  (SDHC) //!< Freescale style base pointer
/**
 * @} */ /* End group SDHC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SIM_Peripheral_access_layer_GROUP SIM Peripheral Access Layer
* @brief C Struct for SIM
* @{
*/

/* ================================================================================ */
/* ================           SIM (file:SIM_MK61F15)               ================ */
/* ================================================================================ */

/**
 * @brief System Integration Module
 */
/**
* @addtogroup SIM_structs_GROUP SIM struct
* @brief Struct for SIM
* @{
*/
typedef struct {                                /*       SIM Structure                                                */
   __IO uint32_t  SOPT1;                        /**< 0000: System Options Register 1                                    */
   __IO uint32_t  SOPT1CFG;                     /**< 0004: SOPT1 Configuration Register                                 */
   __I  uint32_t  RESERVED0[1023];             
   __IO uint32_t  SOPT2;                        /**< 1004: System Options Register 2                                    */
   __I  uint32_t  RESERVED1;                   
   __IO uint32_t  SOPT4;                        /**< 100C: System Options Register 4                                    */
   __IO uint32_t  SOPT5;                        /**< 1010: System Options Register 5                                    */
   __IO uint32_t  SOPT6;                        /**< 1014: System Options Register 6                                    */
   __IO uint32_t  SOPT7;                        /**< 1018: System Options Register 7                                    */
   __I  uint32_t  RESERVED2[2];                
   __I  uint32_t  SDID;                         /**< 1024: System Device Identification Register                        */
   __IO uint32_t  SCGC1;                        /**< 1028: System Clock Gating Control Register 1                       */
   __IO uint32_t  SCGC2;                        /**< 102C: System Clock Gating Control Register 2                       */
   __IO uint32_t  SCGC3;                        /**< 1030: System Clock Gating Control Register 3                       */
   __IO uint32_t  SCGC4;                        /**< 1034: System Clock Gating Control Register 4                       */
   __IO uint32_t  SCGC5;                        /**< 1038: System Clock Gating Control Register 5                       */
   __IO uint32_t  SCGC6;                        /**< 103C: System Clock Gating Control Register 6                       */
   __IO uint32_t  SCGC7;                        /**< 1040: System Clock Gating Control Register 7                       */
   __IO uint32_t  CLKDIV1;                      /**< 1044: System Clock Divider Register 1                              */
   __IO uint32_t  CLKDIV2;                      /**< 1048: System Clock Divider Register 2                              */
   __IO uint32_t  FCFG1;                        /**< 104C: Flash Configuration Register 1                               */
   __I  uint32_t  FCFG2;                        /**< 1050: Flash Configuration Register 2                               */
   __I  uint32_t  UIDH;                         /**< 1054: Unique Identification Register High                          */
   __I  uint32_t  UIDMH;                        /**< 1058: Unique Identification Register Mid-High                      */
   __I  uint32_t  UIDML;                        /**< 105C: Unique Identification Register Mid Low                       */
   __I  uint32_t  UIDL;                         /**< 1060: Unique Identification Register Low                           */
   __I  uint32_t  RESERVED3;                   
   __IO uint32_t  CLKDIV4;                      /**< 1068: System Clock Divider Register 4                              */
   __IO uint32_t  MCR;                          /**< 106C: Misc Control Register                                        */
} SIM_Type;

/**
 * @} */ /* End group SIM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SIM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

