podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define SIM_SCGC2_DAC0_SHIFT                     12                                                  /*!< SIM_SCGC2: DAC0 Position                */
#define SIM_SCGC2_DAC1_MASK                      (0x01UL << SIM_SCGC2_DAC1_SHIFT)                    /*!< SIM_SCGC2: DAC1 Mask                    */
#define SIM_SCGC2_DAC1_SHIFT                     13                                                  /*!< SIM_SCGC2: DAC1 Position                */
/* ------- SCGC3 Bit Fields                         ------ */
#define SIM_SCGC3_RNGA_MASK                      (0x01UL << SIM_SCGC3_RNGA_SHIFT)                    /*!< SIM_SCGC3: RNGA Mask                    */
#define SIM_SCGC3_RNGA_SHIFT                     0                                                   /*!< SIM_SCGC3: RNGA Position                */
#define SIM_SCGC3_FLEXCAN1_MASK                  (0x01UL << SIM_SCGC3_FLEXCAN1_SHIFT)                /*!< SIM_SCGC3: FLEXCAN1 Mask                */
#define SIM_SCGC3_FLEXCAN1_SHIFT                 4                                                   /*!< SIM_SCGC3: FLEXCAN1 Position            */
#define SIM_SCGC3_NFC_MASK                       (0x01UL << SIM_SCGC3_NFC_SHIFT)                     /*!< SIM_SCGC3: NFC Mask                     */
#define SIM_SCGC3_NFC_SHIFT                      8                                                   /*!< SIM_SCGC3: NFC Position                 */
#define SIM_SCGC3_DSPI2_MASK                     (0x01UL << SIM_SCGC3_DSPI2_SHIFT)                   /*!< SIM_SCGC3: DSPI2 Mask                   */
#define SIM_SCGC3_DSPI2_SHIFT                    12                                                  /*!< SIM_SCGC3: DSPI2 Position               */
#define SIM_SCGC3_DDR_MASK                       (0x01UL << SIM_SCGC3_DDR_SHIFT)                     /*!< SIM_SCGC3: DDR Mask                     */
#define SIM_SCGC3_DDR_SHIFT                      14                                                  /*!< SIM_SCGC3: DDR Position                 */
#define SIM_SCGC3_SAI1_MASK                      (0x01UL << SIM_SCGC3_SAI1_SHIFT)                    /*!< SIM_SCGC3: SAI1 Mask                    */
#define SIM_SCGC3_SAI1_SHIFT                     15                                                  /*!< SIM_SCGC3: SAI1 Position                */
#define SIM_SCGC3_ESDHC_MASK                     (0x01UL << SIM_SCGC3_ESDHC_SHIFT)                   /*!< SIM_SCGC3: ESDHC Mask                   */
#define SIM_SCGC3_ESDHC_SHIFT                    17                                                  /*!< SIM_SCGC3: ESDHC Position               */
#define SIM_SCGC3_FTM2_MASK                      (0x01UL << SIM_SCGC3_FTM2_SHIFT)                    /*!< SIM_SCGC3: FTM2 Mask                    */
#define SIM_SCGC3_FTM2_SHIFT                     24                                                  /*!< SIM_SCGC3: FTM2 Position                */
#define SIM_SCGC3_FTM3_MASK                      (0x01UL << SIM_SCGC3_FTM3_SHIFT)                    /*!< SIM_SCGC3: FTM3 Mask                    */
#define SIM_SCGC3_FTM3_SHIFT                     25                                                  /*!< SIM_SCGC3: FTM3 Position                */
#define SIM_SCGC3_ADC1_MASK                      (0x01UL << SIM_SCGC3_ADC1_SHIFT)                    /*!< SIM_SCGC3: ADC1 Mask                    */
#define SIM_SCGC3_ADC1_SHIFT                     27                                                  /*!< SIM_SCGC3: ADC1 Position                */
#define SIM_SCGC3_ADC3_MASK                      (0x01UL << SIM_SCGC3_ADC3_SHIFT)                    /*!< SIM_SCGC3: ADC3 Mask                    */
#define SIM_SCGC3_ADC3_SHIFT                     28                                                  /*!< SIM_SCGC3: ADC3 Position                */
/* ------- SCGC4 Bit Fields                         ------ */
#define SIM_SCGC4_EWM_MASK                       (0x01UL << SIM_SCGC4_EWM_SHIFT)                     /*!< SIM_SCGC4: EWM Mask                     */
#define SIM_SCGC4_EWM_SHIFT                      1                                                   /*!< SIM_SCGC4: EWM Position                 */
#define SIM_SCGC4_CMT_MASK                       (0x01UL << SIM_SCGC4_CMT_SHIFT)                     /*!< SIM_SCGC4: CMT Mask                     */
#define SIM_SCGC4_CMT_SHIFT                      2                                                   /*!< SIM_SCGC4: CMT Position                 */
#define SIM_SCGC4_IIC0_MASK                      (0x01UL << SIM_SCGC4_IIC0_SHIFT)                    /*!< SIM_SCGC4: IIC0 Mask                    */
#define SIM_SCGC4_IIC0_SHIFT                     6                                                   /*!< SIM_SCGC4: IIC0 Position                */
#define SIM_SCGC4_IIC1_MASK                      (0x01UL << SIM_SCGC4_IIC1_SHIFT)                    /*!< SIM_SCGC4: IIC1 Mask                    */
#define SIM_SCGC4_IIC1_SHIFT                     7                                                   /*!< SIM_SCGC4: IIC1 Position                */
#define SIM_SCGC4_UART0_MASK                     (0x01UL << SIM_SCGC4_UART0_SHIFT)                   /*!< SIM_SCGC4: UART0 Mask                   */
#define SIM_SCGC4_UART0_SHIFT                    10                                                  /*!< SIM_SCGC4: UART0 Position               */
#define SIM_SCGC4_UART1_MASK                     (0x01UL << SIM_SCGC4_UART1_SHIFT)                   /*!< SIM_SCGC4: UART1 Mask                   */
#define SIM_SCGC4_UART1_SHIFT                    11                                                  /*!< SIM_SCGC4: UART1 Position               */
#define SIM_SCGC4_UART2_MASK                     (0x01UL << SIM_SCGC4_UART2_SHIFT)                   /*!< SIM_SCGC4: UART2 Mask                   */
#define SIM_SCGC4_UART2_SHIFT                    12                                                  /*!< SIM_SCGC4: UART2 Position               */
#define SIM_SCGC4_UART3_MASK                     (0x01UL << SIM_SCGC4_UART3_SHIFT)                   /*!< SIM_SCGC4: UART3 Mask                   */
#define SIM_SCGC4_UART3_SHIFT                    13                                                  /*!< SIM_SCGC4: UART3 Position               */
#define SIM_SCGC4_USBFS_MASK                     (0x01UL << SIM_SCGC4_USBFS_SHIFT)                   /*!< SIM_SCGC4: USBFS Mask                   */
#define SIM_SCGC4_USBFS_SHIFT                    18                                                  /*!< SIM_SCGC4: USBFS Position               */
#define SIM_SCGC4_CMP_MASK                       (0x01UL << SIM_SCGC4_CMP_SHIFT)                     /*!< SIM_SCGC4: CMP Mask                     */
#define SIM_SCGC4_CMP_SHIFT                      19                                                  /*!< SIM_SCGC4: CMP Position                 */
#define SIM_SCGC4_VREF_MASK                      (0x01UL << SIM_SCGC4_VREF_SHIFT)                    /*!< SIM_SCGC4: VREF Mask                    */
#define SIM_SCGC4_VREF_SHIFT                     20                                                  /*!< SIM_SCGC4: VREF Position                */
#define SIM_SCGC4_LLWU_MASK                      (0x01UL << SIM_SCGC4_LLWU_SHIFT)                    /*!< SIM_SCGC4: LLWU Mask                    */
#define SIM_SCGC4_LLWU_SHIFT                     28                                                  /*!< SIM_SCGC4: LLWU Position                */
/* ------- SCGC5 Bit Fields                         ------ */
#define SIM_SCGC5_LPTIMER_MASK                   (0x01UL << SIM_SCGC5_LPTIMER_SHIFT)                 /*!< SIM_SCGC5: LPTIMER Mask                 */
#define SIM_SCGC5_LPTIMER_SHIFT                  0                                                   /*!< SIM_SCGC5: LPTIMER Position             */
#define SIM_SCGC5_REGFILE_MASK                   (0x01UL << SIM_SCGC5_REGFILE_SHIFT)                 /*!< SIM_SCGC5: REGFILE Mask                 */
#define SIM_SCGC5_REGFILE_SHIFT                  1                                                   /*!< SIM_SCGC5: REGFILE Position             */
#define SIM_SCGC5_DRYICE_MASK                    (0x01UL << SIM_SCGC5_DRYICE_SHIFT)                  /*!< SIM_SCGC5: DRYICE Mask                  */
#define SIM_SCGC5_DRYICE_SHIFT                   2                                                   /*!< SIM_SCGC5: DRYICE Position              */
#define SIM_SCGC5_DRYICESECREG_MASK              (0x01UL << SIM_SCGC5_DRYICESECREG_SHIFT)            /*!< SIM_SCGC5: DRYICESECREG Mask            */
#define SIM_SCGC5_DRYICESECREG_SHIFT             3                                                   /*!< SIM_SCGC5: DRYICESECREG Position        */
#define SIM_SCGC5_TSI0_MASK                      (0x01UL << SIM_SCGC5_TSI0_SHIFT)                    /*!< SIM_SCGC5: TSI0 Mask                    */
#define SIM_SCGC5_TSI0_SHIFT                     5                                                   /*!< SIM_SCGC5: TSI0 Position                */
#define SIM_SCGC5_PORTA_MASK                     (0x01UL << SIM_SCGC5_PORTA_SHIFT)                   /*!< SIM_SCGC5: PORTA Mask                   */
#define SIM_SCGC5_PORTA_SHIFT                    9                                                   /*!< SIM_SCGC5: PORTA Position               */
#define SIM_SCGC5_PORTB_MASK                     (0x01UL << SIM_SCGC5_PORTB_SHIFT)                   /*!< SIM_SCGC5: PORTB Mask                   */
#define SIM_SCGC5_PORTB_SHIFT                    10                                                  /*!< SIM_SCGC5: PORTB Position               */
#define SIM_SCGC5_PORTC_MASK                     (0x01UL << SIM_SCGC5_PORTC_SHIFT)                   /*!< SIM_SCGC5: PORTC Mask                   */
#define SIM_SCGC5_PORTC_SHIFT                    11                                                  /*!< SIM_SCGC5: PORTC Position               */
#define SIM_SCGC5_PORTD_MASK                     (0x01UL << SIM_SCGC5_PORTD_SHIFT)                   /*!< SIM_SCGC5: PORTD Mask                   */
#define SIM_SCGC5_PORTD_SHIFT                    12                                                  /*!< SIM_SCGC5: PORTD Position               */
#define SIM_SCGC5_PORTE_MASK                     (0x01UL << SIM_SCGC5_PORTE_SHIFT)                   /*!< SIM_SCGC5: PORTE Mask                   */
#define SIM_SCGC5_PORTE_SHIFT                    13                                                  /*!< SIM_SCGC5: PORTE Position               */
#define SIM_SCGC5_PORTF_MASK                     (0x01UL << SIM_SCGC5_PORTF_SHIFT)                   /*!< SIM_SCGC5: PORTF Mask                   */
#define SIM_SCGC5_PORTF_SHIFT                    14                                                  /*!< SIM_SCGC5: PORTF Position               */
/* ------- SCGC6 Bit Fields                         ------ */
#define SIM_SCGC6_DMAMUX0_MASK                   (0x01UL << SIM_SCGC6_DMAMUX0_SHIFT)                 /*!< SIM_SCGC6: DMAMUX0 Mask                 */
#define SIM_SCGC6_DMAMUX0_SHIFT                  1                                                   /*!< SIM_SCGC6: DMAMUX0 Position             */
#define SIM_SCGC6_DMAMUX1_MASK                   (0x01UL << SIM_SCGC6_DMAMUX1_SHIFT)                 /*!< SIM_SCGC6: DMAMUX1 Mask                 */
#define SIM_SCGC6_DMAMUX1_SHIFT                  2                                                   /*!< SIM_SCGC6: DMAMUX1 Position             */
#define SIM_SCGC6_FLEXCAN0_MASK                  (0x01UL << SIM_SCGC6_FLEXCAN0_SHIFT)                /*!< SIM_SCGC6: FLEXCAN0 Mask                */
#define SIM_SCGC6_FLEXCAN0_SHIFT                 4                                                   /*!< SIM_SCGC6: FLEXCAN0 Position            */
#define SIM_SCGC6_DSPI0_MASK                     (0x01UL << SIM_SCGC6_DSPI0_SHIFT)                   /*!< SIM_SCGC6: DSPI0 Mask                   */
#define SIM_SCGC6_DSPI0_SHIFT                    12                                                  /*!< SIM_SCGC6: DSPI0 Position               */
#define SIM_SCGC6_DSPI1_MASK                     (0x01UL << SIM_SCGC6_DSPI1_SHIFT)                   /*!< SIM_SCGC6: DSPI1 Mask                   */
#define SIM_SCGC6_DSPI1_SHIFT                    13                                                  /*!< SIM_SCGC6: DSPI1 Position               */
#define SIM_SCGC6_SAI0_MASK                      (0x01UL << SIM_SCGC6_SAI0_SHIFT)                    /*!< SIM_SCGC6: SAI0 Mask                    */
#define SIM_SCGC6_SAI0_SHIFT                     15                                                  /*!< SIM_SCGC6: SAI0 Position                */
#define SIM_SCGC6_CRC_MASK                       (0x01UL << SIM_SCGC6_CRC_SHIFT)                     /*!< SIM_SCGC6: CRC Mask                     */
#define SIM_SCGC6_CRC_SHIFT                      18                                                  /*!< SIM_SCGC6: CRC Position                 */
#define SIM_SCGC6_USBHS_MASK                     (0x01UL << SIM_SCGC6_USBHS_SHIFT)                   /*!< SIM_SCGC6: USBHS Mask                   */
#define SIM_SCGC6_USBHS_SHIFT                    20                                                  /*!< SIM_SCGC6: USBHS Position               */
#define SIM_SCGC6_USBDCD_MASK                    (0x01UL << SIM_SCGC6_USBDCD_SHIFT)                  /*!< SIM_SCGC6: USBDCD Mask                  */
#define SIM_SCGC6_USBDCD_SHIFT                   21                                                  /*!< SIM_SCGC6: USBDCD Position              */
#define SIM_SCGC6_PDB_MASK                       (0x01UL << SIM_SCGC6_PDB_SHIFT)                     /*!< SIM_SCGC6: PDB Mask                     */
#define SIM_SCGC6_PDB_SHIFT                      22                                                  /*!< SIM_SCGC6: PDB Position                 */
#define SIM_SCGC6_PIT_MASK                       (0x01UL << SIM_SCGC6_PIT_SHIFT)                     /*!< SIM_SCGC6: PIT Mask                     */
#define SIM_SCGC6_PIT_SHIFT                      23                                                  /*!< SIM_SCGC6: PIT Position                 */
#define SIM_SCGC6_FTM0_MASK                      (0x01UL << SIM_SCGC6_FTM0_SHIFT)                    /*!< SIM_SCGC6: FTM0 Mask                    */
#define SIM_SCGC6_FTM0_SHIFT                     24                                                  /*!< SIM_SCGC6: FTM0 Position                */
#define SIM_SCGC6_FTM1_MASK                      (0x01UL << SIM_SCGC6_FTM1_SHIFT)                    /*!< SIM_SCGC6: FTM1 Mask                    */
#define SIM_SCGC6_FTM1_SHIFT                     25                                                  /*!< SIM_SCGC6: FTM1 Position                */
#define SIM_SCGC6_ADC0_MASK                      (0x01UL << SIM_SCGC6_ADC0_SHIFT)                    /*!< SIM_SCGC6: ADC0 Mask                    */
#define SIM_SCGC6_ADC0_SHIFT                     27                                                  /*!< SIM_SCGC6: ADC0 Position                */
#define SIM_SCGC6_ADC2_MASK                      (0x01UL << SIM_SCGC6_ADC2_SHIFT)                    /*!< SIM_SCGC6: ADC2 Mask                    */
#define SIM_SCGC6_ADC2_SHIFT                     28                                                  /*!< SIM_SCGC6: ADC2 Position                */
#define SIM_SCGC6_RTC_MASK                       (0x01UL << SIM_SCGC6_RTC_SHIFT)                     /*!< SIM_SCGC6: RTC Mask                     */
#define SIM_SCGC6_RTC_SHIFT                      29                                                  /*!< SIM_SCGC6: RTC Position                 */
/* ------- SCGC7 Bit Fields                         ------ */
#define SIM_SCGC7_FLEXBUS_MASK                   (0x01UL << SIM_SCGC7_FLEXBUS_SHIFT)                 /*!< SIM_SCGC7: FLEXBUS Mask                 */
#define SIM_SCGC7_FLEXBUS_SHIFT                  0                                                   /*!< SIM_SCGC7: FLEXBUS Position             */
#define SIM_SCGC7_DMA_MASK                       (0x01UL << SIM_SCGC7_DMA_SHIFT)                     /*!< SIM_SCGC7: DMA Mask                     */
#define SIM_SCGC7_DMA_SHIFT                      1                                                   /*!< SIM_SCGC7: DMA Position                 */
#define SIM_SCGC7_MPU_MASK                       (0x01UL << SIM_SCGC7_MPU_SHIFT)                     /*!< SIM_SCGC7: MPU Mask                     */
#define SIM_SCGC7_MPU_SHIFT                      2                                                   /*!< SIM_SCGC7: MPU Position                 */
/* ------- CLKDIV1 Bit Fields                       ------ */
#define SIM_CLKDIV1_OUTDIV4_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV4_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV4 Mask               */
#define SIM_CLKDIV1_OUTDIV4_SHIFT                16                                                  /*!< SIM_CLKDIV1: OUTDIV4 Position           */
#define SIM_CLKDIV1_OUTDIV4(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV4_SHIFT))&SIM_CLKDIV1_OUTDIV4_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV3_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV3_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV3 Mask               */
#define SIM_CLKDIV1_OUTDIV3_SHIFT                20                                                  /*!< SIM_CLKDIV1: OUTDIV3 Position           */
#define SIM_CLKDIV1_OUTDIV3(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV3_SHIFT))&SIM_CLKDIV1_OUTDIV3_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV2_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV2_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV2 Mask               */
#define SIM_CLKDIV1_OUTDIV2_SHIFT                24                                                  /*!< SIM_CLKDIV1: OUTDIV2 Position           */
#define SIM_CLKDIV1_OUTDIV2(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV2_SHIFT))&SIM_CLKDIV1_OUTDIV2_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV1_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV1_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV1 Mask               */
#define SIM_CLKDIV1_OUTDIV1_SHIFT                28                                                  /*!< SIM_CLKDIV1: OUTDIV1 Position           */
#define SIM_CLKDIV1_OUTDIV1(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV1_SHIFT))&SIM_CLKDIV1_OUTDIV1_MASK) /*!< SIM_CLKDIV1                             */
/* ------- CLKDIV2 Bit Fields                       ------ */
#define SIM_CLKDIV2_USBFSFRAC_MASK               (0x01UL << SIM_CLKDIV2_USBFSFRAC_SHIFT)             /*!< SIM_CLKDIV2: USBFSFRAC Mask             */
#define SIM_CLKDIV2_USBFSFRAC_SHIFT              0                                                   /*!< SIM_CLKDIV2: USBFSFRAC Position         */
#define SIM_CLKDIV2_USBFSDIV_MASK                (0x07UL << SIM_CLKDIV2_USBFSDIV_SHIFT)              /*!< SIM_CLKDIV2: USBFSDIV Mask              */
#define SIM_CLKDIV2_USBFSDIV_SHIFT               1                                                   /*!< SIM_CLKDIV2: USBFSDIV Position          */
#define SIM_CLKDIV2_USBFSDIV(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV2_USBFSDIV_SHIFT))&SIM_CLKDIV2_USBFSDIV_MASK) /*!< SIM_CLKDIV2                             */
#define SIM_CLKDIV2_USBHSFRAC_MASK               (0x01UL << SIM_CLKDIV2_USBHSFRAC_SHIFT)             /*!< SIM_CLKDIV2: USBHSFRAC Mask             */
#define SIM_CLKDIV2_USBHSFRAC_SHIFT              8                                                   /*!< SIM_CLKDIV2: USBHSFRAC Position         */
#define SIM_CLKDIV2_USBHSDIV_MASK                (0x07UL << SIM_CLKDIV2_USBHSDIV_SHIFT)              /*!< SIM_CLKDIV2: USBHSDIV Mask              */
#define SIM_CLKDIV2_USBHSDIV_SHIFT               9                                                   /*!< SIM_CLKDIV2: USBHSDIV Position          */
#define SIM_CLKDIV2_USBHSDIV(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV2_USBHSDIV_SHIFT))&SIM_CLKDIV2_USBHSDIV_MASK) /*!< SIM_CLKDIV2                             */
/* ------- FCFG1 Bit Fields                         ------ */
#define SIM_FCFG1_FTFDIS_MASK                    (0x01UL << SIM_FCFG1_FTFDIS_SHIFT)                  /*!< SIM_FCFG1: FTFDIS Mask                  */
#define SIM_FCFG1_FTFDIS_SHIFT                   0                                                   /*!< SIM_FCFG1: FTFDIS Position              */
#define SIM_FCFG1_DEPART_MASK                    (0x0FUL << SIM_FCFG1_DEPART_SHIFT)                  /*!< SIM_FCFG1: DEPART Mask                  */
#define SIM_FCFG1_DEPART_SHIFT                   8                                                   /*!< SIM_FCFG1: DEPART Position              */
#define SIM_FCFG1_DEPART(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_DEPART_SHIFT))&SIM_FCFG1_DEPART_MASK) /*!< SIM_FCFG1                               */
#define SIM_FCFG1_EESIZE_MASK                    (0x0FUL << SIM_FCFG1_EESIZE_SHIFT)                  /*!< SIM_FCFG1: EESIZE Mask                  */
#define SIM_FCFG1_EESIZE_SHIFT                   16                                                  /*!< SIM_FCFG1: EESIZE Position              */
#define SIM_FCFG1_EESIZE(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_EESIZE_SHIFT))&SIM_FCFG1_EESIZE_MASK) /*!< SIM_FCFG1                               */
#define SIM_FCFG1_PFSIZE_MASK                    (0x0FUL << SIM_FCFG1_PFSIZE_SHIFT)                  /*!< SIM_FCFG1: PFSIZE Mask                  */
#define SIM_FCFG1_PFSIZE_SHIFT                   24                                                  /*!< SIM_FCFG1: PFSIZE Position              */
#define SIM_FCFG1_PFSIZE(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_PFSIZE_SHIFT))&SIM_FCFG1_PFSIZE_MASK) /*!< SIM_FCFG1                               */
#define SIM_FCFG1_NVMSIZE_MASK                   (0x0FUL << SIM_FCFG1_NVMSIZE_SHIFT)                 /*!< SIM_FCFG1: NVMSIZE Mask                 */
#define SIM_FCFG1_NVMSIZE_SHIFT                  28                                                  /*!< SIM_FCFG1: NVMSIZE Position             */
#define SIM_FCFG1_NVMSIZE(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_NVMSIZE_SHIFT))&SIM_FCFG1_NVMSIZE_MASK) /*!< SIM_FCFG1                               */
/* ------- FCFG2 Bit Fields                         ------ */
#define SIM_FCFG2_MAXADDR23_MASK                 (0x3FUL << SIM_FCFG2_MAXADDR23_SHIFT)               /*!< SIM_FCFG2: MAXADDR23 Mask               */
#define SIM_FCFG2_MAXADDR23_SHIFT                16                                                  /*!< SIM_FCFG2: MAXADDR23 Position           */
#define SIM_FCFG2_MAXADDR23(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_FCFG2_MAXADDR23_SHIFT))&SIM_FCFG2_MAXADDR23_MASK) /*!< SIM_FCFG2                               */
#define SIM_FCFG2_MAXADDR01_MASK                 (0x3FUL << SIM_FCFG2_MAXADDR01_SHIFT)               /*!< SIM_FCFG2: MAXADDR01 Mask               */
#define SIM_FCFG2_MAXADDR01_SHIFT                24                                                  /*!< SIM_FCFG2: MAXADDR01 Position           */
#define SIM_FCFG2_MAXADDR01(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_FCFG2_MAXADDR01_SHIFT))&SIM_FCFG2_MAXADDR01_MASK) /*!< SIM_FCFG2                               */
/* ------- UIDH Bit Fields                          ------ */
#define SIM_UIDH_UID_MASK                        (0xFFFFFFFFUL << SIM_UIDH_UID_SHIFT)                /*!< SIM_UIDH: UID Mask                      */
#define SIM_UIDH_UID_SHIFT                       0                                                   /*!< SIM_UIDH: UID Position                  */
#define SIM_UIDH_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDH_UID_SHIFT))&SIM_UIDH_UID_MASK) /*!< SIM_UIDH                                */
