podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
 * @brief USB HS/FS/LS OTG Controller
 */
/**
* @addtogroup USBHS_structs_GROUP USBHS struct
* @brief Struct for USBHS
* @{
*/
typedef struct {                                /*       USBHS Structure                                              */
   __I  uint32_t  ID;                           /**< 0000: Identification Register                                      */
   __I  uint32_t  HWGENERAL;                    /**< 0004: General Hardware Parameters Register                         */
   __I  uint32_t  HWHOST;                       /**< 0008: Host Hardware Parameters Register                            */
   __I  uint32_t  HWDEVICE;                     /**< 000C: Device Hardware Parameters Register                          */
   __I  uint32_t  HWTXBUF;                      /**< 0010: Transmit Buffer Hardware Parameters Register                 */
   __I  uint32_t  HWRXBUF;                      /**< 0014: Receive Buffer Hardware Parameters Register                  */
   __I  uint32_t  RESERVED0[26];               
   __IO uint32_t  GPTIMER0LD;                   /**< 0080: General Purpose Timer n Load Register                        */
   __IO uint32_t  GPTIMER0CTL;                  /**< 0084: General Purpose Timer n Control Register                     */
   __IO uint32_t  GPTIMER1LD;                   /**< 0088: General Purpose Timer n Load Register                        */
   __IO uint32_t  GPTIMER1CTL;                  /**< 008C: General Purpose Timer n Control Register                     */
   __IO uint32_t  USB_SBUSCFG;                  /**< 0090: System Bus Interface Configuration Register                  */
   __I  uint32_t  RESERVED1[27];               
   __I  uint32_t  HCIVERSION;                   /**< 0100: Host Controller Interface Version and Capability Registers Length Register */
   __I  uint32_t  HCSPARAMS;                    /**< 0104: Host Controller Structural Parameters Register               */
   __I  uint32_t  HCCPARAMS;                    /**< 0108: Host Controller Capability Parameters Register               */
   __I  uint16_t  RESERVED2[11];               
   __I  uint16_t  DCIVERSION;                   /**< 0122: Device Controller Interface Version                          */
   __I  uint32_t  DCCPARAMS;                    /**< 0124: Device Controller Capability Parameters                      */
   __I  uint32_t  RESERVED3[6];                
   __IO uint32_t  USBCMD;                       /**< 0140: USB Command Register                                         */
   __IO uint32_t  USBSTS;                       /**< 0144: USB Status Register                                          */
   __IO uint32_t  USBINTR;                      /**< 0148: USB Interrupt Enable Register                                */
   __IO uint32_t  FRINDEX;                      /**< 014C: Frame Index Register                                         */
   __I  uint32_t  RESERVED4;                   
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  DEVICEADDR;                /**< 0154: Device Address Register                                      */
      __IO uint32_t  PERIODICLISTBASE;          /**< 0154: Periodic Frame List Base Address Register                    */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  ASYNCLISTADDR;             /**< 0158: Current Asynchronous List Address Register                   */
      __IO uint32_t  EPLISTADDR;                /**< 0158: Endpoint List Address Register                               */
   };
   __I  uint32_t  TTCTRL;                       /**< 015C: Host TT Asynchronous Buffer Control                          */
   __IO uint32_t  BURSTSIZE;                    /**< 0160: Master Interface Data Burst Size Register                    */
   __IO uint32_t  TXFILLTUNING;                 /**< 0164: Transmit FIFO Tuning Control Register                        */
   __I  uint32_t  RESERVED5[2];                
   __IO uint32_t  ULPI_VIEWPORT;                /**< 0170: ULPI Register Access                                         */
   __I  uint32_t  RESERVED6;                   
   __IO uint32_t  ENDPTNAK;                     /**< 0178: Endpoint NAK Register                                        */
   __IO uint32_t  ENDPTNAKEN;                   /**< 017C: Endpoint NAK Enable Register                                 */
   __I  uint32_t  CONFIGFLAG;                   /**< 0180: Configure Flag Register                                      */
   __IO uint32_t  PORTSC1;                      /**< 0184: Port Status and Control                                      */
   __I  uint32_t  RESERVED7[7];                
   __IO uint32_t  OTGSC;                        /**< 01A4: On-the-Go Status and Control Register                        */
   __IO uint32_t  USBMODE;                      /**< 01A8: USB Mode Register                                            */
   __IO uint32_t  EPSETUPSR;                    /**< 01AC: Endpoint Setup Status Register                               */
   __IO uint32_t  EPPRIME;                      /**< 01B0: Endpoint Initialization Register                             */
   __IO uint32_t  EPFLUSH;                      /**< 01B4: Endpoint Flush Register                                      */
   __I  uint32_t  EPSR;                         /**< 01B8: Endpoint Status Register                                     */
   __IO uint32_t  EPCOMPLETE;                   /**< 01BC: Endpoint Complete Register                                   */
   __IO uint32_t  EPCR0;                        /**< 01C0: Endpoint Control Register 0                                  */
   __IO uint32_t  EPCR1;                        /**< 01C4: Endpoint Control Register n                                  */
   __IO uint32_t  EPCR2;                        /**< 01C8: Endpoint Control Register n                                  */
   __IO uint32_t  EPCR3;                        /**< 01CC: Endpoint Control Register n                                  */
   __I  uint32_t  RESERVED8[12];               
   __IO uint32_t  USBGENCTRL;                   /**< 0200: USB General Control Register                                 */
} USBHS_Type;

/**
 * @} */ /* End group USBHS_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'USBHS' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

