podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
/**
* @addtogroup USBHS_Register_Masks_GROUP USBHS Register Masks
* @brief Register Masks for USBHS
* @{
*/
/* ------- ID Bit Fields                            ------ */
#define USBHS_ID_ID_MASK                         (0x3FUL << USBHS_ID_ID_SHIFT)                       /*!< USBHS_ID: ID Mask                       */
#define USBHS_ID_ID_SHIFT                        0                                                   /*!< USBHS_ID: ID Position                   */
#define USBHS_ID_ID(x)                           (((uint32_t)(((uint32_t)(x))<<USBHS_ID_ID_SHIFT))&USBHS_ID_ID_MASK) /*!< USBHS_ID                                */
#define USBHS_ID_NID_MASK                        (0x3FUL << USBHS_ID_NID_SHIFT)                      /*!< USBHS_ID: NID Mask                      */
#define USBHS_ID_NID_SHIFT                       8                                                   /*!< USBHS_ID: NID Position                  */
#define USBHS_ID_NID(x)                          (((uint32_t)(((uint32_t)(x))<<USBHS_ID_NID_SHIFT))&USBHS_ID_NID_MASK) /*!< USBHS_ID                                */
#define USBHS_ID_TAG_MASK                        (0x1FUL << USBHS_ID_TAG_SHIFT)                      /*!< USBHS_ID: TAG Mask                      */
#define USBHS_ID_TAG_SHIFT                       16                                                  /*!< USBHS_ID: TAG Position                  */
#define USBHS_ID_TAG(x)                          (((uint32_t)(((uint32_t)(x))<<USBHS_ID_TAG_SHIFT))&USBHS_ID_TAG_MASK) /*!< USBHS_ID                                */
#define USBHS_ID_REVISION_MASK                   (0x0FUL << USBHS_ID_REVISION_SHIFT)                 /*!< USBHS_ID: REVISION Mask                 */
#define USBHS_ID_REVISION_SHIFT                  21                                                  /*!< USBHS_ID: REVISION Position             */
#define USBHS_ID_REVISION(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_ID_REVISION_SHIFT))&USBHS_ID_REVISION_MASK) /*!< USBHS_ID                                */
#define USBHS_ID_VERSION_MASK                    (0x0FUL << USBHS_ID_VERSION_SHIFT)                  /*!< USBHS_ID: VERSION Mask                  */
#define USBHS_ID_VERSION_SHIFT                   25                                                  /*!< USBHS_ID: VERSION Position              */
#define USBHS_ID_VERSION(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_ID_VERSION_SHIFT))&USBHS_ID_VERSION_MASK) /*!< USBHS_ID                                */
#define USBHS_ID_VERSIONID_MASK                  (0x07UL << USBHS_ID_VERSIONID_SHIFT)                /*!< USBHS_ID: VERSIONID Mask                */
#define USBHS_ID_VERSIONID_SHIFT                 29                                                  /*!< USBHS_ID: VERSIONID Position            */
#define USBHS_ID_VERSIONID(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_ID_VERSIONID_SHIFT))&USBHS_ID_VERSIONID_MASK) /*!< USBHS_ID                                */
/* ------- HWGENERAL Bit Fields                     ------ */
#define USBHS_HWGENERAL_PHYM_MASK                (0x07UL << USBHS_HWGENERAL_PHYM_SHIFT)              /*!< USBHS_HWGENERAL: PHYM Mask              */
#define USBHS_HWGENERAL_PHYM_SHIFT               6                                                   /*!< USBHS_HWGENERAL: PHYM Position          */
#define USBHS_HWGENERAL_PHYM(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HWGENERAL_PHYM_SHIFT))&USBHS_HWGENERAL_PHYM_MASK) /*!< USBHS_HWGENERAL                         */
#define USBHS_HWGENERAL_SM_MASK                  (0x03UL << USBHS_HWGENERAL_SM_SHIFT)                /*!< USBHS_HWGENERAL: SM Mask                */
#define USBHS_HWGENERAL_SM_SHIFT                 9                                                   /*!< USBHS_HWGENERAL: SM Position            */
#define USBHS_HWGENERAL_SM(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWGENERAL_SM_SHIFT))&USBHS_HWGENERAL_SM_MASK) /*!< USBHS_HWGENERAL                         */
/* ------- HWHOST Bit Fields                        ------ */
#define USBHS_HWHOST_HC_MASK                     (0x01UL << USBHS_HWHOST_HC_SHIFT)                   /*!< USBHS_HWHOST: HC Mask                   */
#define USBHS_HWHOST_HC_SHIFT                    0                                                   /*!< USBHS_HWHOST: HC Position               */
#define USBHS_HWHOST_NPORT_MASK                  (0x07UL << USBHS_HWHOST_NPORT_SHIFT)                /*!< USBHS_HWHOST: NPORT Mask                */
#define USBHS_HWHOST_NPORT_SHIFT                 1                                                   /*!< USBHS_HWHOST: NPORT Position            */
#define USBHS_HWHOST_NPORT(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWHOST_NPORT_SHIFT))&USBHS_HWHOST_NPORT_MASK) /*!< USBHS_HWHOST                            */
#define USBHS_HWHOST_TTASY_MASK                  (0xFFUL << USBHS_HWHOST_TTASY_SHIFT)                /*!< USBHS_HWHOST: TTASY Mask                */
#define USBHS_HWHOST_TTASY_SHIFT                 16                                                  /*!< USBHS_HWHOST: TTASY Position            */
#define USBHS_HWHOST_TTASY(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWHOST_TTASY_SHIFT))&USBHS_HWHOST_TTASY_MASK) /*!< USBHS_HWHOST                            */
#define USBHS_HWHOST_TTPER_MASK                  (0xFFUL << USBHS_HWHOST_TTPER_SHIFT)                /*!< USBHS_HWHOST: TTPER Mask                */
#define USBHS_HWHOST_TTPER_SHIFT                 24                                                  /*!< USBHS_HWHOST: TTPER Position            */
#define USBHS_HWHOST_TTPER(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWHOST_TTPER_SHIFT))&USBHS_HWHOST_TTPER_MASK) /*!< USBHS_HWHOST                            */
/* ------- HWDEVICE Bit Fields                      ------ */
#define USBHS_HWDEVICE_DC_MASK                   (0x01UL << USBHS_HWDEVICE_DC_SHIFT)                 /*!< USBHS_HWDEVICE: DC Mask                 */
#define USBHS_HWDEVICE_DC_SHIFT                  0                                                   /*!< USBHS_HWDEVICE: DC Position             */
#define USBHS_HWDEVICE_DEVEP_MASK                (0x1FUL << USBHS_HWDEVICE_DEVEP_SHIFT)              /*!< USBHS_HWDEVICE: DEVEP Mask              */
#define USBHS_HWDEVICE_DEVEP_SHIFT               1                                                   /*!< USBHS_HWDEVICE: DEVEP Position          */
#define USBHS_HWDEVICE_DEVEP(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HWDEVICE_DEVEP_SHIFT))&USBHS_HWDEVICE_DEVEP_MASK) /*!< USBHS_HWDEVICE                          */
/* ------- HWTXBUF Bit Fields                       ------ */
#define USBHS_HWTXBUF_TXBURST_MASK               (0xFFUL << USBHS_HWTXBUF_TXBURST_SHIFT)             /*!< USBHS_HWTXBUF: TXBURST Mask             */
#define USBHS_HWTXBUF_TXBURST_SHIFT              0                                                   /*!< USBHS_HWTXBUF: TXBURST Position         */
#define USBHS_HWTXBUF_TXBURST(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_HWTXBUF_TXBURST_SHIFT))&USBHS_HWTXBUF_TXBURST_MASK) /*!< USBHS_HWTXBUF                           */
#define USBHS_HWTXBUF_TXADD_MASK                 (0xFFUL << USBHS_HWTXBUF_TXADD_SHIFT)               /*!< USBHS_HWTXBUF: TXADD Mask               */
#define USBHS_HWTXBUF_TXADD_SHIFT                8                                                   /*!< USBHS_HWTXBUF: TXADD Position           */
#define USBHS_HWTXBUF_TXADD(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HWTXBUF_TXADD_SHIFT))&USBHS_HWTXBUF_TXADD_MASK) /*!< USBHS_HWTXBUF                           */
#define USBHS_HWTXBUF_TXCHANADD_MASK             (0xFFUL << USBHS_HWTXBUF_TXCHANADD_SHIFT)           /*!< USBHS_HWTXBUF: TXCHANADD Mask           */
#define USBHS_HWTXBUF_TXCHANADD_SHIFT            16                                                  /*!< USBHS_HWTXBUF: TXCHANADD Position       */
#define USBHS_HWTXBUF_TXCHANADD(x)               (((uint32_t)(((uint32_t)(x))<<USBHS_HWTXBUF_TXCHANADD_SHIFT))&USBHS_HWTXBUF_TXCHANADD_MASK) /*!< USBHS_HWTXBUF                           */
#define USBHS_HWTXBUF_TXLC_MASK                  (0x01UL << USBHS_HWTXBUF_TXLC_SHIFT)                /*!< USBHS_HWTXBUF: TXLC Mask                */
#define USBHS_HWTXBUF_TXLC_SHIFT                 31                                                  /*!< USBHS_HWTXBUF: TXLC Position            */
/* ------- HWRXBUF Bit Fields                       ------ */
#define USBHS_HWRXBUF_RXBURST_MASK               (0xFFUL << USBHS_HWRXBUF_RXBURST_SHIFT)             /*!< USBHS_HWRXBUF: RXBURST Mask             */
#define USBHS_HWRXBUF_RXBURST_SHIFT              0                                                   /*!< USBHS_HWRXBUF: RXBURST Position         */
#define USBHS_HWRXBUF_RXBURST(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_HWRXBUF_RXBURST_SHIFT))&USBHS_HWRXBUF_RXBURST_MASK) /*!< USBHS_HWRXBUF                           */
#define USBHS_HWRXBUF_RXADD_MASK                 (0xFFUL << USBHS_HWRXBUF_RXADD_SHIFT)               /*!< USBHS_HWRXBUF: RXADD Mask               */
#define USBHS_HWRXBUF_RXADD_SHIFT                8                                                   /*!< USBHS_HWRXBUF: RXADD Position           */
#define USBHS_HWRXBUF_RXADD(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HWRXBUF_RXADD_SHIFT))&USBHS_HWRXBUF_RXADD_MASK) /*!< USBHS_HWRXBUF                           */
/* ------- GPTIMER0LD Bit Fields                    ------ */
#define USBHS_GPTIMER0LD_GPTLD_MASK              (0xFFFFFFUL << USBHS_GPTIMER0LD_GPTLD_SHIFT)        /*!< USBHS_GPTIMER0LD: GPTLD Mask            */
#define USBHS_GPTIMER0LD_GPTLD_SHIFT             0                                                   /*!< USBHS_GPTIMER0LD: GPTLD Position        */
#define USBHS_GPTIMER0LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER0LD_GPTLD_SHIFT))&USBHS_GPTIMER0LD_GPTLD_MASK) /*!< USBHS_GPTIMER0LD                        */
/* ------- GPTIMER0CTL Bit Fields                   ------ */
#define USBHS_GPTIMER0CTL_GPTCNT_MASK            (0xFFFFFFUL << USBHS_GPTIMER0CTL_GPTCNT_SHIFT)      /*!< USBHS_GPTIMER0CTL: GPTCNT Mask          */
#define USBHS_GPTIMER0CTL_GPTCNT_SHIFT           0                                                   /*!< USBHS_GPTIMER0CTL: GPTCNT Position      */
#define USBHS_GPTIMER0CTL_GPTCNT(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER0CTL_GPTCNT_SHIFT))&USBHS_GPTIMER0CTL_GPTCNT_MASK) /*!< USBHS_GPTIMER0CTL                       */
#define USBHS_GPTIMER0CTL_MODE_MASK              (0x01UL << USBHS_GPTIMER0CTL_MODE_SHIFT)            /*!< USBHS_GPTIMER0CTL: MODE Mask            */
#define USBHS_GPTIMER0CTL_MODE_SHIFT             24                                                  /*!< USBHS_GPTIMER0CTL: MODE Position        */
#define USBHS_GPTIMER0CTL_RST_MASK               (0x01UL << USBHS_GPTIMER0CTL_RST_SHIFT)             /*!< USBHS_GPTIMER0CTL: RST Mask             */
#define USBHS_GPTIMER0CTL_RST_SHIFT              30                                                  /*!< USBHS_GPTIMER0CTL: RST Position         */
#define USBHS_GPTIMER0CTL_RUN_MASK               (0x01UL << USBHS_GPTIMER0CTL_RUN_SHIFT)             /*!< USBHS_GPTIMER0CTL: RUN Mask             */
#define USBHS_GPTIMER0CTL_RUN_SHIFT              31                                                  /*!< USBHS_GPTIMER0CTL: RUN Position         */
/* ------- GPTIMER1LD Bit Fields                    ------ */
#define USBHS_GPTIMER1LD_GPTLD_MASK              (0xFFFFFFUL << USBHS_GPTIMER1LD_GPTLD_SHIFT)        /*!< USBHS_GPTIMER1LD: GPTLD Mask            */
#define USBHS_GPTIMER1LD_GPTLD_SHIFT             0                                                   /*!< USBHS_GPTIMER1LD: GPTLD Position        */
#define USBHS_GPTIMER1LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER1LD_GPTLD_SHIFT))&USBHS_GPTIMER1LD_GPTLD_MASK) /*!< USBHS_GPTIMER1LD                        */
/* ------- GPTIMER1CTL Bit Fields                   ------ */
#define USBHS_GPTIMER1CTL_GPTCNT_MASK            (0xFFFFFFUL << USBHS_GPTIMER1CTL_GPTCNT_SHIFT)      /*!< USBHS_GPTIMER1CTL: GPTCNT Mask          */
#define USBHS_GPTIMER1CTL_GPTCNT_SHIFT           0                                                   /*!< USBHS_GPTIMER1CTL: GPTCNT Position      */
#define USBHS_GPTIMER1CTL_GPTCNT(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER1CTL_GPTCNT_SHIFT))&USBHS_GPTIMER1CTL_GPTCNT_MASK) /*!< USBHS_GPTIMER1CTL                       */
#define USBHS_GPTIMER1CTL_MODE_MASK              (0x01UL << USBHS_GPTIMER1CTL_MODE_SHIFT)            /*!< USBHS_GPTIMER1CTL: MODE Mask            */
#define USBHS_GPTIMER1CTL_MODE_SHIFT             24                                                  /*!< USBHS_GPTIMER1CTL: MODE Position        */
#define USBHS_GPTIMER1CTL_RST_MASK               (0x01UL << USBHS_GPTIMER1CTL_RST_SHIFT)             /*!< USBHS_GPTIMER1CTL: RST Mask             */
#define USBHS_GPTIMER1CTL_RST_SHIFT              30                                                  /*!< USBHS_GPTIMER1CTL: RST Position         */
#define USBHS_GPTIMER1CTL_RUN_MASK               (0x01UL << USBHS_GPTIMER1CTL_RUN_SHIFT)             /*!< USBHS_GPTIMER1CTL: RUN Mask             */
#define USBHS_GPTIMER1CTL_RUN_SHIFT              31                                                  /*!< USBHS_GPTIMER1CTL: RUN Position         */
/* ------- USB_SBUSCFG Bit Fields                   ------ */
#define USBHS_USB_SBUSCFG_BURSTMODE_MASK         (0x07UL << USBHS_USB_SBUSCFG_BURSTMODE_SHIFT)       /*!< USBHS_USB_SBUSCFG: BURSTMODE Mask       */
#define USBHS_USB_SBUSCFG_BURSTMODE_SHIFT        0                                                   /*!< USBHS_USB_SBUSCFG: BURSTMODE Position   */
#define USBHS_USB_SBUSCFG_BURSTMODE(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_USB_SBUSCFG_BURSTMODE_SHIFT))&USBHS_USB_SBUSCFG_BURSTMODE_MASK) /*!< USBHS_USB_SBUSCFG                       */
/* ------- HCIVERSION Bit Fields                    ------ */
#define USBHS_HCIVERSION_CAPLENGTH_MASK          (0xFFUL << USBHS_HCIVERSION_CAPLENGTH_SHIFT)        /*!< USBHS_HCIVERSION: CAPLENGTH Mask        */
#define USBHS_HCIVERSION_CAPLENGTH_SHIFT         0                                                   /*!< USBHS_HCIVERSION: CAPLENGTH Position    */
#define USBHS_HCIVERSION_CAPLENGTH(x)            (((uint32_t)(((uint32_t)(x))<<USBHS_HCIVERSION_CAPLENGTH_SHIFT))&USBHS_HCIVERSION_CAPLENGTH_MASK) /*!< USBHS_HCIVERSION                        */
#define USBHS_HCIVERSION_HCIVERSION_MASK         (0xFFFFUL << USBHS_HCIVERSION_HCIVERSION_SHIFT)     /*!< USBHS_HCIVERSION: HCIVERSION Mask       */
#define USBHS_HCIVERSION_HCIVERSION_SHIFT        16                                                  /*!< USBHS_HCIVERSION: HCIVERSION Position   */
#define USBHS_HCIVERSION_HCIVERSION(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_HCIVERSION_HCIVERSION_SHIFT))&USBHS_HCIVERSION_HCIVERSION_MASK) /*!< USBHS_HCIVERSION                        */
/* ------- HCSPARAMS Bit Fields                     ------ */
#define USBHS_HCSPARAMS_N_PORTS_MASK             (0x0FUL << USBHS_HCSPARAMS_N_PORTS_SHIFT)           /*!< USBHS_HCSPARAMS: N_PORTS Mask           */
#define USBHS_HCSPARAMS_N_PORTS_SHIFT            0                                                   /*!< USBHS_HCSPARAMS: N_PORTS Position       */
#define USBHS_HCSPARAMS_N_PORTS(x)               (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_PORTS_SHIFT))&USBHS_HCSPARAMS_N_PORTS_MASK) /*!< USBHS_HCSPARAMS                         */
#define USBHS_HCSPARAMS_PPC_MASK                 (0x01UL << USBHS_HCSPARAMS_PPC_SHIFT)               /*!< USBHS_HCSPARAMS: PPC Mask               */
#define USBHS_HCSPARAMS_PPC_SHIFT                4                                                   /*!< USBHS_HCSPARAMS: PPC Position           */
#define USBHS_HCSPARAMS_N_PCC_MASK               (0x0FUL << USBHS_HCSPARAMS_N_PCC_SHIFT)             /*!< USBHS_HCSPARAMS: N_PCC Mask             */
#define USBHS_HCSPARAMS_N_PCC_SHIFT              8                                                   /*!< USBHS_HCSPARAMS: N_PCC Position         */
#define USBHS_HCSPARAMS_N_PCC(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_PCC_SHIFT))&USBHS_HCSPARAMS_N_PCC_MASK) /*!< USBHS_HCSPARAMS                         */
#define USBHS_HCSPARAMS_N_CC_MASK                (0x0FUL << USBHS_HCSPARAMS_N_CC_SHIFT)              /*!< USBHS_HCSPARAMS: N_CC Mask              */
#define USBHS_HCSPARAMS_N_CC_SHIFT               12                                                  /*!< USBHS_HCSPARAMS: N_CC Position          */
#define USBHS_HCSPARAMS_N_CC(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_CC_SHIFT))&USBHS_HCSPARAMS_N_CC_MASK) /*!< USBHS_HCSPARAMS                         */
#define USBHS_HCSPARAMS_PI_MASK                  (0x01UL << USBHS_HCSPARAMS_PI_SHIFT)                /*!< USBHS_HCSPARAMS: PI Mask                */
#define USBHS_HCSPARAMS_PI_SHIFT                 16                                                  /*!< USBHS_HCSPARAMS: PI Position            */
#define USBHS_HCSPARAMS_N_PTT_MASK               (0x0FUL << USBHS_HCSPARAMS_N_PTT_SHIFT)             /*!< USBHS_HCSPARAMS: N_PTT Mask             */
#define USBHS_HCSPARAMS_N_PTT_SHIFT              20                                                  /*!< USBHS_HCSPARAMS: N_PTT Position         */
#define USBHS_HCSPARAMS_N_PTT(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_PTT_SHIFT))&USBHS_HCSPARAMS_N_PTT_MASK) /*!< USBHS_HCSPARAMS                         */
#define USBHS_HCSPARAMS_N_TT_MASK                (0x0FUL << USBHS_HCSPARAMS_N_TT_SHIFT)              /*!< USBHS_HCSPARAMS: N_TT Mask              */
#define USBHS_HCSPARAMS_N_TT_SHIFT               24                                                  /*!< USBHS_HCSPARAMS: N_TT Position          */
#define USBHS_HCSPARAMS_N_TT(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_TT_SHIFT))&USBHS_HCSPARAMS_N_TT_MASK) /*!< USBHS_HCSPARAMS                         */
/* ------- HCCPARAMS Bit Fields                     ------ */
#define USBHS_HCCPARAMS_ADC_MASK                 (0x01UL << USBHS_HCCPARAMS_ADC_SHIFT)               /*!< USBHS_HCCPARAMS: ADC Mask               */
#define USBHS_HCCPARAMS_ADC_SHIFT                0                                                   /*!< USBHS_HCCPARAMS: ADC Position           */
#define USBHS_HCCPARAMS_PFL_MASK                 (0x01UL << USBHS_HCCPARAMS_PFL_SHIFT)               /*!< USBHS_HCCPARAMS: PFL Mask               */
#define USBHS_HCCPARAMS_PFL_SHIFT                1                                                   /*!< USBHS_HCCPARAMS: PFL Position           */
#define USBHS_HCCPARAMS_ASP_MASK                 (0x01UL << USBHS_HCCPARAMS_ASP_SHIFT)               /*!< USBHS_HCCPARAMS: ASP Mask               */
#define USBHS_HCCPARAMS_ASP_SHIFT                2                                                   /*!< USBHS_HCCPARAMS: ASP Position           */
#define USBHS_HCCPARAMS_IST_MASK                 (0x0FUL << USBHS_HCCPARAMS_IST_SHIFT)               /*!< USBHS_HCCPARAMS: IST Mask               */
#define USBHS_HCCPARAMS_IST_SHIFT                4                                                   /*!< USBHS_HCCPARAMS: IST Position           */
#define USBHS_HCCPARAMS_IST(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HCCPARAMS_IST_SHIFT))&USBHS_HCCPARAMS_IST_MASK) /*!< USBHS_HCCPARAMS                         */
#define USBHS_HCCPARAMS_EECP_MASK                (0xFFUL << USBHS_HCCPARAMS_EECP_SHIFT)              /*!< USBHS_HCCPARAMS: EECP Mask              */
#define USBHS_HCCPARAMS_EECP_SHIFT               8                                                   /*!< USBHS_HCCPARAMS: EECP Position          */
#define USBHS_HCCPARAMS_EECP(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HCCPARAMS_EECP_SHIFT))&USBHS_HCCPARAMS_EECP_MASK) /*!< USBHS_HCCPARAMS                         */
/* ------- DCIVERSION Bit Fields                    ------ */
#define USBHS_DCIVERSION_DCIVERSION_MASK         (0xFFFFUL << USBHS_DCIVERSION_DCIVERSION_SHIFT)     /*!< USBHS_DCIVERSION: DCIVERSION Mask       */
#define USBHS_DCIVERSION_DCIVERSION_SHIFT        0                                                   /*!< USBHS_DCIVERSION: DCIVERSION Position   */
#define USBHS_DCIVERSION_DCIVERSION(x)           (((uint16_t)(((uint16_t)(x))<<USBHS_DCIVERSION_DCIVERSION_SHIFT))&USBHS_DCIVERSION_DCIVERSION_MASK) /*!< USBHS_DCIVERSION                        */
/* ------- DCCPARAMS Bit Fields                     ------ */
#define USBHS_DCCPARAMS_DEN_MASK                 (0x1FUL << USBHS_DCCPARAMS_DEN_SHIFT)               /*!< USBHS_DCCPARAMS: DEN Mask               */
#define USBHS_DCCPARAMS_DEN_SHIFT                0                                                   /*!< USBHS_DCCPARAMS: DEN Position           */
#define USBHS_DCCPARAMS_DEN(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_DCCPARAMS_DEN_SHIFT))&USBHS_DCCPARAMS_DEN_MASK) /*!< USBHS_DCCPARAMS                         */
#define USBHS_DCCPARAMS_DC_MASK                  (0x01UL << USBHS_DCCPARAMS_DC_SHIFT)                /*!< USBHS_DCCPARAMS: DC Mask                */
#define USBHS_DCCPARAMS_DC_SHIFT                 7                                                   /*!< USBHS_DCCPARAMS: DC Position            */
#define USBHS_DCCPARAMS_HC_MASK                  (0x01UL << USBHS_DCCPARAMS_HC_SHIFT)                /*!< USBHS_DCCPARAMS: HC Mask                */
#define USBHS_DCCPARAMS_HC_SHIFT                 8                                                   /*!< USBHS_DCCPARAMS: HC Position            */
/* ------- USBCMD Bit Fields                        ------ */
#define USBHS_USBCMD_RS_MASK                     (0x01UL << USBHS_USBCMD_RS_SHIFT)                   /*!< USBHS_USBCMD: RS Mask                   */
#define USBHS_USBCMD_RS_SHIFT                    0                                                   /*!< USBHS_USBCMD: RS Position               */
#define USBHS_USBCMD_RST_MASK                    (0x01UL << USBHS_USBCMD_RST_SHIFT)                  /*!< USBHS_USBCMD: RST Mask                  */
#define USBHS_USBCMD_RST_SHIFT                   1                                                   /*!< USBHS_USBCMD: RST Position              */
#define USBHS_USBCMD_FS_MASK                     (0x03UL << USBHS_USBCMD_FS_SHIFT)                   /*!< USBHS_USBCMD: FS Mask                   */
#define USBHS_USBCMD_FS_SHIFT                    2                                                   /*!< USBHS_USBCMD: FS Position               */
#define USBHS_USBCMD_FS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_FS_SHIFT))&USBHS_USBCMD_FS_MASK) /*!< USBHS_USBCMD                            */
#define USBHS_USBCMD_PSE_MASK                    (0x01UL << USBHS_USBCMD_PSE_SHIFT)                  /*!< USBHS_USBCMD: PSE Mask                  */
#define USBHS_USBCMD_PSE_SHIFT                   4                                                   /*!< USBHS_USBCMD: PSE Position              */
#define USBHS_USBCMD_ASE_MASK                    (0x01UL << USBHS_USBCMD_ASE_SHIFT)                  /*!< USBHS_USBCMD: ASE Mask                  */
#define USBHS_USBCMD_ASE_SHIFT                   5                                                   /*!< USBHS_USBCMD: ASE Position              */
#define USBHS_USBCMD_IAA_MASK                    (0x01UL << USBHS_USBCMD_IAA_SHIFT)                  /*!< USBHS_USBCMD: IAA Mask                  */
#define USBHS_USBCMD_IAA_SHIFT                   6                                                   /*!< USBHS_USBCMD: IAA Position              */
#define USBHS_USBCMD_ASP_MASK                    (0x03UL << USBHS_USBCMD_ASP_SHIFT)                  /*!< USBHS_USBCMD: ASP Mask                  */
