podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define USBHS_USBCMD_ASP_SHIFT                   8                                                   /*!< USBHS_USBCMD: ASP Position              */
#define USBHS_USBCMD_ASP(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_ASP_SHIFT))&USBHS_USBCMD_ASP_MASK) /*!< USBHS_USBCMD                            */
#define USBHS_USBCMD_ASPE_MASK                   (0x01UL << USBHS_USBCMD_ASPE_SHIFT)                 /*!< USBHS_USBCMD: ASPE Mask                 */
#define USBHS_USBCMD_ASPE_SHIFT                  11                                                  /*!< USBHS_USBCMD: ASPE Position             */
#define USBHS_USBCMD_SUTW_MASK                   (0x01UL << USBHS_USBCMD_SUTW_SHIFT)                 /*!< USBHS_USBCMD: SUTW Mask                 */
#define USBHS_USBCMD_SUTW_SHIFT                  13                                                  /*!< USBHS_USBCMD: SUTW Position             */
#define USBHS_USBCMD_ATDTW_MASK                  (0x01UL << USBHS_USBCMD_ATDTW_SHIFT)                /*!< USBHS_USBCMD: ATDTW Mask                */
#define USBHS_USBCMD_ATDTW_SHIFT                 14                                                  /*!< USBHS_USBCMD: ATDTW Position            */
#define USBHS_USBCMD_FS2_MASK                    (0x01UL << USBHS_USBCMD_FS2_SHIFT)                  /*!< USBHS_USBCMD: FS2 Mask                  */
#define USBHS_USBCMD_FS2_SHIFT                   15                                                  /*!< USBHS_USBCMD: FS2 Position              */
#define USBHS_USBCMD_ITC_MASK                    (0xFFUL << USBHS_USBCMD_ITC_SHIFT)                  /*!< USBHS_USBCMD: ITC Mask                  */
#define USBHS_USBCMD_ITC_SHIFT                   16                                                  /*!< USBHS_USBCMD: ITC Position              */
#define USBHS_USBCMD_ITC(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_ITC_SHIFT))&USBHS_USBCMD_ITC_MASK) /*!< USBHS_USBCMD                            */
/* ------- USBSTS Bit Fields                        ------ */
#define USBHS_USBSTS_UI_MASK                     (0x01UL << USBHS_USBSTS_UI_SHIFT)                   /*!< USBHS_USBSTS: UI Mask                   */
#define USBHS_USBSTS_UI_SHIFT                    0                                                   /*!< USBHS_USBSTS: UI Position               */
#define USBHS_USBSTS_UEI_MASK                    (0x01UL << USBHS_USBSTS_UEI_SHIFT)                  /*!< USBHS_USBSTS: UEI Mask                  */
#define USBHS_USBSTS_UEI_SHIFT                   1                                                   /*!< USBHS_USBSTS: UEI Position              */
#define USBHS_USBSTS_PCI_MASK                    (0x01UL << USBHS_USBSTS_PCI_SHIFT)                  /*!< USBHS_USBSTS: PCI Mask                  */
#define USBHS_USBSTS_PCI_SHIFT                   2                                                   /*!< USBHS_USBSTS: PCI Position              */
#define USBHS_USBSTS_FRI_MASK                    (0x01UL << USBHS_USBSTS_FRI_SHIFT)                  /*!< USBHS_USBSTS: FRI Mask                  */
#define USBHS_USBSTS_FRI_SHIFT                   3                                                   /*!< USBHS_USBSTS: FRI Position              */
#define USBHS_USBSTS_SEI_MASK                    (0x01UL << USBHS_USBSTS_SEI_SHIFT)                  /*!< USBHS_USBSTS: SEI Mask                  */
#define USBHS_USBSTS_SEI_SHIFT                   4                                                   /*!< USBHS_USBSTS: SEI Position              */
#define USBHS_USBSTS_AAI_MASK                    (0x01UL << USBHS_USBSTS_AAI_SHIFT)                  /*!< USBHS_USBSTS: AAI Mask                  */
#define USBHS_USBSTS_AAI_SHIFT                   5                                                   /*!< USBHS_USBSTS: AAI Position              */
#define USBHS_USBSTS_URI_MASK                    (0x01UL << USBHS_USBSTS_URI_SHIFT)                  /*!< USBHS_USBSTS: URI Mask                  */
#define USBHS_USBSTS_URI_SHIFT                   6                                                   /*!< USBHS_USBSTS: URI Position              */
#define USBHS_USBSTS_SRI_MASK                    (0x01UL << USBHS_USBSTS_SRI_SHIFT)                  /*!< USBHS_USBSTS: SRI Mask                  */
#define USBHS_USBSTS_SRI_SHIFT                   7                                                   /*!< USBHS_USBSTS: SRI Position              */
#define USBHS_USBSTS_SLI_MASK                    (0x01UL << USBHS_USBSTS_SLI_SHIFT)                  /*!< USBHS_USBSTS: SLI Mask                  */
#define USBHS_USBSTS_SLI_SHIFT                   8                                                   /*!< USBHS_USBSTS: SLI Position              */
#define USBHS_USBSTS_ULPII_MASK                  (0x01UL << USBHS_USBSTS_ULPII_SHIFT)                /*!< USBHS_USBSTS: ULPII Mask                */
#define USBHS_USBSTS_ULPII_SHIFT                 10                                                  /*!< USBHS_USBSTS: ULPII Position            */
#define USBHS_USBSTS_HCH_MASK                    (0x01UL << USBHS_USBSTS_HCH_SHIFT)                  /*!< USBHS_USBSTS: HCH Mask                  */
#define USBHS_USBSTS_HCH_SHIFT                   12                                                  /*!< USBHS_USBSTS: HCH Position              */
#define USBHS_USBSTS_RCL_MASK                    (0x01UL << USBHS_USBSTS_RCL_SHIFT)                  /*!< USBHS_USBSTS: RCL Mask                  */
#define USBHS_USBSTS_RCL_SHIFT                   13                                                  /*!< USBHS_USBSTS: RCL Position              */
#define USBHS_USBSTS_PS_MASK                     (0x01UL << USBHS_USBSTS_PS_SHIFT)                   /*!< USBHS_USBSTS: PS Mask                   */
#define USBHS_USBSTS_PS_SHIFT                    14                                                  /*!< USBHS_USBSTS: PS Position               */
#define USBHS_USBSTS_AS_MASK                     (0x01UL << USBHS_USBSTS_AS_SHIFT)                   /*!< USBHS_USBSTS: AS Mask                   */
#define USBHS_USBSTS_AS_SHIFT                    15                                                  /*!< USBHS_USBSTS: AS Position               */
#define USBHS_USBSTS_NAKI_MASK                   (0x01UL << USBHS_USBSTS_NAKI_SHIFT)                 /*!< USBHS_USBSTS: NAKI Mask                 */
#define USBHS_USBSTS_NAKI_SHIFT                  16                                                  /*!< USBHS_USBSTS: NAKI Position             */
#define USBHS_USBSTS_UAI_MASK                    (0x01UL << USBHS_USBSTS_UAI_SHIFT)                  /*!< USBHS_USBSTS: UAI Mask                  */
#define USBHS_USBSTS_UAI_SHIFT                   18                                                  /*!< USBHS_USBSTS: UAI Position              */
#define USBHS_USBSTS_UPI_MASK                    (0x01UL << USBHS_USBSTS_UPI_SHIFT)                  /*!< USBHS_USBSTS: UPI Mask                  */
#define USBHS_USBSTS_UPI_SHIFT                   19                                                  /*!< USBHS_USBSTS: UPI Position              */
#define USBHS_USBSTS_TI0_MASK                    (0x01UL << USBHS_USBSTS_TI0_SHIFT)                  /*!< USBHS_USBSTS: TI0 Mask                  */
#define USBHS_USBSTS_TI0_SHIFT                   24                                                  /*!< USBHS_USBSTS: TI0 Position              */
#define USBHS_USBSTS_TI1_MASK                    (0x01UL << USBHS_USBSTS_TI1_SHIFT)                  /*!< USBHS_USBSTS: TI1 Mask                  */
#define USBHS_USBSTS_TI1_SHIFT                   25                                                  /*!< USBHS_USBSTS: TI1 Position              */
/* ------- USBINTR Bit Fields                       ------ */
#define USBHS_USBINTR_UE_MASK                    (0x01UL << USBHS_USBINTR_UE_SHIFT)                  /*!< USBHS_USBINTR: UE Mask                  */
#define USBHS_USBINTR_UE_SHIFT                   0                                                   /*!< USBHS_USBINTR: UE Position              */
#define USBHS_USBINTR_UEE_MASK                   (0x01UL << USBHS_USBINTR_UEE_SHIFT)                 /*!< USBHS_USBINTR: UEE Mask                 */
#define USBHS_USBINTR_UEE_SHIFT                  1                                                   /*!< USBHS_USBINTR: UEE Position             */
#define USBHS_USBINTR_PCE_MASK                   (0x01UL << USBHS_USBINTR_PCE_SHIFT)                 /*!< USBHS_USBINTR: PCE Mask                 */
#define USBHS_USBINTR_PCE_SHIFT                  2                                                   /*!< USBHS_USBINTR: PCE Position             */
#define USBHS_USBINTR_FRE_MASK                   (0x01UL << USBHS_USBINTR_FRE_SHIFT)                 /*!< USBHS_USBINTR: FRE Mask                 */
#define USBHS_USBINTR_FRE_SHIFT                  3                                                   /*!< USBHS_USBINTR: FRE Position             */
#define USBHS_USBINTR_SEE_MASK                   (0x01UL << USBHS_USBINTR_SEE_SHIFT)                 /*!< USBHS_USBINTR: SEE Mask                 */
#define USBHS_USBINTR_SEE_SHIFT                  4                                                   /*!< USBHS_USBINTR: SEE Position             */
#define USBHS_USBINTR_AAE_MASK                   (0x01UL << USBHS_USBINTR_AAE_SHIFT)                 /*!< USBHS_USBINTR: AAE Mask                 */
#define USBHS_USBINTR_AAE_SHIFT                  5                                                   /*!< USBHS_USBINTR: AAE Position             */
#define USBHS_USBINTR_URE_MASK                   (0x01UL << USBHS_USBINTR_URE_SHIFT)                 /*!< USBHS_USBINTR: URE Mask                 */
#define USBHS_USBINTR_URE_SHIFT                  6                                                   /*!< USBHS_USBINTR: URE Position             */
#define USBHS_USBINTR_SRE_MASK                   (0x01UL << USBHS_USBINTR_SRE_SHIFT)                 /*!< USBHS_USBINTR: SRE Mask                 */
#define USBHS_USBINTR_SRE_SHIFT                  7                                                   /*!< USBHS_USBINTR: SRE Position             */
#define USBHS_USBINTR_SLE_MASK                   (0x01UL << USBHS_USBINTR_SLE_SHIFT)                 /*!< USBHS_USBINTR: SLE Mask                 */
#define USBHS_USBINTR_SLE_SHIFT                  8                                                   /*!< USBHS_USBINTR: SLE Position             */
#define USBHS_USBINTR_ULPIE_MASK                 (0x01UL << USBHS_USBINTR_ULPIE_SHIFT)               /*!< USBHS_USBINTR: ULPIE Mask               */
#define USBHS_USBINTR_ULPIE_SHIFT                10                                                  /*!< USBHS_USBINTR: ULPIE Position           */
#define USBHS_USBINTR_NAKE_MASK                  (0x01UL << USBHS_USBINTR_NAKE_SHIFT)                /*!< USBHS_USBINTR: NAKE Mask                */
#define USBHS_USBINTR_NAKE_SHIFT                 16                                                  /*!< USBHS_USBINTR: NAKE Position            */
#define USBHS_USBINTR_UAIE_MASK                  (0x01UL << USBHS_USBINTR_UAIE_SHIFT)                /*!< USBHS_USBINTR: UAIE Mask                */
#define USBHS_USBINTR_UAIE_SHIFT                 18                                                  /*!< USBHS_USBINTR: UAIE Position            */
#define USBHS_USBINTR_UPIE_MASK                  (0x01UL << USBHS_USBINTR_UPIE_SHIFT)                /*!< USBHS_USBINTR: UPIE Mask                */
#define USBHS_USBINTR_UPIE_SHIFT                 19                                                  /*!< USBHS_USBINTR: UPIE Position            */
#define USBHS_USBINTR_TIE0_MASK                  (0x01UL << USBHS_USBINTR_TIE0_SHIFT)                /*!< USBHS_USBINTR: TIE0 Mask                */
#define USBHS_USBINTR_TIE0_SHIFT                 24                                                  /*!< USBHS_USBINTR: TIE0 Position            */
#define USBHS_USBINTR_TIE1_MASK                  (0x01UL << USBHS_USBINTR_TIE1_SHIFT)                /*!< USBHS_USBINTR: TIE1 Mask                */
#define USBHS_USBINTR_TIE1_SHIFT                 25                                                  /*!< USBHS_USBINTR: TIE1 Position            */
/* ------- FRINDEX Bit Fields                       ------ */
#define USBHS_FRINDEX_FRINDEX_MASK               (0x3FFFUL << USBHS_FRINDEX_FRINDEX_SHIFT)           /*!< USBHS_FRINDEX: FRINDEX Mask             */
#define USBHS_FRINDEX_FRINDEX_SHIFT              0                                                   /*!< USBHS_FRINDEX: FRINDEX Position         */
#define USBHS_FRINDEX_FRINDEX(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_FRINDEX_FRINDEX_SHIFT))&USBHS_FRINDEX_FRINDEX_MASK) /*!< USBHS_FRINDEX                           */
#define USBHS_FRINDEX_Reerved_MASK               (0x3FFFFUL << USBHS_FRINDEX_Reerved_SHIFT)          /*!< USBHS_FRINDEX: Reerved Mask             */
#define USBHS_FRINDEX_Reerved_SHIFT              14                                                  /*!< USBHS_FRINDEX: Reerved Position         */
#define USBHS_FRINDEX_Reerved(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_FRINDEX_Reerved_SHIFT))&USBHS_FRINDEX_Reerved_MASK) /*!< USBHS_FRINDEX                           */
/* ------- DEVICEADDR Bit Fields                    ------ */
#define USBHS_DEVICEADDR_USBADRA_MASK            (0x01UL << USBHS_DEVICEADDR_USBADRA_SHIFT)          /*!< USBHS_DEVICEADDR: USBADRA Mask          */
#define USBHS_DEVICEADDR_USBADRA_SHIFT           24                                                  /*!< USBHS_DEVICEADDR: USBADRA Position      */
#define USBHS_DEVICEADDR_USBADR_MASK             (0x7FUL << USBHS_DEVICEADDR_USBADR_SHIFT)           /*!< USBHS_DEVICEADDR: USBADR Mask           */
#define USBHS_DEVICEADDR_USBADR_SHIFT            25                                                  /*!< USBHS_DEVICEADDR: USBADR Position       */
#define USBHS_DEVICEADDR_USBADR(x)               (((uint32_t)(((uint32_t)(x))<<USBHS_DEVICEADDR_USBADR_SHIFT))&USBHS_DEVICEADDR_USBADR_MASK) /*!< USBHS_DEVICEADDR                        */
/* ------- PERIODICLISTBASE Bit Fields              ------ */
#define USBHS_PERIODICLISTBASE_PERBASE_MASK      (0xFFFFFUL << USBHS_PERIODICLISTBASE_PERBASE_SHIFT) /*!< USBHS_PERIODICLISTBASE: PERBASE Mask    */
#define USBHS_PERIODICLISTBASE_PERBASE_SHIFT     12                                                  /*!< USBHS_PERIODICLISTBASE: PERBASE Position*/
#define USBHS_PERIODICLISTBASE_PERBASE(x)        (((uint32_t)(((uint32_t)(x))<<USBHS_PERIODICLISTBASE_PERBASE_SHIFT))&USBHS_PERIODICLISTBASE_PERBASE_MASK) /*!< USBHS_PERIODICLISTBASE                  */
/* ------- ASYNCLISTADDR Bit Fields                 ------ */
#define USBHS_ASYNCLISTADDR_ASYBASE_MASK         (0x7FFFFFFUL << USBHS_ASYNCLISTADDR_ASYBASE_SHIFT)  /*!< USBHS_ASYNCLISTADDR: ASYBASE Mask       */
#define USBHS_ASYNCLISTADDR_ASYBASE_SHIFT        5                                                   /*!< USBHS_ASYNCLISTADDR: ASYBASE Position   */
#define USBHS_ASYNCLISTADDR_ASYBASE(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_ASYNCLISTADDR_ASYBASE_SHIFT))&USBHS_ASYNCLISTADDR_ASYBASE_MASK) /*!< USBHS_ASYNCLISTADDR                     */
/* ------- EPLISTADDR Bit Fields                    ------ */
#define USBHS_EPLISTADDR_EPBASE_MASK             (0x1FFFFFUL << USBHS_EPLISTADDR_EPBASE_SHIFT)       /*!< USBHS_EPLISTADDR: EPBASE Mask           */
#define USBHS_EPLISTADDR_EPBASE_SHIFT            11                                                  /*!< USBHS_EPLISTADDR: EPBASE Position       */
#define USBHS_EPLISTADDR_EPBASE(x)               (((uint32_t)(((uint32_t)(x))<<USBHS_EPLISTADDR_EPBASE_SHIFT))&USBHS_EPLISTADDR_EPBASE_MASK) /*!< USBHS_EPLISTADDR                        */
/* ------- TTCTRL Bit Fields                        ------ */
#define USBHS_TTCTRL_TTHA_MASK                   (0x7FUL << USBHS_TTCTRL_TTHA_SHIFT)                 /*!< USBHS_TTCTRL: TTHA Mask                 */
#define USBHS_TTCTRL_TTHA_SHIFT                  24                                                  /*!< USBHS_TTCTRL: TTHA Position             */
#define USBHS_TTCTRL_TTHA(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_TTCTRL_TTHA_SHIFT))&USBHS_TTCTRL_TTHA_MASK) /*!< USBHS_TTCTRL                            */
#define USBHS_TTCTRL_Reerved_MASK                (0x01UL << USBHS_TTCTRL_Reerved_SHIFT)              /*!< USBHS_TTCTRL: Reerved Mask              */
#define USBHS_TTCTRL_Reerved_SHIFT               31                                                  /*!< USBHS_TTCTRL: Reerved Position          */
/* ------- BURSTSIZE Bit Fields                     ------ */
#define USBHS_BURSTSIZE_RXPBURST_MASK            (0xFFUL << USBHS_BURSTSIZE_RXPBURST_SHIFT)          /*!< USBHS_BURSTSIZE: RXPBURST Mask          */
#define USBHS_BURSTSIZE_RXPBURST_SHIFT           0                                                   /*!< USBHS_BURSTSIZE: RXPBURST Position      */
#define USBHS_BURSTSIZE_RXPBURST(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_BURSTSIZE_RXPBURST_SHIFT))&USBHS_BURSTSIZE_RXPBURST_MASK) /*!< USBHS_BURSTSIZE                         */
#define USBHS_BURSTSIZE_TXPBURST_MASK            (0xFFUL << USBHS_BURSTSIZE_TXPBURST_SHIFT)          /*!< USBHS_BURSTSIZE: TXPBURST Mask          */
#define USBHS_BURSTSIZE_TXPBURST_SHIFT           8                                                   /*!< USBHS_BURSTSIZE: TXPBURST Position      */
#define USBHS_BURSTSIZE_TXPBURST(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_BURSTSIZE_TXPBURST_SHIFT))&USBHS_BURSTSIZE_TXPBURST_MASK) /*!< USBHS_BURSTSIZE                         */
/* ------- TXFILLTUNING Bit Fields                  ------ */
#define USBHS_TXFILLTUNING_TXSCHOH_MASK          (0x7FUL << USBHS_TXFILLTUNING_TXSCHOH_SHIFT)        /*!< USBHS_TXFILLTUNING: TXSCHOH Mask        */
#define USBHS_TXFILLTUNING_TXSCHOH_SHIFT         0                                                   /*!< USBHS_TXFILLTUNING: TXSCHOH Position    */
#define USBHS_TXFILLTUNING_TXSCHOH(x)            (((uint32_t)(((uint32_t)(x))<<USBHS_TXFILLTUNING_TXSCHOH_SHIFT))&USBHS_TXFILLTUNING_TXSCHOH_MASK) /*!< USBHS_TXFILLTUNING                      */
#define USBHS_TXFILLTUNING_TXSCHHEALTH_MASK      (0x1FUL << USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT)    /*!< USBHS_TXFILLTUNING: TXSCHHEALTH Mask    */
#define USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT     8                                                   /*!< USBHS_TXFILLTUNING: TXSCHHEALTH Position*/
#define USBHS_TXFILLTUNING_TXSCHHEALTH(x)        (((uint32_t)(((uint32_t)(x))<<USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT))&USBHS_TXFILLTUNING_TXSCHHEALTH_MASK) /*!< USBHS_TXFILLTUNING                      */
#define USBHS_TXFILLTUNING_TXFIFOTHRES_MASK      (0x3FUL << USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT)    /*!< USBHS_TXFILLTUNING: TXFIFOTHRES Mask    */
#define USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT     16                                                  /*!< USBHS_TXFILLTUNING: TXFIFOTHRES Position*/
#define USBHS_TXFILLTUNING_TXFIFOTHRES(x)        (((uint32_t)(((uint32_t)(x))<<USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT))&USBHS_TXFILLTUNING_TXFIFOTHRES_MASK) /*!< USBHS_TXFILLTUNING                      */
/* ------- ULPI_VIEWPORT Bit Fields                 ------ */
#define USBHS_ULPI_VIEWPORT_ULPI_DATWR_MASK      (0xFFUL << USBHS_ULPI_VIEWPORT_ULPI_DATWR_SHIFT)    /*!< USBHS_ULPI_VIEWPORT: ULPI_DATWR Mask    */
#define USBHS_ULPI_VIEWPORT_ULPI_DATWR_SHIFT     0                                                   /*!< USBHS_ULPI_VIEWPORT: ULPI_DATWR Position*/
#define USBHS_ULPI_VIEWPORT_ULPI_DATWR(x)        (((uint32_t)(((uint32_t)(x))<<USBHS_ULPI_VIEWPORT_ULPI_DATWR_SHIFT))&USBHS_ULPI_VIEWPORT_ULPI_DATWR_MASK) /*!< USBHS_ULPI_VIEWPORT                     */
#define USBHS_ULPI_VIEWPORT_ULPI_DATRD_MASK      (0xFFUL << USBHS_ULPI_VIEWPORT_ULPI_DATRD_SHIFT)    /*!< USBHS_ULPI_VIEWPORT: ULPI_DATRD Mask    */
#define USBHS_ULPI_VIEWPORT_ULPI_DATRD_SHIFT     8                                                   /*!< USBHS_ULPI_VIEWPORT: ULPI_DATRD Position*/
#define USBHS_ULPI_VIEWPORT_ULPI_DATRD(x)        (((uint32_t)(((uint32_t)(x))<<USBHS_ULPI_VIEWPORT_ULPI_DATRD_SHIFT))&USBHS_ULPI_VIEWPORT_ULPI_DATRD_MASK) /*!< USBHS_ULPI_VIEWPORT                     */
#define USBHS_ULPI_VIEWPORT_ULPI_ADDR_MASK       (0xFFUL << USBHS_ULPI_VIEWPORT_ULPI_ADDR_SHIFT)     /*!< USBHS_ULPI_VIEWPORT: ULPI_ADDR Mask     */
#define USBHS_ULPI_VIEWPORT_ULPI_ADDR_SHIFT      16                                                  /*!< USBHS_ULPI_VIEWPORT: ULPI_ADDR Position */
#define USBHS_ULPI_VIEWPORT_ULPI_ADDR(x)         (((uint32_t)(((uint32_t)(x))<<USBHS_ULPI_VIEWPORT_ULPI_ADDR_SHIFT))&USBHS_ULPI_VIEWPORT_ULPI_ADDR_MASK) /*!< USBHS_ULPI_VIEWPORT                     */
#define USBHS_ULPI_VIEWPORT_ULPI_PORT_MASK       (0x07UL << USBHS_ULPI_VIEWPORT_ULPI_PORT_SHIFT)     /*!< USBHS_ULPI_VIEWPORT: ULPI_PORT Mask     */
#define USBHS_ULPI_VIEWPORT_ULPI_PORT_SHIFT      24                                                  /*!< USBHS_ULPI_VIEWPORT: ULPI_PORT Position */
#define USBHS_ULPI_VIEWPORT_ULPI_PORT(x)         (((uint32_t)(((uint32_t)(x))<<USBHS_ULPI_VIEWPORT_ULPI_PORT_SHIFT))&USBHS_ULPI_VIEWPORT_ULPI_PORT_MASK) /*!< USBHS_ULPI_VIEWPORT                     */
#define USBHS_ULPI_VIEWPORT_ULPI_SS_MASK         (0x01UL << USBHS_ULPI_VIEWPORT_ULPI_SS_SHIFT)       /*!< USBHS_ULPI_VIEWPORT: ULPI_SS Mask       */
#define USBHS_ULPI_VIEWPORT_ULPI_SS_SHIFT        27                                                  /*!< USBHS_ULPI_VIEWPORT: ULPI_SS Position   */
#define USBHS_ULPI_VIEWPORT_ULPI_RW_MASK         (0x01UL << USBHS_ULPI_VIEWPORT_ULPI_RW_SHIFT)       /*!< USBHS_ULPI_VIEWPORT: ULPI_RW Mask       */
#define USBHS_ULPI_VIEWPORT_ULPI_RW_SHIFT        29                                                  /*!< USBHS_ULPI_VIEWPORT: ULPI_RW Position   */
#define USBHS_ULPI_VIEWPORT_ULPI_RUN_MASK        (0x01UL << USBHS_ULPI_VIEWPORT_ULPI_RUN_SHIFT)      /*!< USBHS_ULPI_VIEWPORT: ULPI_RUN Mask      */
#define USBHS_ULPI_VIEWPORT_ULPI_RUN_SHIFT       30                                                  /*!< USBHS_ULPI_VIEWPORT: ULPI_RUN Position  */
#define USBHS_ULPI_VIEWPORT_ULPI_WU_MASK         (0x01UL << USBHS_ULPI_VIEWPORT_ULPI_WU_SHIFT)       /*!< USBHS_ULPI_VIEWPORT: ULPI_WU Mask       */
#define USBHS_ULPI_VIEWPORT_ULPI_WU_SHIFT        31                                                  /*!< USBHS_ULPI_VIEWPORT: ULPI_WU Position   */
/* ------- ENDPTNAK Bit Fields                      ------ */
#define USBHS_ENDPTNAK_EPRN_MASK                 (0x0FUL << USBHS_ENDPTNAK_EPRN_SHIFT)               /*!< USBHS_ENDPTNAK: EPRN Mask               */
#define USBHS_ENDPTNAK_EPRN_SHIFT                0                                                   /*!< USBHS_ENDPTNAK: EPRN Position           */
#define USBHS_ENDPTNAK_EPRN(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_ENDPTNAK_EPRN_SHIFT))&USBHS_ENDPTNAK_EPRN_MASK) /*!< USBHS_ENDPTNAK                          */
#define USBHS_ENDPTNAK_EPTN_MASK                 (0x0FUL << USBHS_ENDPTNAK_EPTN_SHIFT)               /*!< USBHS_ENDPTNAK: EPTN Mask               */
#define USBHS_ENDPTNAK_EPTN_SHIFT                16                                                  /*!< USBHS_ENDPTNAK: EPTN Position           */
#define USBHS_ENDPTNAK_EPTN(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_ENDPTNAK_EPTN_SHIFT))&USBHS_ENDPTNAK_EPTN_MASK) /*!< USBHS_ENDPTNAK                          */
/* ------- ENDPTNAKEN Bit Fields                    ------ */
#define USBHS_ENDPTNAKEN_EPRNE_MASK              (0x0FUL << USBHS_ENDPTNAKEN_EPRNE_SHIFT)            /*!< USBHS_ENDPTNAKEN: EPRNE Mask            */
#define USBHS_ENDPTNAKEN_EPRNE_SHIFT             0                                                   /*!< USBHS_ENDPTNAKEN: EPRNE Position        */
