podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define USBHS_ENDPTNAKEN_EPRNE(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_ENDPTNAKEN_EPRNE_SHIFT))&USBHS_ENDPTNAKEN_EPRNE_MASK) /*!< USBHS_ENDPTNAKEN                        */
#define USBHS_ENDPTNAKEN_EPTNE_MASK              (0x0FUL << USBHS_ENDPTNAKEN_EPTNE_SHIFT)            /*!< USBHS_ENDPTNAKEN: EPTNE Mask            */
#define USBHS_ENDPTNAKEN_EPTNE_SHIFT             16                                                  /*!< USBHS_ENDPTNAKEN: EPTNE Position        */
#define USBHS_ENDPTNAKEN_EPTNE(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_ENDPTNAKEN_EPTNE_SHIFT))&USBHS_ENDPTNAKEN_EPTNE_MASK) /*!< USBHS_ENDPTNAKEN                        */
/* ------- CONFIGFLAG Bit Fields                    ------ */
/* ------- PORTSC1 Bit Fields                       ------ */
#define USBHS_PORTSC1_CCS_MASK                   (0x01UL << USBHS_PORTSC1_CCS_SHIFT)                 /*!< USBHS_PORTSC1: CCS Mask                 */
#define USBHS_PORTSC1_CCS_SHIFT                  0                                                   /*!< USBHS_PORTSC1: CCS Position             */
#define USBHS_PORTSC1_CSC_MASK                   (0x01UL << USBHS_PORTSC1_CSC_SHIFT)                 /*!< USBHS_PORTSC1: CSC Mask                 */
#define USBHS_PORTSC1_CSC_SHIFT                  1                                                   /*!< USBHS_PORTSC1: CSC Position             */
#define USBHS_PORTSC1_PE_MASK                    (0x01UL << USBHS_PORTSC1_PE_SHIFT)                  /*!< USBHS_PORTSC1: PE Mask                  */
#define USBHS_PORTSC1_PE_SHIFT                   2                                                   /*!< USBHS_PORTSC1: PE Position              */
#define USBHS_PORTSC1_PEC_MASK                   (0x01UL << USBHS_PORTSC1_PEC_SHIFT)                 /*!< USBHS_PORTSC1: PEC Mask                 */
#define USBHS_PORTSC1_PEC_SHIFT                  3                                                   /*!< USBHS_PORTSC1: PEC Position             */
#define USBHS_PORTSC1_OCA_MASK                   (0x01UL << USBHS_PORTSC1_OCA_SHIFT)                 /*!< USBHS_PORTSC1: OCA Mask                 */
#define USBHS_PORTSC1_OCA_SHIFT                  4                                                   /*!< USBHS_PORTSC1: OCA Position             */
#define USBHS_PORTSC1_OCC_MASK                   (0x01UL << USBHS_PORTSC1_OCC_SHIFT)                 /*!< USBHS_PORTSC1: OCC Mask                 */
#define USBHS_PORTSC1_OCC_SHIFT                  5                                                   /*!< USBHS_PORTSC1: OCC Position             */
#define USBHS_PORTSC1_FPR_MASK                   (0x01UL << USBHS_PORTSC1_FPR_SHIFT)                 /*!< USBHS_PORTSC1: FPR Mask                 */
#define USBHS_PORTSC1_FPR_SHIFT                  6                                                   /*!< USBHS_PORTSC1: FPR Position             */
#define USBHS_PORTSC1_SUSP_MASK                  (0x01UL << USBHS_PORTSC1_SUSP_SHIFT)                /*!< USBHS_PORTSC1: SUSP Mask                */
#define USBHS_PORTSC1_SUSP_SHIFT                 7                                                   /*!< USBHS_PORTSC1: SUSP Position            */
#define USBHS_PORTSC1_PR_MASK                    (0x01UL << USBHS_PORTSC1_PR_SHIFT)                  /*!< USBHS_PORTSC1: PR Mask                  */
#define USBHS_PORTSC1_PR_SHIFT                   8                                                   /*!< USBHS_PORTSC1: PR Position              */
#define USBHS_PORTSC1_HSP_MASK                   (0x01UL << USBHS_PORTSC1_HSP_SHIFT)                 /*!< USBHS_PORTSC1: HSP Mask                 */
#define USBHS_PORTSC1_HSP_SHIFT                  9                                                   /*!< USBHS_PORTSC1: HSP Position             */
#define USBHS_PORTSC1_LS_MASK                    (0x03UL << USBHS_PORTSC1_LS_SHIFT)                  /*!< USBHS_PORTSC1: LS Mask                  */
#define USBHS_PORTSC1_LS_SHIFT                   10                                                  /*!< USBHS_PORTSC1: LS Position              */
#define USBHS_PORTSC1_LS(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_LS_SHIFT))&USBHS_PORTSC1_LS_MASK) /*!< USBHS_PORTSC1                           */
#define USBHS_PORTSC1_PP_MASK                    (0x01UL << USBHS_PORTSC1_PP_SHIFT)                  /*!< USBHS_PORTSC1: PP Mask                  */
#define USBHS_PORTSC1_PP_SHIFT                   12                                                  /*!< USBHS_PORTSC1: PP Position              */
#define USBHS_PORTSC1_PO_MASK                    (0x01UL << USBHS_PORTSC1_PO_SHIFT)                  /*!< USBHS_PORTSC1: PO Mask                  */
#define USBHS_PORTSC1_PO_SHIFT                   13                                                  /*!< USBHS_PORTSC1: PO Position              */
#define USBHS_PORTSC1_PIC_MASK                   (0x03UL << USBHS_PORTSC1_PIC_SHIFT)                 /*!< USBHS_PORTSC1: PIC Mask                 */
#define USBHS_PORTSC1_PIC_SHIFT                  14                                                  /*!< USBHS_PORTSC1: PIC Position             */
#define USBHS_PORTSC1_PIC(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PIC_SHIFT))&USBHS_PORTSC1_PIC_MASK) /*!< USBHS_PORTSC1                           */
#define USBHS_PORTSC1_PTC_MASK                   (0x0FUL << USBHS_PORTSC1_PTC_SHIFT)                 /*!< USBHS_PORTSC1: PTC Mask                 */
#define USBHS_PORTSC1_PTC_SHIFT                  16                                                  /*!< USBHS_PORTSC1: PTC Position             */
#define USBHS_PORTSC1_PTC(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PTC_SHIFT))&USBHS_PORTSC1_PTC_MASK) /*!< USBHS_PORTSC1                           */
#define USBHS_PORTSC1_WKCN_MASK                  (0x01UL << USBHS_PORTSC1_WKCN_SHIFT)                /*!< USBHS_PORTSC1: WKCN Mask                */
#define USBHS_PORTSC1_WKCN_SHIFT                 20                                                  /*!< USBHS_PORTSC1: WKCN Position            */
#define USBHS_PORTSC1_WKDS_MASK                  (0x01UL << USBHS_PORTSC1_WKDS_SHIFT)                /*!< USBHS_PORTSC1: WKDS Mask                */
#define USBHS_PORTSC1_WKDS_SHIFT                 21                                                  /*!< USBHS_PORTSC1: WKDS Position            */
#define USBHS_PORTSC1_WKOC_MASK                  (0x01UL << USBHS_PORTSC1_WKOC_SHIFT)                /*!< USBHS_PORTSC1: WKOC Mask                */
#define USBHS_PORTSC1_WKOC_SHIFT                 22                                                  /*!< USBHS_PORTSC1: WKOC Position            */
#define USBHS_PORTSC1_PHCD_MASK                  (0x01UL << USBHS_PORTSC1_PHCD_SHIFT)                /*!< USBHS_PORTSC1: PHCD Mask                */
#define USBHS_PORTSC1_PHCD_SHIFT                 23                                                  /*!< USBHS_PORTSC1: PHCD Position            */
#define USBHS_PORTSC1_PFSC_MASK                  (0x01UL << USBHS_PORTSC1_PFSC_SHIFT)                /*!< USBHS_PORTSC1: PFSC Mask                */
#define USBHS_PORTSC1_PFSC_SHIFT                 24                                                  /*!< USBHS_PORTSC1: PFSC Position            */
#define USBHS_PORTSC1_PSPD_MASK                  (0x03UL << USBHS_PORTSC1_PSPD_SHIFT)                /*!< USBHS_PORTSC1: PSPD Mask                */
#define USBHS_PORTSC1_PSPD_SHIFT                 26                                                  /*!< USBHS_PORTSC1: PSPD Position            */
#define USBHS_PORTSC1_PSPD(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PSPD_SHIFT))&USBHS_PORTSC1_PSPD_MASK) /*!< USBHS_PORTSC1                           */
#define USBHS_PORTSC1_PTS_MASK                   (0x03UL << USBHS_PORTSC1_PTS_SHIFT)                 /*!< USBHS_PORTSC1: PTS Mask                 */
#define USBHS_PORTSC1_PTS_SHIFT                  30                                                  /*!< USBHS_PORTSC1: PTS Position             */
#define USBHS_PORTSC1_PTS(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PTS_SHIFT))&USBHS_PORTSC1_PTS_MASK) /*!< USBHS_PORTSC1                           */
/* ------- OTGSC Bit Fields                         ------ */
#define USBHS_OTGSC_VD_MASK                      (0x01UL << USBHS_OTGSC_VD_SHIFT)                    /*!< USBHS_OTGSC: VD Mask                    */
#define USBHS_OTGSC_VD_SHIFT                     0                                                   /*!< USBHS_OTGSC: VD Position                */
#define USBHS_OTGSC_VC_MASK                      (0x01UL << USBHS_OTGSC_VC_SHIFT)                    /*!< USBHS_OTGSC: VC Mask                    */
#define USBHS_OTGSC_VC_SHIFT                     1                                                   /*!< USBHS_OTGSC: VC Position                */
#define USBHS_OTGSC_HAAR_MASK                    (0x01UL << USBHS_OTGSC_HAAR_SHIFT)                  /*!< USBHS_OTGSC: HAAR Mask                  */
#define USBHS_OTGSC_HAAR_SHIFT                   2                                                   /*!< USBHS_OTGSC: HAAR Position              */
#define USBHS_OTGSC_OT_MASK                      (0x01UL << USBHS_OTGSC_OT_SHIFT)                    /*!< USBHS_OTGSC: OT Mask                    */
#define USBHS_OTGSC_OT_SHIFT                     3                                                   /*!< USBHS_OTGSC: OT Position                */
#define USBHS_OTGSC_DP_MASK                      (0x01UL << USBHS_OTGSC_DP_SHIFT)                    /*!< USBHS_OTGSC: DP Mask                    */
#define USBHS_OTGSC_DP_SHIFT                     4                                                   /*!< USBHS_OTGSC: DP Position                */
#define USBHS_OTGSC_IDPU_MASK                    (0x01UL << USBHS_OTGSC_IDPU_SHIFT)                  /*!< USBHS_OTGSC: IDPU Mask                  */
#define USBHS_OTGSC_IDPU_SHIFT                   5                                                   /*!< USBHS_OTGSC: IDPU Position              */
#define USBHS_OTGSC_HABA_MASK                    (0x01UL << USBHS_OTGSC_HABA_SHIFT)                  /*!< USBHS_OTGSC: HABA Mask                  */
#define USBHS_OTGSC_HABA_SHIFT                   7                                                   /*!< USBHS_OTGSC: HABA Position              */
#define USBHS_OTGSC_ID_MASK                      (0x01UL << USBHS_OTGSC_ID_SHIFT)                    /*!< USBHS_OTGSC: ID Mask                    */
#define USBHS_OTGSC_ID_SHIFT                     8                                                   /*!< USBHS_OTGSC: ID Position                */
#define USBHS_OTGSC_AVV_MASK                     (0x01UL << USBHS_OTGSC_AVV_SHIFT)                   /*!< USBHS_OTGSC: AVV Mask                   */
#define USBHS_OTGSC_AVV_SHIFT                    9                                                   /*!< USBHS_OTGSC: AVV Position               */
#define USBHS_OTGSC_ASV_MASK                     (0x01UL << USBHS_OTGSC_ASV_SHIFT)                   /*!< USBHS_OTGSC: ASV Mask                   */
#define USBHS_OTGSC_ASV_SHIFT                    10                                                  /*!< USBHS_OTGSC: ASV Position               */
#define USBHS_OTGSC_BSV_MASK                     (0x01UL << USBHS_OTGSC_BSV_SHIFT)                   /*!< USBHS_OTGSC: BSV Mask                   */
#define USBHS_OTGSC_BSV_SHIFT                    11                                                  /*!< USBHS_OTGSC: BSV Position               */
#define USBHS_OTGSC_BSE_MASK                     (0x01UL << USBHS_OTGSC_BSE_SHIFT)                   /*!< USBHS_OTGSC: BSE Mask                   */
#define USBHS_OTGSC_BSE_SHIFT                    12                                                  /*!< USBHS_OTGSC: BSE Position               */
#define USBHS_OTGSC_MST_MASK                     (0x01UL << USBHS_OTGSC_MST_SHIFT)                   /*!< USBHS_OTGSC: MST Mask                   */
#define USBHS_OTGSC_MST_SHIFT                    13                                                  /*!< USBHS_OTGSC: MST Position               */
#define USBHS_OTGSC_DPS_MASK                     (0x01UL << USBHS_OTGSC_DPS_SHIFT)                   /*!< USBHS_OTGSC: DPS Mask                   */
#define USBHS_OTGSC_DPS_SHIFT                    14                                                  /*!< USBHS_OTGSC: DPS Position               */
#define USBHS_OTGSC_IDIS_MASK                    (0x01UL << USBHS_OTGSC_IDIS_SHIFT)                  /*!< USBHS_OTGSC: IDIS Mask                  */
#define USBHS_OTGSC_IDIS_SHIFT                   16                                                  /*!< USBHS_OTGSC: IDIS Position              */
#define USBHS_OTGSC_AVVIS_MASK                   (0x01UL << USBHS_OTGSC_AVVIS_SHIFT)                 /*!< USBHS_OTGSC: AVVIS Mask                 */
#define USBHS_OTGSC_AVVIS_SHIFT                  17                                                  /*!< USBHS_OTGSC: AVVIS Position             */
#define USBHS_OTGSC_ASVIS_MASK                   (0x01UL << USBHS_OTGSC_ASVIS_SHIFT)                 /*!< USBHS_OTGSC: ASVIS Mask                 */
#define USBHS_OTGSC_ASVIS_SHIFT                  18                                                  /*!< USBHS_OTGSC: ASVIS Position             */
#define USBHS_OTGSC_BSVIS_MASK                   (0x01UL << USBHS_OTGSC_BSVIS_SHIFT)                 /*!< USBHS_OTGSC: BSVIS Mask                 */
#define USBHS_OTGSC_BSVIS_SHIFT                  19                                                  /*!< USBHS_OTGSC: BSVIS Position             */
#define USBHS_OTGSC_BSEIS_MASK                   (0x01UL << USBHS_OTGSC_BSEIS_SHIFT)                 /*!< USBHS_OTGSC: BSEIS Mask                 */
#define USBHS_OTGSC_BSEIS_SHIFT                  20                                                  /*!< USBHS_OTGSC: BSEIS Position             */
#define USBHS_OTGSC_MSS_MASK                     (0x01UL << USBHS_OTGSC_MSS_SHIFT)                   /*!< USBHS_OTGSC: MSS Mask                   */
#define USBHS_OTGSC_MSS_SHIFT                    21                                                  /*!< USBHS_OTGSC: MSS Position               */
#define USBHS_OTGSC_DPIS_MASK                    (0x01UL << USBHS_OTGSC_DPIS_SHIFT)                  /*!< USBHS_OTGSC: DPIS Mask                  */
#define USBHS_OTGSC_DPIS_SHIFT                   22                                                  /*!< USBHS_OTGSC: DPIS Position              */
#define USBHS_OTGSC_IDIE_MASK                    (0x01UL << USBHS_OTGSC_IDIE_SHIFT)                  /*!< USBHS_OTGSC: IDIE Mask                  */
#define USBHS_OTGSC_IDIE_SHIFT                   24                                                  /*!< USBHS_OTGSC: IDIE Position              */
#define USBHS_OTGSC_AVVIE_MASK                   (0x01UL << USBHS_OTGSC_AVVIE_SHIFT)                 /*!< USBHS_OTGSC: AVVIE Mask                 */
#define USBHS_OTGSC_AVVIE_SHIFT                  25                                                  /*!< USBHS_OTGSC: AVVIE Position             */
#define USBHS_OTGSC_ASVIE_MASK                   (0x01UL << USBHS_OTGSC_ASVIE_SHIFT)                 /*!< USBHS_OTGSC: ASVIE Mask                 */
#define USBHS_OTGSC_ASVIE_SHIFT                  26                                                  /*!< USBHS_OTGSC: ASVIE Position             */
#define USBHS_OTGSC_BSVIE_MASK                   (0x01UL << USBHS_OTGSC_BSVIE_SHIFT)                 /*!< USBHS_OTGSC: BSVIE Mask                 */
#define USBHS_OTGSC_BSVIE_SHIFT                  27                                                  /*!< USBHS_OTGSC: BSVIE Position             */
#define USBHS_OTGSC_BSEIE_MASK                   (0x01UL << USBHS_OTGSC_BSEIE_SHIFT)                 /*!< USBHS_OTGSC: BSEIE Mask                 */
#define USBHS_OTGSC_BSEIE_SHIFT                  28                                                  /*!< USBHS_OTGSC: BSEIE Position             */
#define USBHS_OTGSC_MSE_MASK                     (0x01UL << USBHS_OTGSC_MSE_SHIFT)                   /*!< USBHS_OTGSC: MSE Mask                   */
#define USBHS_OTGSC_MSE_SHIFT                    29                                                  /*!< USBHS_OTGSC: MSE Position               */
#define USBHS_OTGSC_DPIE_MASK                    (0x01UL << USBHS_OTGSC_DPIE_SHIFT)                  /*!< USBHS_OTGSC: DPIE Mask                  */
#define USBHS_OTGSC_DPIE_SHIFT                   30                                                  /*!< USBHS_OTGSC: DPIE Position              */
/* ------- USBMODE Bit Fields                       ------ */
#define USBHS_USBMODE_CM_MASK                    (0x03UL << USBHS_USBMODE_CM_SHIFT)                  /*!< USBHS_USBMODE: CM Mask                  */
#define USBHS_USBMODE_CM_SHIFT                   0                                                   /*!< USBHS_USBMODE: CM Position              */
#define USBHS_USBMODE_CM(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_CM_SHIFT))&USBHS_USBMODE_CM_MASK) /*!< USBHS_USBMODE                           */
#define USBHS_USBMODE_ES_MASK                    (0x01UL << USBHS_USBMODE_ES_SHIFT)                  /*!< USBHS_USBMODE: ES Mask                  */
#define USBHS_USBMODE_ES_SHIFT                   2                                                   /*!< USBHS_USBMODE: ES Position              */
#define USBHS_USBMODE_SLOM_MASK                  (0x01UL << USBHS_USBMODE_SLOM_SHIFT)                /*!< USBHS_USBMODE: SLOM Mask                */
#define USBHS_USBMODE_SLOM_SHIFT                 3                                                   /*!< USBHS_USBMODE: SLOM Position            */
#define USBHS_USBMODE_SDIS_MASK                  (0x01UL << USBHS_USBMODE_SDIS_SHIFT)                /*!< USBHS_USBMODE: SDIS Mask                */
#define USBHS_USBMODE_SDIS_SHIFT                 4                                                   /*!< USBHS_USBMODE: SDIS Position            */
#define USBHS_USBMODE_TXHSD_MASK                 (0x07UL << USBHS_USBMODE_TXHSD_SHIFT)               /*!< USBHS_USBMODE: TXHSD Mask               */
#define USBHS_USBMODE_TXHSD_SHIFT                12                                                  /*!< USBHS_USBMODE: TXHSD Position           */
#define USBHS_USBMODE_TXHSD(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_TXHSD_SHIFT))&USBHS_USBMODE_TXHSD_MASK) /*!< USBHS_USBMODE                           */
/* ------- EPSETUPSR Bit Fields                     ------ */
#define USBHS_EPSETUPSR_EPSETUPSTAT_MASK         (0x0FUL << USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT)       /*!< USBHS_EPSETUPSR: EPSETUPSTAT Mask       */
#define USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT        0                                                   /*!< USBHS_EPSETUPSR: EPSETUPSTAT Position   */
#define USBHS_EPSETUPSR_EPSETUPSTAT(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT))&USBHS_EPSETUPSR_EPSETUPSTAT_MASK) /*!< USBHS_EPSETUPSR                         */
/* ------- EPPRIME Bit Fields                       ------ */
#define USBHS_EPPRIME_PERB_MASK                  (0x0FUL << USBHS_EPPRIME_PERB_SHIFT)                /*!< USBHS_EPPRIME: PERB Mask                */
#define USBHS_EPPRIME_PERB_SHIFT                 0                                                   /*!< USBHS_EPPRIME: PERB Position            */
#define USBHS_EPPRIME_PERB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPPRIME_PERB_SHIFT))&USBHS_EPPRIME_PERB_MASK) /*!< USBHS_EPPRIME                           */
#define USBHS_EPPRIME_PETB_MASK                  (0x0FUL << USBHS_EPPRIME_PETB_SHIFT)                /*!< USBHS_EPPRIME: PETB Mask                */
#define USBHS_EPPRIME_PETB_SHIFT                 16                                                  /*!< USBHS_EPPRIME: PETB Position            */
#define USBHS_EPPRIME_PETB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPPRIME_PETB_SHIFT))&USBHS_EPPRIME_PETB_MASK) /*!< USBHS_EPPRIME                           */
/* ------- EPFLUSH Bit Fields                       ------ */
#define USBHS_EPFLUSH_FERB_MASK                  (0x0FUL << USBHS_EPFLUSH_FERB_SHIFT)                /*!< USBHS_EPFLUSH: FERB Mask                */
#define USBHS_EPFLUSH_FERB_SHIFT                 0                                                   /*!< USBHS_EPFLUSH: FERB Position            */
#define USBHS_EPFLUSH_FERB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPFLUSH_FERB_SHIFT))&USBHS_EPFLUSH_FERB_MASK) /*!< USBHS_EPFLUSH                           */
#define USBHS_EPFLUSH_FETB_MASK                  (0x0FUL << USBHS_EPFLUSH_FETB_SHIFT)                /*!< USBHS_EPFLUSH: FETB Mask                */
#define USBHS_EPFLUSH_FETB_SHIFT                 16                                                  /*!< USBHS_EPFLUSH: FETB Position            */
#define USBHS_EPFLUSH_FETB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPFLUSH_FETB_SHIFT))&USBHS_EPFLUSH_FETB_MASK) /*!< USBHS_EPFLUSH                           */
/* ------- EPSR Bit Fields                          ------ */
#define USBHS_EPSR_ERBR_MASK                     (0x0FUL << USBHS_EPSR_ERBR_SHIFT)                   /*!< USBHS_EPSR: ERBR Mask                   */
#define USBHS_EPSR_ERBR_SHIFT                    0                                                   /*!< USBHS_EPSR: ERBR Position               */
#define USBHS_EPSR_ERBR(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPSR_ERBR_SHIFT))&USBHS_EPSR_ERBR_MASK) /*!< USBHS_EPSR                              */
#define USBHS_EPSR_ETBR_MASK                     (0x0FUL << USBHS_EPSR_ETBR_SHIFT)                   /*!< USBHS_EPSR: ETBR Mask                   */
#define USBHS_EPSR_ETBR_SHIFT                    16                                                  /*!< USBHS_EPSR: ETBR Position               */
#define USBHS_EPSR_ETBR(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPSR_ETBR_SHIFT))&USBHS_EPSR_ETBR_MASK) /*!< USBHS_EPSR                              */
/* ------- EPCOMPLETE Bit Fields                    ------ */
#define USBHS_EPCOMPLETE_ERCE_MASK               (0x0FUL << USBHS_EPCOMPLETE_ERCE_SHIFT)             /*!< USBHS_EPCOMPLETE: ERCE Mask             */
#define USBHS_EPCOMPLETE_ERCE_SHIFT              0                                                   /*!< USBHS_EPCOMPLETE: ERCE Position         */
#define USBHS_EPCOMPLETE_ERCE(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_EPCOMPLETE_ERCE_SHIFT))&USBHS_EPCOMPLETE_ERCE_MASK) /*!< USBHS_EPCOMPLETE                        */
#define USBHS_EPCOMPLETE_ETCE_MASK               (0x0FUL << USBHS_EPCOMPLETE_ETCE_SHIFT)             /*!< USBHS_EPCOMPLETE: ETCE Mask             */
#define USBHS_EPCOMPLETE_ETCE_SHIFT              16                                                  /*!< USBHS_EPCOMPLETE: ETCE Position         */
#define USBHS_EPCOMPLETE_ETCE(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_EPCOMPLETE_ETCE_SHIFT))&USBHS_EPCOMPLETE_ETCE_MASK) /*!< USBHS_EPCOMPLETE                        */
/* ------- EPCR0 Bit Fields                         ------ */
#define USBHS_EPCR0_RXS_MASK                     (0x01UL << USBHS_EPCR0_RXS_SHIFT)                   /*!< USBHS_EPCR0: RXS Mask                   */
#define USBHS_EPCR0_RXS_SHIFT                    0                                                   /*!< USBHS_EPCR0: RXS Position               */
#define USBHS_EPCR0_RXT_MASK                     (0x03UL << USBHS_EPCR0_RXT_SHIFT)                   /*!< USBHS_EPCR0: RXT Mask                   */
#define USBHS_EPCR0_RXT_SHIFT                    2                                                   /*!< USBHS_EPCR0: RXT Position               */
