podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK61F15WS.h
#define USBHS_EPCR0_RXT(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_RXT_SHIFT))&USBHS_EPCR0_RXT_MASK) /*!< USBHS_EPCR0                             */
#define USBHS_EPCR0_RXE_MASK                     (0x01UL << USBHS_EPCR0_RXE_SHIFT)                   /*!< USBHS_EPCR0: RXE Mask                   */
#define USBHS_EPCR0_RXE_SHIFT                    7                                                   /*!< USBHS_EPCR0: RXE Position               */
#define USBHS_EPCR0_TXS_MASK                     (0x01UL << USBHS_EPCR0_TXS_SHIFT)                   /*!< USBHS_EPCR0: TXS Mask                   */
#define USBHS_EPCR0_TXS_SHIFT                    16                                                  /*!< USBHS_EPCR0: TXS Position               */
#define USBHS_EPCR0_TXT_MASK                     (0x03UL << USBHS_EPCR0_TXT_SHIFT)                   /*!< USBHS_EPCR0: TXT Mask                   */
#define USBHS_EPCR0_TXT_SHIFT                    18                                                  /*!< USBHS_EPCR0: TXT Position               */
#define USBHS_EPCR0_TXT(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_TXT_SHIFT))&USBHS_EPCR0_TXT_MASK) /*!< USBHS_EPCR0                             */
#define USBHS_EPCR0_TXE_MASK                     (0x01UL << USBHS_EPCR0_TXE_SHIFT)                   /*!< USBHS_EPCR0: TXE Mask                   */
#define USBHS_EPCR0_TXE_SHIFT                    23                                                  /*!< USBHS_EPCR0: TXE Position               */
/* ------- EPCR Bit Fields                          ------ */
#define USBHS_EPCR_RXS_MASK                      (0x01UL << USBHS_EPCR_RXS_SHIFT)                    /*!< USBHS_EPCR: RXS Mask                    */
#define USBHS_EPCR_RXS_SHIFT                     0                                                   /*!< USBHS_EPCR: RXS Position                */
#define USBHS_EPCR_RXD_MASK                      (0x01UL << USBHS_EPCR_RXD_SHIFT)                    /*!< USBHS_EPCR: RXD Mask                    */
#define USBHS_EPCR_RXD_SHIFT                     1                                                   /*!< USBHS_EPCR: RXD Position                */
#define USBHS_EPCR_RXT_MASK                      (0x03UL << USBHS_EPCR_RXT_SHIFT)                    /*!< USBHS_EPCR: RXT Mask                    */
#define USBHS_EPCR_RXT_SHIFT                     2                                                   /*!< USBHS_EPCR: RXT Position                */
#define USBHS_EPCR_RXT(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_RXT_SHIFT))&USBHS_EPCR_RXT_MASK) /*!< USBHS_EPCR                              */
#define USBHS_EPCR_RXI_MASK                      (0x01UL << USBHS_EPCR_RXI_SHIFT)                    /*!< USBHS_EPCR: RXI Mask                    */
#define USBHS_EPCR_RXI_SHIFT                     5                                                   /*!< USBHS_EPCR: RXI Position                */
#define USBHS_EPCR_RXR_MASK                      (0x01UL << USBHS_EPCR_RXR_SHIFT)                    /*!< USBHS_EPCR: RXR Mask                    */
#define USBHS_EPCR_RXR_SHIFT                     6                                                   /*!< USBHS_EPCR: RXR Position                */
#define USBHS_EPCR_RXE_MASK                      (0x01UL << USBHS_EPCR_RXE_SHIFT)                    /*!< USBHS_EPCR: RXE Mask                    */
#define USBHS_EPCR_RXE_SHIFT                     7                                                   /*!< USBHS_EPCR: RXE Position                */
#define USBHS_EPCR_TXS_MASK                      (0x01UL << USBHS_EPCR_TXS_SHIFT)                    /*!< USBHS_EPCR: TXS Mask                    */
#define USBHS_EPCR_TXS_SHIFT                     16                                                  /*!< USBHS_EPCR: TXS Position                */
#define USBHS_EPCR_TXD_MASK                      (0x01UL << USBHS_EPCR_TXD_SHIFT)                    /*!< USBHS_EPCR: TXD Mask                    */
#define USBHS_EPCR_TXD_SHIFT                     17                                                  /*!< USBHS_EPCR: TXD Position                */
#define USBHS_EPCR_TXT_MASK                      (0x03UL << USBHS_EPCR_TXT_SHIFT)                    /*!< USBHS_EPCR: TXT Mask                    */
#define USBHS_EPCR_TXT_SHIFT                     18                                                  /*!< USBHS_EPCR: TXT Position                */
#define USBHS_EPCR_TXT(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_TXT_SHIFT))&USBHS_EPCR_TXT_MASK) /*!< USBHS_EPCR                              */
#define USBHS_EPCR_TXI_MASK                      (0x01UL << USBHS_EPCR_TXI_SHIFT)                    /*!< USBHS_EPCR: TXI Mask                    */
#define USBHS_EPCR_TXI_SHIFT                     21                                                  /*!< USBHS_EPCR: TXI Position                */
#define USBHS_EPCR_TXR_MASK                      (0x01UL << USBHS_EPCR_TXR_SHIFT)                    /*!< USBHS_EPCR: TXR Mask                    */
#define USBHS_EPCR_TXR_SHIFT                     22                                                  /*!< USBHS_EPCR: TXR Position                */
#define USBHS_EPCR_TXE_MASK                      (0x01UL << USBHS_EPCR_TXE_SHIFT)                    /*!< USBHS_EPCR: TXE Mask                    */
#define USBHS_EPCR_TXE_SHIFT                     23                                                  /*!< USBHS_EPCR: TXE Position                */
/* ------- USBGENCTRL Bit Fields                    ------ */
#define USBHS_USBGENCTRL_WU_IE_MASK              (0x01UL << USBHS_USBGENCTRL_WU_IE_SHIFT)            /*!< USBHS_USBGENCTRL: WU_IE Mask            */
#define USBHS_USBGENCTRL_WU_IE_SHIFT             0                                                   /*!< USBHS_USBGENCTRL: WU_IE Position        */
#define USBHS_USBGENCTRL_WU_ULPI_EN_MASK         (0x01UL << USBHS_USBGENCTRL_WU_ULPI_EN_SHIFT)       /*!< USBHS_USBGENCTRL: WU_ULPI_EN Mask       */
#define USBHS_USBGENCTRL_WU_ULPI_EN_SHIFT        1                                                   /*!< USBHS_USBGENCTRL: WU_ULPI_EN Position   */
#define USBHS_USBGENCTRL_WU_INT_CLR_MASK         (0x01UL << USBHS_USBGENCTRL_WU_INT_CLR_SHIFT)       /*!< USBHS_USBGENCTRL: WU_INT_CLR Mask       */
#define USBHS_USBGENCTRL_WU_INT_CLR_SHIFT        5                                                   /*!< USBHS_USBGENCTRL: WU_INT_CLR Position   */
/**
 * @} */ /* End group USBHS_Register_Masks_GROUP 
 */

/* USBHS - Peripheral instance base addresses */
#define USBHS_BasePtr                  0x40034000UL //!< Peripheral base address
#define USBHS                          ((USBHS_Type *) USBHS_BasePtr) //!< Freescale base pointer
#define USBHS_BASE_PTR                 (USBHS) //!< Freescale style base pointer
/**
 * @} */ /* End group USBHS_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup VREF_Peripheral_access_layer_GROUP VREF Peripheral Access Layer
* @brief C Struct for VREF
* @{
*/

/* ================================================================================ */
/* ================           VREF (file:VREF_A)                   ================ */
/* ================================================================================ */

/**
 * @brief Voltage Reference
 */
/**
* @addtogroup VREF_structs_GROUP VREF struct
* @brief Struct for VREF
* @{
*/
typedef struct {                                /*       VREF Structure                                               */
   __IO uint8_t   TRM;                          /**< 0000: Trim Register                                                */
   __IO uint8_t   SC;                           /**< 0001: Status and Control Register                                  */
} VREF_Type;

/**
 * @} */ /* End group VREF_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'VREF' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup VREF_Register_Masks_GROUP VREF Register Masks
* @brief Register Masks for VREF
* @{
*/
/* ------- TRM Bit Fields                           ------ */
#define VREF_TRM_TRIM_MASK                       (0x3FUL << VREF_TRM_TRIM_SHIFT)                     /*!< VREF_TRM: TRIM Mask                     */
#define VREF_TRM_TRIM_SHIFT                      0                                                   /*!< VREF_TRM: TRIM Position                 */
#define VREF_TRM_TRIM(x)                         (((uint8_t)(((uint8_t)(x))<<VREF_TRM_TRIM_SHIFT))&VREF_TRM_TRIM_MASK) /*!< VREF_TRM                                */
/* ------- SC Bit Fields                            ------ */
#define VREF_SC_MODE_LV_MASK                     (0x03UL << VREF_SC_MODE_LV_SHIFT)                   /*!< VREF_SC: MODE_LV Mask                   */
#define VREF_SC_MODE_LV_SHIFT                    0                                                   /*!< VREF_SC: MODE_LV Position               */
#define VREF_SC_MODE_LV(x)                       (((uint8_t)(((uint8_t)(x))<<VREF_SC_MODE_LV_SHIFT))&VREF_SC_MODE_LV_MASK) /*!< VREF_SC                                 */
#define VREF_SC_VREFST_MASK                      (0x01UL << VREF_SC_VREFST_SHIFT)                    /*!< VREF_SC: VREFST Mask                    */
#define VREF_SC_VREFST_SHIFT                     2                                                   /*!< VREF_SC: VREFST Position                */
#define VREF_SC_REGEN_MASK                       (0x01UL << VREF_SC_REGEN_SHIFT)                     /*!< VREF_SC: REGEN Mask                     */
#define VREF_SC_REGEN_SHIFT                      6                                                   /*!< VREF_SC: REGEN Position                 */
#define VREF_SC_VREFEN_MASK                      (0x01UL << VREF_SC_VREFEN_SHIFT)                    /*!< VREF_SC: VREFEN Mask                    */
#define VREF_SC_VREFEN_SHIFT                     7                                                   /*!< VREF_SC: VREFEN Position                */
/**
 * @} */ /* End group VREF_Register_Masks_GROUP 
 */

/* VREF - Peripheral instance base addresses */
#define VREF_BasePtr                   0x40074000UL //!< Peripheral base address
#define VREF                           ((VREF_Type *) VREF_BasePtr) //!< Freescale base pointer
#define VREF_BASE_PTR                  (VREF) //!< Freescale style base pointer
/**
 * @} */ /* End group VREF_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup WDOG_Peripheral_access_layer_GROUP WDOG Peripheral Access Layer
* @brief C Struct for WDOG
* @{
*/

/* ================================================================================ */
/* ================           WDOG (file:WDOG_MK)                  ================ */
/* ================================================================================ */

/**
 * @brief Watchdog Timer
 */
/**
* @addtogroup WDOG_structs_GROUP WDOG struct
* @brief Struct for WDOG
* @{
*/
typedef struct {                                /*       WDOG Structure                                               */
   __IO uint16_t  STCTRLH;                      /**< 0000: Status and Control Register High                             */
   __IO uint16_t  STCTRLL;                      /**< 0002: Status and Control Register Low                              */
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  TOVAL;                     /**< 0004: Time-out Value Register High TOVALL:TOVALH                   */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __IO uint16_t  TOVALH;                 /**< 0004: Time-out Value Register High                                 */
         __IO uint16_t  TOVALL;                 /**< 0006: Time-out Value Register Low                                  */
      };
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  WIN;                       /**< 0008: Window Register (WINL:WINH)                                  */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __IO uint16_t  WINH;                   /**< 0008: Window Register High                                         */
         __IO uint16_t  WINL;                   /**< 000A: Window Register Low                                          */
      };
   };
   __IO uint16_t  REFRESH;                      /**< 000C: Refresh Register                                             */
   __IO uint16_t  UNLOCK;                       /**< 000E: Unlock Register                                              */
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  TMROUT;                    /**< 0010: Timer Output Register (TMROUTL:TMROUTH)                      */
      struct {                                  /**< 0000: (size=0004)                                                  */
         __IO uint16_t  TMROUTH;                /**< 0010: Timer Output Register High                                   */
         __IO uint16_t  TMROUTL;                /**< 0012: Timer Output Register Low                                    */
      };
   };
   __IO uint16_t  RSTCNT;                       /**< 0014: Reset Count Register                                         */
   __IO uint16_t  PRESC;                        /**< 0016: Prescaler Register                                           */
} WDOG_Type;

/**
 * @} */ /* End group WDOG_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'WDOG' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

